{
    "title=\"woher der Name\"": "\"title=\"where does the name come from\"",
    "de-de": "en-US",
    "branding-de-DE": "branding-en-US",
    ">Vishnu control<": ">Vishnu Control<",
    "Dieses Kapitel gibt einen Überblick über die Kommandos: mit denen Vishnu über Maus und Tastatur gesteuert werden kann.": "This chapter gives an overview of the commands that can be used to control Vishnu via mouse and keyboard.",
    "Vishnu - Observe and control processes": "Vishnu - observe and control processes",
    "Vishnu - der logische Prozess-Monitor": "Vishnu - the logical process monitor",
    "Einstieg": "Quick Start",
    ">Access<": "Quick Start",
    "advanced topics": "Advanced Topics",
    "Versionshistorie": "Version History",
    "Version history": "Version History",
    "Construction sites": "Construction Sites",
    "Own checkers": "own Checkers",
    "Own triggers": "own Triggers",
    "Own logger": "own Loggers",
    "own views": "own Views",
    "Own parameter reader": "own Parameter Reader",
    "Log checker history": "Log Checker History",
    "Known errors and problems": "Known Errors and Problems",
    "Collection of ideas": "Collection of Ideas",
    "Named triggers and loggers": "Named Triggers and Loggers",
    "ein einfaches Beispiel": "a simple Example",
    "a simple example": "a simple Example",
    "woher der Name": "where does the name come from",
    ">details<": ">Details<",
    "Wichtig": "Important",
    "Uebersicht": "Overview",
    "Privacy policy and imprint": "Privacy Policy and Imprint",
    "Vishnu - technical documentation": "Vishnu - technical Documentation",
    "List of pages of interest": "Pages of interest",
    "das Kontext Menü": "Context Menu",
    "the context menu": "Context Menu",
    "Vishnu Logik": "Vishnu Logic",
    ">Vishnu logic<": ">Vishnu Logic<",
    "Serialise": "Serialize",
    "serialise": "serialize",
    "Initialisat": "Initializat",
    "initialise": "initialize",
    "Public Methode": "Public Method",
    "Protected Methode": "Protected Method",
    "Public Eigenschaft": "Public Property",
    "Protected Eigenschaft": "Protected Property",
    "Public Feld": "Public Field",
    "Protected Feld": "Protected Field",
    "Public Klasse": "Public Class",
    "Protected Klasse": "Protected Class",
    "Public Schnittstelle": "Public Interface",
    "Public Delegat": "Public Delegate",
    "Public Ereignis": "Public Event",
    "Anwender-Module sind die Programme, die Ihre Geschäftsprozesse darstellen oder diese beobachten.": "User modules are the programs that represent your business processes or monitor them.",
    "Vishnu setzt Ihren logischen Ausdruck (LogicalExpression, siehe auch ) intern in eine entsprechende Baumstruktur (Tree) um, die logisch verarbeitet wird und welche Sie dann letzten Endes in der Normaldarstellung (&quot;Logical Task Tree&quot;) auch so wiederfinden.": "Vishnu converts your logical expression (LogicalExpression, see also ) internally into a corresponding tree structure (Tree), which is processed logically and which you will ultimately find in the normal display (&quot;Logical Task Tree&quot;).",
    "Version 5.0.5.0 Peace and Sanity (Stand: 16.07.": "Version 5.0.5.0 Peace and Sanity (as of: 16.07.",
    "Version 5.3.1.0 dotnet-framework-final (Stand: 18.02.": "Version 5.3.1.0 dotnet-framework-final (as of: 18.02.",
    "Vishnu bietet eine globale Parameterersetzung an. Das bedeutet, dass alle in Zeichenketten von Übergabeparametern befindlichen Parameternamen, wenn möglich, durch ihre Laufzeitwerte ersetzt werden. Wie das im Detail aussieht, beschreibt dieses Kapitel.": "Vishnu offers global parameter replacement. This means that all parameter names in strings of transfer parameters are replaced by their runtime values, if possible. This chapter describes how this works in detail.",
    "Hier finden Sie weiterführende Informationen.": "Here you will find further information.",
    "Version 8.0.2 Discovery (Stand: 18.11.": "Version 8.0.2 Discovery (as of: 18.11.",
    "Version 5.1.0.0 Treshold (Stand: 04.08.": "Version 5.1.0.0 Treshold (as of: 04.08.",
    "Version 2.4.3.6 (Stand: 23.03.": "Version 2.4.3.6 (as of: 23.03.",
    "In diesem Bereich werden alle Vishnu-Unzulänglichkeiten gesammelt und nach subjektiven Kriterien geordnet.": "In this section, all Vishnu shortcomings are collected and organized according to subjective criteria.",
    "Version 4.8.0.2 Look and Feel (Stand: 17.05.": "Version 4.8.0.2 Look and Feel (Status: 17.05.",
    "Vishnu generiert und verarbeitet alle wesentlichen Ereignisse innerhalb des Trees als TreeEvents. Welche TreeEvents es gibt und wie Sie mit ihnen arbeiten können, erfahren Sie in diesem Kapitel.": "Vishnu generates and processes all significant events within the tree as TreeEvents. This chapter explains which TreeEvents are available and how you can work with them.",
    "Version 8.2.0 Arrival (Stand: 04.05.": "Version 8.2.0 Arrival (as of 04.05.",
    "Hier finden Sie bisherige Überlegungen oder Pläne zur Weiterentwicklung von Vishnu. Eine durchgängige Priorisierung findet nicht statt.": "Here you will find previous considerations or plans for the further development of Vishnu. There is no consistent prioritization.",
    "Version 3.2.0.0 (Stand: 26.04.": "Version 3.2.0.0 (as of: 26.04.",
    "Version 8.1.6 Progress (Stand: 02.02.": "Version 8.1.6 Progress (as of 02.02.",
    "Dieses Kapitel handelt von selbst erstellten Loggern. Über eigene Logger können Sie TreeEvents im Vishnu-Tree nach Ihren Vorstellungen aufbereiten und in eine Log-Datei schreiben.": "This chapter is about self-created loggers. You can use your own loggers to process TreeEvents in the Vishnu tree according to your requirements and write them to a log file.",
    "Version 4.9.0.1 Repository and Install (Stand: 05.08.": "Version 4.9.0.1 Repository and Install (as of 05.08.",
    "Das Vishnu-Kontextmenü stellt verschiedene, teilweise zusätzliche Funktionen zur Verfügung (siehe unten). Der Aufruf erfolgt über die rechte Maustaste.": "The Vishnu context menu provides various functions, some of which are additional (see below). It is called up using the right mouse button.",
    "Version 1.0.3.2 (Stand: 02.11.": "Version 1.0.3.2 (Status: 02.11.",
    "Vishnu is called": "Vishnu is called",
    "Version 2.5.8.7 (Stand: 20.07.": "Version 2.5.8.7 (as of: 20.07.",
    "Version 1.0.3.6 (Stand: 22.12.": "Version 1.0.3.6 (Status: 22.12.",
    "Snapshots sind Momentaufnahmen der Verarbeitung in einem Vishnu-Job. Diese Snapshots können in einem anderen Vishnu-Programm als Teil dessen Jobs angezeigt werden, als ob sie direkt dazugehören würden.": "Snapshots are snapshots of the processing in a Vishnu job. These snapshots can be displayed in another Vishnu program as part of its job, as if they belonged to it directly.",
    "Vishnu startet direkt nach der Erstinstallation mit einem Demo-Job. Diesen werden wir uns jetzt (in einer vereinfachten Fassung) etwas genauer betrachten.": "Vishnu starts with a demo job immediately after the initial installation. We will now take a closer look at this (in a simplified version).",
    "Version 5.0.1.6 HotPlug (Stand: 09.02.": "Version 5.0.1.6 HotPlug (Status: 09.02.",
    "In diesem Abschnitt werden echte Fehler oder Unzulänglichkeiten aufgeführt. Eine durchgängige Priorisierung findet nicht statt.": "This section lists genuine errors or shortcomings. There is no consistent prioritization.",
    "Dieses Kapitel gibt einen Überblick über die Kommandos, mit denen Vishnu über Maus und Tastatur gesteuert werden kann.": "This chapter provides an overview of the commands that can be used to control Vishnu via mouse and keyboard.",
    "Version 2.0.3.0 (Stand: 22.06.": "Version 2.0.3.0 (Status: 22.06.",
    "Dieses Kapitel befasst sich mit besonderen, selbst erstellten View-Dlls. Über eigene Views können Sie die Darstellung von Checkern und deren Prüfungsergebnissen in Vishnu nahezu beliebig erweitern und verändern.": "This chapter deals with special, self-created view dlls. You can use your own views to extend and change the display of checkers and their check results in Vishnu in almost any way you like.",
    "Version 5.3.0.3 Heavy Duty (Stand: 23.12.": "Version 5.3.0.3 Heavy Duty (as of: 23.12.",
    "Version 3.0.1.5 (Stand: 08.02.": "Version 3.0.1.5 (Status: 08.02.",
    "Version 3.1.0.0 (Stand: 13.04.": "Version 3.1.0.0 (as of: 13.04.",
    "Version 2.5.9.3 (Stand: 16.08.": "Version 2.5.9.3 (Status: 16.08.",
    "Version 4.6.1.0 Treewide Environment (Stand: 27.05.": "Version 4.6.1.0 Treewide Environment (as of: 27.05.",
    "Hier können die Änderungen in den verschiedenen Vishnu-Versionen eingesehen werden.": "The changes in the various Vishnu versions can be viewed here.",
    "Version 2.6.1.0 (Stand: 17.10.": "Version 2.6.1.0 (Status: 17.10.",
    "Version 5.0.2.6 Documentation (Stand: 05.07.": "Version 5.0.2.6 Documentation (Version: 05.07.",
    "Liste der für den schnellen Einstieg interessanten Seiten": "List of pages of interest for a quick start",
    "Die Datei Vishnu.exe.config.user ist die zentrale Stelle für Ihre eigenen Vishnu-Einstellungen. Hier finden Sie einige voreingestellte Parameter. Sie können diese ändern, aber auch eigene hinzufügen. Sie finden die Vishnu.exe.config.": "The Vishnu.exe.config.user file is the central location for your own Vishnu settings. Here you will find some preset parameters. You can change these, but also add your own. You will find the Vishnu.exe.config.",
    "Version 4.6.0.0 Clean to .Net 4.6 (Stand: 26.03.": "Version 4.6.0.0 Clean to .Net 4.6 (as of: 26.03.",
    "Version 2.3.0.0 (Stand: 04.11.": "Version 2.3.0.0 (Status: 04.11.",
    "Dieses Kapitel handelt von selbst erstellten Checker-Dlls. Über eigene Checker können Sie die Überwachungen beliebiger Prozesse oder Zustände erreichen, die nur Sie selbst kennen können.": "This chapter is about self-created checker dlls. You can use your own checkers to monitor any processes or statuses that only you can know.",
    "Version 7.0.1.6 Hard Core (Stand: 16.10.": "Version 7.0.1.6 Hard Core (as of: 16.10.",
    "Trigger und Logger sind in der Regel anonym, da sie einem Job oder Checker direkt zugeordnet sind. Dadurch entfällt für sie die Notwendigkeit, über einen LogicalName ansprechbar zu sein.": "Triggers and loggers are usually anonymous, as they are assigned directly to a job or checker. This eliminates the need for them to be addressable via a LogicalName.",
    "Version 8.2.1 Arrival-patch-01 (Stand: 05.07.": "Version 8.2.1 Arrival-patch-01 (Status: 05.07.",
    "Vishnu is a modular system for monitoring and process control with integrated processing of extended logical expressions.": "Vishnu is a modular system for monitoring and process control with integrated processing of extended logical expressions.",
    "Dieses Kapitel handelt von selbst erstellten ValueModifiern.": "This chapter is about self-created ValueModifiers.",
    "Hier finden Sie Details zu verschiedenen Vishnu-Elementen. Neben allgemeinen Funktionsbeschreibungen werden auch Parametrisierung und Rückgabewerte angesprochen und an XML-Beispielen verdeutlicht.": "Here you will find details on various Vishnu elements. In addition to general function descriptions, parameterization and return values are also addressed and illustrated using XML examples.",
    "Version 1.0.4.2 (Stand: 22.04.": "Version 1.0.4.2 (Status: 22.04.",
    "Dieses Kapitel handelt von selbst erstellten Triggern. Über eigene Trigger können Sie Checker im Vishnu-Tree abhängig von Ereignissen in Ihren Geschäftsprozessen neu starten.": "This chapter is about self-created triggers. You can use your own triggers to restart checkers in the Vishnu tree depending on events in your business processes.",
    "Version 1.0.1.4 (Stand: 05.05.": "Version 1.0.1.4 (as of 05.05.",
    "Version 3.1.5.4 (Stand: 07.02.": "Version 3.1.5.4 (Status: 07.02.",
    "Version 3.0.2.8 (Stand: 19.03.": "Version 3.0.2.8 (as of: 19.03.",
    "Mehrere Jobs können in einer einzigen JobDescription.xml zusammengefasst werden. Unten sehen Sie den vereinfachten Demo-Job aus dem Kapitel in der Inline-Version.": "Several jobs can be combined in a single JobDescription.xml. Below you can see the simplified demo job from the chapter in the inline version.",
    "Version 1.0.0.0 (Stand: 04.03.": "Version 1.0.0.0 (Status: 04.03.",
    "Version 4.7.2.1 Direct Response (Stand: 24.01.": "Version 4.7.2.1 Direct Response (as of: 24.01.",
    "Version 2.4.2.1 (Stand: 31.01.": "Version 2.4.2.1 (as of: 31.01.",
    "Das Verhalten von Vishnu kann über diverse Parameter eingestellt werden. Diese Parameter können beim Aufruf von Vishnu über die Kommandozeile mitgegeben werden, sie können aber auch über die , das Environment, oder die Registry eingestellt werden.": "The behavior of Vishnu can be set using various parameters. These parameters can be specified via the command line when Vishnu is called, but they can also be set via the , the environment or the registry.",
    "Auch wenn Vishnu open source und frei ist, kostet die Entwicklung doch viel Zeit und Arbeit und nicht zuletzt das Hosting u.a. der Dokumentation auch Geld.": "Even though Vishnu is open source and free, the development costs a lot of time and work and, last but not least, the hosting of the documentation, among other things, also costs money.",
    "Wird aufgerufen, wenn sich der Verarbeitungszustand eines Knotens geändert hat.": "Is called up if the processing status of a node has changed.",
    "Wird aufgerufen, wenn eine Exception gelöscht wird.": "Is called when an exception is deleted.",
    "Wird aufgerufen, wenn eine Exception aufgetreten ist.": "Is called when an exception has occurred.",
    "Wird aufgerufen, wenn sich das logische Ergebnis eines Knotens geändert hat und ungleich null ist.": "Is called if the logical result of a node has changed and is not equal to zero.",
    "Wird aufgerufen, wenn sich das logische Ergebnis eines Knotens geändert hat.": "Is called if the logical result of a node has changed.",
    "Wird aufgerufen, wenn sich der Verarbeitungs-Fortschritt eines Knotens geändert hat.": "Is called up when the processing progress of a node has changed.",
    "Wird aufgerufen, wenn die Verarbeitung eines Knotens abgeschlossen wurde (unabhängig vom Ergebnis).": "Is called when the processing of a node has been completed (regardless of the result).",
    "Wird aufgerufen, wenn ein Knoten gestartet wurde.": "Is called up when a node has been started.",
    "Wird aufgerufen, wenn sich das Result eines Knotens geändert hat. Dient dazu, die Berechnung des logischen Zustands des übergeordneten Knotens neu zu starten.": "Is called when the result of a node has changed. Used to restart the calculation of the logical state of the parent node.",
    "Wird aufgerufen, wenn sich der Gesamtzustand der dem Knoten zugeordneten Worker geändert hat.": "Is called if the overall status of the workers assigned to the node has changed.",
    "Dieses Event aus IVishnuNode.INotifyPropertiesChanged kann von LogicalNodeViewmodel abonniert werden.": "This event from IVishnuNode.INotifyPropertiesChanged can be subscribed to by LogicalNodeViewmodel.",
    "Wird aufgerufen, wenn sich der Verarbeitungs-Fortschritt des Checkers geändert hat.": "Is called up if the processing progress of the checker has changed.",
    "Wird aufgerufen, wenn sich der Verarbeitungs-Fortschritt einer Task geändert hat.": "Is called up if the processing progress of a task has changed.",
    "Wird aufgerufen, wenn die Verarbeitung einer Task abgeschlossen wurde.": "Is called up when the processing of a task has been completed.",
    "EventHandler für INotifyPropertyChanged (löst bei Änderungen an öffentlichen Properties aus).": "EventHandler for INotifyPropertyChanged (triggers when public properties are changed).",
    "Ereignis das Eintritt, wenn sich der Fortschritt von ZipAccess ändert.": "Event that occurs when the progress of ZipAccess changes.",
    "Ereignis das Eintritt, wenn ZipAccess beendet wird.": "Event that occurs when ZipAccess is terminated.",
    "Dieses Event kann von LogicalNodeViewmodel abonniert werden. Dieses erhält über die übergebenen PropertiesChangedEventArgs eine String-List mit Property-Namen und kann seinerseits über INotifyProperyChanged die UI informieren.": "This event can be subscribed to by LogicalNodeViewmodel. This receives a string list with property names via the transferred PropertiesChangedEventArgs and can in turn inform the UI via INotifyProperyChanged.",
    "Das PropertyChanged-Event für die UI.": "The PropertyChanged event for the UI.",
    "Das Event für eine Veränderung des CanExecute-Status.": "The event for a change in the CanExecute status.",
    "Event, das ausgelöst wird, wenn User-Parameter neu geladen wurden.": "Event that is triggered when user parameters are reloaded.",
    "Kann aufgerufen werden, wenn sich der Verarbeitungsfortschritt des Checkers geändert hat, muss aber zumindest aber einmal zum Schluss der Verarbeitung aufgerufen werden.": "Can be called if the processing progress of the checker has changed, but must be called at least once at the end of processing.",
    "Event, das ausgelöst wird, wenn die Parameter neu geladen wurden.": "Event that is triggered when the parameters have been reloaded.",
    "Wird ausgelöst, wenn sich eine Property ändert.": "Is triggered when a property changes.",
    "Standard Handler für das Einhängen des WPF Event-Systems in das registrierte Event DynamicUserControl_ContentRenderedEvent.": "Standard handler for attaching the WPF event system to the registered event DynamicUserControl_ContentRenderedEvent.",
    "Dieses Kapitel behandelt CheckerHistoryLogger. CheckerHistoryLogger loggen die Ergebnisse beliebiger anderer Checker.": "This chapter deals with CheckerHistoryLogger. CheckerHistoryLoggers log the results of any other checker.",
    "Version 4.0.0.0 Zero Tolerance (Stand: 22.08.": "Version 4.0.0.0 Zero Tolerance (as of: 22.08.",
    "Dieses Kapitel handelt von selbst erstellten ParameterReadern. Über eigene ParameterReader können Sie Ihre business-spezifischen Parameter an Vishnu übergeben, so dass diese in Folge wie alle sonstigen Vishnu-Parameter behandelt werden und z.B.": "This chapter is about custom ParameterReaders. You can transfer your business-specific parameters to Vishnu using your own ParameterReaders, so that they are then treated like all other Vishnu parameters and, for example",
    "Liste der Seiten mit ausführlichen Informationen zu verschiedenen Vishnu Aspekten": "List of pages with detailed information on various aspects of Vishnu",
    "Dictionary von JobLists mit ihren Namen als Keys.": "Dictionary of JobLists with their names as keys.",
    "Cache zur Beschleunigung der Verarbeitung von TreeEvents bezogen auf Logger.": "Cache for accelerating the processing of TreeEvents related to loggers.",
    "Dictionary von LogicalNodes mit ihren Ids als Keys.": "Dictionary of LogicalNodes with their IDs as keys.",
    "Dictionary von LogicalNodes mit ihren Namen als Keys.": "Dictionary of LogicalNodes with their names as keys.",
    "Cache zur Beschleunigung der Verarbeitung von TreeEvents bezogen auf EventTrigger.": "Cache for accelerating the processing of TreeEvents in relation to EventTrigger.",
    "Liste von NodeConnectoren, die beim Parsen der Jobs noch nicht aufgelöst werden konnten.": "List of NodeConnectors that could not yet be resolved when parsing the jobs.",
    "Cache zur Beschleunigung der Verarbeitung von TreeEvents bezogen auf Worker.": "Cache for accelerating the processing of TreeEvents in relation to workers.",
    "JobPackages, die innerhalb des Jobs referenziert werden (inline oder extern).": "JobPackages that are referenced within the job (inline or external).",
    "Dictionary mit allen bisher geladenen JobPackages.": "Dictionary with all previously loaded JobPackages.",
    "Statische Instanz für einen undefinierten JobProvider.": "Static instance for an undefined JobProvider.",
    "Diverse Anwendungseinstellungen als Properties.": "Various application settings as properties.",
    "Statische Instanz für einen undefinierten Job.": "Static instance for an undefined job.",
    "Applikationseinstellungen.": "Application settings.",
    "Über die CancellationTokenSource kann dieses Token auf Abbruch gesetzt werden, was in diesem Knoten zum Aufruf der Routine cancelNotification führt.": "This token can be set to cancel via the CancellationTokenSource, which leads to the cancelNotification routine being called in this node.",
    "Dient zum kurzzeitigen Sperren bei Exceptions.": "Used to temporarily block exceptions.",
    "True: der Knoten soll gestartet werden.": "True: the node should be started.",
    "Liefert true, wenn gerade keine Snapshots erlaubt sind.": "Returns true if no snapshots are currently permitted.",
    "True: der Knoten ist gerade aktiv oder durch einen Timer kontrolliert.": "True: the node is currently active or controlled by a timer.",
    "Liefert true, wenn die Verarbeitung im Tree gerade angehalten werden soll aber schon erzeugte logische Änderungen noch zuende verteilt werden.": "Returns true if processing in the tree is to be stopped but logical changes that have already been created are still being distributed.",
    "Liefert true, wenn die Verarbeitung im Tree gerade angehalten wurde.": "Returns true if processing in the tree has just been stopped.",
    "Beim letzten Lauf aufgetretene Exception oder null;": "Exception that occurred during the last run or null;",
    "Dient zum kurzzeitigen Sperren von LastLogical.": "Used to temporarily block LastLogical.",
    "Dient zum kurzzeitigen Sperren von LastLogicalState.": "Used to temporarily lock LastLogicalState.",
    "Dient zum kurzzeitigen Sperren von LastState.": "Used to temporarily block LastState.",
    "Dient zum kurzzeitigen Sperren von Result.": "Used to temporarily block results.",
    "Nächsthöhere JobList für diesen Knoten oder der Knoten selbst, wenn er eine JobList ist.": "Next higher JobList for this node or the node itself if it is a JobList.",
    "Oberste JobList.": "Top JobList.",
    "Zeitpunkt des letzten Starts des Knoten (internes Feld).": "Time of the last start of the node (internal field).",
    "Info-Text über den nächsten Start des Knotens (wenn bekannt) oder null (internes Feld).": "Info text about the next start of the node (if known) or null (internal field).",
    "Dient zur Sperrung für Thread-safen Zugriff auf ParentView.": "Used to block thread-safe access to ParentView.",
    "Pro Tree eindeutiger ID-Zusatz.": "Unique ID addition per tree.",
    "Das letzte Verarbeitungsergebnis für diesen Knoten (internes Feld).": "The last processing result for this node (internal field).",
    "Der Knoten, auf den dieser NodeConnector verweist.": "The node to which this NodeConnector refers.",
    "Der Pfad zum aktuell dynamisch zu ladenden UserControl (internes Feld).": "The path to the UserControl currently to be loaded dynamically (internal field).",
    "Dient zum kurzzeitigen Sperren von LastCountResults.": "Used to temporarily block LastCountResults.",
    "Vergleichswert für die Erkennung von Veränderungen des Logical-Wertes unabhängig von technisch bedingten Initialisierungen (vor allem für Logging, LastLogical würde technisch bedingt zu oft auslösen).": "Comparison value for the detection of changes in the logical value independent of technically induced initializations (especially for logging, LastLogical would trigger too often for technical reasons).",
    "Dient zum kurzzeitigen Sperren von LastReturnedLogical.": "Used to temporarily block LastReturnedLogical.",
    "Dient zum kurzzeitigen Sperren von LastSingleNodes.": "Used to temporarily block LastSingleNodes.",
    "Zusätzlicher NodeLogicalState für NodeLists. Wird gesetzt, wenn sich für die Liste selbst ein veränderter Zustand ergibt. Dies passiert, wenn eine wartende Sub-JobList abgebrochen wird.": "Additional NodeLogicalState for NodeLists. Is set if there is a changed state for the list itself. This happens when a waiting Sub-JobList is canceled.",
    "Dient zum kurzzeitigen Sperren von ListLogicalState.": "Used to temporarily lock ListLogicalState.",
    "Zusätzlicher NodeState für NodeLists. Wird gesetzt, wenn sich für die Liste selbst ein veränderter Zustand ergibt. Dies passiert, wenn eine Sub-JobList auf Freigabe durch die für sie zuständige JobList wartet.": "Additional NodeState for NodeLists. Is set if there is a changed state for the list itself. This happens when a sub-JobList is waiting to be released by the JobList responsible for it.",
    "Dient zum kurzzeitigen Sperren von LastSingleNodesFinished.": "Used to temporarily block LastSingleNodesFinished.",
    "Dient zum kurzzeitigen Sperren für das Zurücksetzen (Invalidieren) verschiedener für die Ermittlung des aktuellen Zustands der ParentNode wichtiger Counter.": "Used to temporarily disable the resetting (invalidation) of various counters that are important for determining the current status of the parent node.",
    "Rückgabe-Objekt des letzten Checker-Durchlaufs, nicht öffentliche, interne Representation.": "Return object of the last checker run, non-public, internal representation.",
    "Statische Instanz für eine undefinierte JobList.": "Static instance for an undefined JobList.",
    "Statische Instanz für eine undefinierte LogicalNode.": "Static instance for an undefined LogicalNode.",
    "{ InfoType.Debug, InfoType.Info, InfoType.Warn, InfoType.Milestone, InfoType.Error, InfoType.Exception }.": "{InfoType.Debug, InfoType.Info, InfoType.Warn, InfoType.Milestone, InfoType.Error, InfoType.Exception }.",
    "{ InfoType.Info, InfoType.Warn, InfoType.Milestone, InfoType.Error, InfoType.Exception }.": "{InfoType.Info, InfoType.Warn, InfoType.Milestone, InfoType.Error, InfoType.Exception }.",
    "{ InfoType.Info, InfoType.Milestone }.": "{ InfoType.Info, InfoType.Milestone }.",
    "{ }": "{ }",
    "{ InfoType.Milestone, InfoType.Error, InfoType.Exception }.": "{ InfoType.Milestone, InfoType.Error, InfoType.Exception }.",
    "{ InfoType.Warn, InfoType.Error, InfoType.Exception }.": "{ InfoType.Warn, InfoType.Error, InfoType.Exception }.",
    "Broadcast message flag.": "Broadcast message flag.",
    "Registered message type for a Window activation request.": "Registered message type for a Window activation request.",
    "Schaltet den Glow-Effekt der ProgressBar an oder aus.": "Switches the glow effect of the ProgressBar on or off.",
    "Schaltet zwischen von links nach rechts laufender und ewig hin und her laufender ProgressBar um.": "Switches between the ProgressBar running from left to right and the ProgressBar running back and forth forever.",
    "Setzt oder liest einen auf der ProgressBar zentrierten Zusatztext.": "Sets or reads an additional text centered on the ProgressBar.",
    "Prozentwert der ProgressBar - kann von außen gelesen und gesetzt werden.": "Percentage value of the ProgressBar - can be read and set externally.",
    "Holt oder setzt die Sichtbarkeit eines optionalen horizontalen Scrollbalkens.": "Gets or sets the visibility of an optional horizontal scrollbar.",
    "Holt oder setzt die Sichtbarkeit eines optionalen vertikalen Scrollbalkens.": "Gets or sets the visibility of an optional vertical scrollbar.",
    "Der Besitzer des Knoten.": "The owner of the node.",
    "Trenner für String-Inhalte, welcher einerseits selbst nicht in Strings vorkommt und andererseits wie ein Leerzeichen dargestellt wird. Delimiter for string-contents. This delimiter doesn`t appear in strings but behaves like a space.": "Delimiter for string-contents, which on the one hand does not occur in strings and on the other hand is displayed like a space. Delimiter for string-contents. This delimiter doesn`t appear in strings but behaves like a space.",
    "Der Standard-Spaltentrenner in CSV-Dateien Standard-column-delimiter in CSV-files": "The standard column separator in CSV files Standard column delimiter in CSV files",
    "Der Dispatcher der UI.": "The dispatcher of the UI.",
    "Statische Instanz für ein undefiniertes TreeEvent.": "Static instance for an undefined TreeEvent.",
    "Interne Repräsentation der Property &quot;Info&quot;.": "Internal representation of the property &quot;Info&quot;.",
    "Wird automatisch auf true gesetzt, wenn der besitzende Knoten im Vishnu-Tree vom Benutzer manuell gestartet wurde. Kann für die Steuerung spezifischen Trigger-Verhaltens genutzt werden.": "Is automatically set to true if the owning node in the Vishnu tree was started manually by the user. Can be used to control specific trigger behavior.",
    "Enthält den Zeitpunkt des letzten Trigger-Starts oder DateTime.MinValue.": "Contains the time of the last trigger start or DateTime.MinValue.",
    "Enthält den Zeitpunkt des nächsten Trigger-Starts, wenn dieser überhaupt vorhersehbar ist, ansonsten DateTime.MinValue.": "Contains the time of the next trigger start, if this can be predicted at all, otherwise DateTime.MinValue.",
    "Kann mit Trigger-spezifischen Syntax-Informationen ausgestattet werden, wird dann im Fehlerfall im Zuge einer Exception ausgegeben, Default: null.": "Can be equipped with trigger-specific syntax information, is then output in the event of an error as part of an exception, default: null.",
    "Zusätzlicher Name, über den das Control im VisualTree gesucht werden kann (wichtig bei UserControls).": "Additional name that can be used to search for the control in the VisualTree (important for UserControls).",
    "Wird ausgelöst, wenn das dynamisch geladene Control vollständig gezeichnet wurde. Hier wird das User-Event deklariert und registriert.": "Is triggered when the dynamically loaded control has been completely drawn. The user event is declared and registered here.",
    "Das ViewModel des besitzenden Vishnu-Knoten.": "The ViewModel of the owning Vishnu node.",
    "Liefert oder setzt die Spaltenanzahl einer quadratischen Matrix. Dieser Wert wird zu einem geeigneten Zeitpunkt in die Property GridColumnCount geschoben, um die WPF-GUI zu informieren.": "Returns or sets the number of columns in a square matrix. This value is pushed into the GridColumnCount property at a suitable time in order to inform the WPF GUI.",
    "Liefert oder setzt die Zeilenanzahl einer quadratischen Matrix. Dieser Wert wird zu einem geeigneten Zeitpunkt in die Property GridRowCount geschoben, um die WPF-GUI zu informieren.": "Returns or sets the number of rows in a square matrix. This value is pushed into the GridRowCount property at a suitable time in order to inform the WPF GUI.",
    "Der zugeordnete Knoten aus dem LogicalTaskTree.": "The assigned node from the LogicalTaskTree.",
    "Liefert oder setzt die Spaltennummer des zugehörigen Controls in einer quadratischen Matrix. Dieser Wert wird zu einem geeigneten Zeitpunkt in die Property GridColumn geschoben, um die WPF-GUI zu informieren.": "Returns or sets the column number of the associated control in a square matrix. This value is pushed into the GridColumn property at a suitable time in order to inform the WPF GUI.",
    "Liefert oder setzt die Zeilennummer des zugehörigen Controls in einer quadratischen Matrix. Dieser Wert wird zu einem geeigneten Zeitpunkt in die Property GridRow geschoben, um die WPF-GUI zu informieren.": "Returns or sets the row number of the associated control in a square matrix. This value is pushed into the GridRow property at a suitable time in order to inform the WPF GUI.",
    "Attached Property für das SizeChanged-Event eines Controls.": "Attached property for the SizeChanged event of a control.",
    "Attached Property für das Collapsed-Event eines Expanders.": "Attached property for the collapsed event of an expander.",
    "Attached Property (ICommand) für das Expanded-Event eines Expanders.": "Attached property (ICommand) for the expanded event of an expander.",
    "Attached Property für das SizeChanged-Event eines Expanders.": "Attached property for the SizeChanged event of an expander.",
    "Bei True hat der Knoten einen Eltern-Knoten, bei False ist er die Root.": "If True, the node has a parent node; if False, it is the root.",
    "Attached Property für einen nullable Boolean zur Weitergabe des logischen Zustands des dem Control zugeordneten Checkers (wird z.B.": "Attached property for a nullable Boolean for passing on the logical state of the checker assigned to the control (is used, for example",
    "Ausrichtung der Kind-Knoten, horizontal oder vertikal.": "Alignment of the child nodes, horizontal or vertical.",
    "HilfsProperty für die Parametrisierung des ValueConverters 'OrientationModifier': Unchanged=unverändert, Switched=umgedreht (Horizontal in =&gt; Vertical out und umgekehrt), Horizontal=immer horizontal, Vertical=immer vertikal.": "AuxiliaryProperty for the parameterization of the ValueConverter 'OrientationModifier': Unchanged=unchanged, Switched=reversed (Horizontal in =&gt; Vertical out and vice versa), Horizontal=always horizontal, Vertical=always vertical.",
    "Adds the specified number of Columns to ColumnDefinitions. Default Width is Auto.": "Adds the specified number of Columns to ColumnDefinitions. Default Width is Auto.",
    "Makes the specified Column's Width equal to Auto or Star depending on GridHelpers._gridColumnUnitType. Can set on multiple Columns.": "Makes the specified Column's Width equal to Auto or Star depending on GridHelpers._gridColumnUnitType. Can set on multiple Columns.",
    "Adds the specified number of Rows to RowDefinitions. Default Height is Auto.": "Adds the specified number of Rows to RowDefinitions. Default Height is Auto.",
    "Makes the specified Row's Height equal to Auto or Star depending on GridHelpers._gridRowUnitType. Can set on multiple Rows.": "Makes the specified Row's Height equal to Auto or Star depending on GridHelpers._gridRowUnitType. Can set on multiple Rows.",
    "Zeigt an, dass das Hauptfenster gerade seinen Standort wechselt und somit noch nicht die korrekte Endposition an Checker und Worker melden kann. Wird in App.": "Indicates that the main window is currently changing its location and therefore cannot yet report the correct end position to the checker and worker. Is used in App.",
    "Ruft die lokale Routine &quot;SaveWindowAspectsAndCallViewModelLogic&quot; auf.": "Calls the local routine &quot;SaveWindowAspectsAndCallViewModelLogic&quot;.",
    "A general error has occurred": "A general error has occurred",
    "Öffentliche Methode zum Aufräumen.": "Public method for cleaning up.",
    "Hier wird aufgeräumt: ruft für alle User-Elemente, die Disposable sind, Dispose() auf.": "Clean up here: calls Dispose() for all user elements that are disposable.",
    "Finalizer: wird vom GarbageCollector aufgerufen.": "Finalizer: is called by the GarbageCollector.",
    "Konvertiert einen Wert in ein gegebenes Format. Muss überschrieben werden, deshalb hier ohne Funktion (spiegelt den Eingabewert zurück) implementiert.": "Converts a value into a given format. Must be overwritten, therefore implemented here without a function (reflects the input value back).",
    "Hier wird der (normalerweise externe) Arbeitsprozess ausgeführt (oder beobachtet).": "This is where the (usually external) work process is carried out (or observed).",
    "Konstruktor": "Constructor",
    "Konstruktor.": "Constructor.",
    "Liefert für einen Knoten (nodePath) die Information, ob er zusammengefaltet oder expandiert dargestellt werden soll. Liefert dann null zurück, wenn entweder der Knoten keine NodeList ist oder keine lokale Konfiguration geladen wurde.": "Returns the information for a node (nodePath) as to whether it should be displayed collapsed or expanded. Returns null if either the node is not a NodeList or no local configuration has been loaded.",
    "Lädt die aktuelle Konfiguration aus LocalConfigurationPath. Die aktuelle Konfiguration speichert für jedes LogicalNodeViewModel, ob sein Knoten in der Bildschirmdarstellung zusammengefaltet ist (collapsed) oder dessen Unterknoten sichtbar sind.": "Loads the current configuration from LocalConfigurationPath. The current configuration saves for each LogicalNodeViewModel whether its node is collapsed in the screen display or whether its sub-nodes are visible.",
    "Speichert die aktuelle Konfiguration im LocalConfigurationDirectory.": "Saves the current configuration in the LocalConfigurationDirectory.",
    "Liefert eine konkrete Job-Instanz für eine JobList in einem LogicalTaskTree.": "Returns a concrete job instance for a JobList in a LogicalTaskTree.",
    "Retourniert den logischen Namen des Jobs mit dem physischen Namen des JobPackages oder logischen Namen des Jobs.": "Returns the logical name of the job with the physical name of the JobPackage or logical name of the job.",
    "Retourniert den physischen Namen des JobPackages mit dem physischen Namen des JobPackages oder logischen Namen des Jobs.": "Returns the physical name of the JobPackage with the physical name of the JobPackage or logical name of the job.",
    "Konstruktor für ein Snapshot-Dummy-Element - übernimmt den Eltern-Knoten.": "Constructor for a snapshot dummy element - takes over the parent node.",
    "Wird aufgerufen, wenn der Teilbaum vom Anwender bewusst gestoppt wurde.": "Is called up when the subtree has been deliberately stopped by the user.",
    "Stoppt alle TreeExternals zu dieser JobList und aller Sub-JobLists.": "Stops all TreeExternals for this JobList and all sub-JobLists.",
    "Überschriebene RUN-Logik. Für JobList bedeutet das: Starten eventueller TreeExternals und Weitergabe des Aufrufs an NodeList (dort an die Kinder). Diese Routine wird asynchron ausgeführt.": "Overwritten RUN logic. For JobList this means: Starting any TreeExternals and passing the call on to NodeList (there to the children). This routine is executed asynchronously.",
    "Vergleicht den Inhalt dieser JobList nach logischen Gesichtspunkten mit dem Inhalt einer übergebenen JobList.": "Compares the content of this JobList with the content of a transferred JobList according to logical criteria.",
    "Sucht nach zuständigen Triggern für ein Event.": "Searches for relevant triggers for an event.",
    "Sucht in der aktuellen JobList und allen übergeodneten JobLists nach der Node mit der übergebenen 'nodeId'. Der erste Treffer gewinnt.": "Searches the current JobList and all parent JobLists for the node with the transferred 'nodeId'. The first hit wins.",
    "Liefert eine Zusammenfassung des aktuellen Trees mit den aktuellen Zuständen seiner Knoten als String-List. Kann für Debug-Zwecke genutzt werden.": "Provides a summary of the current tree with the current states of its nodes as a string list. Can be used for debugging purposes.",
    "Erzeugt einen Hashcode für diese JobList.": "Generates a hash code for this JobList.",
    "Liefert die für den Knoten gültige, oberste Root-JobList.": "Returns the topmost Root-JobList valid for the node.",
    "Gibt über InfoController den aktuellen Tree mit den aktuellen Zuständen seiner Knoten aus. Kann für Debug-Zwecke genutzt werden.": "Outputs the current tree with the current states of its nodes via InfoController. Can be used for debugging purposes.",
    "Registriert alle getriggerten Knoten eines Teilbaums bei ihren Triggern.": "Registers all triggered nodes of a subtree with their triggers.",
    "Setzt alle Knoten im Teilbaum zurück. Setzt auch alle TreeExternals zurück.": "Resets all nodes in the subtree. Also resets all TreeExternals.",
    "Überschreibt die Run-Logik aus LogicalNode um ggf. noch einen vorhandenen SnapshotTrigger und ggf. TreeExternals zu starten.": "Overwrites the run logic from LogicalNode to start an existing SnapshotTrigger and TreeExternals if necessary.",
    "Startet alle TreeExternals zu dieser JobList und aller Sub-JobLists.": "Starts all TreeExternals for this JobList and all sub-JobLists.",
    "Gibt den (Teil-)Baum in eine StringList aus.": "Outputs the (sub)tree to a StringList.",
    "Gibt den verarbeiteten booleschen Ausdruck auf Basis des boolean-Trees wiederum einzeilig als logischen Ausdruck aus.": "Outputs the processed Boolean expression based on the Boolean tree again as a single-line logical expression.",
    "Gibt den zugehörigen Boolean-Tree in eine StringList aus.": "Outputs the associated Boolean tree in a StringList.",
    "Überschriebene ToString()-Methode.": "Overridden ToString() method.",
    "Konstruktor - initialisiert einen leeren Job.": "Constructor - initializes an empty job.",
    "Fügt dem Dictionary LoadedJobPackages das JobPackage zu dem logischen Job-Namen logicalJobName hinzu. Im Fehlerfall wird einfach nichts hinzugefügt. Muss überschrieben werden.": "Adds the JobPackage to the logical job name logicalJobName to the dictionary LoadedJobPackages. In the event of an error, nothing is added. Must be overwritten.",
    "Fügt dem Dictionary LoadedJobPackages das JobPackage mit dem logischen Pfad logicalJobName hinzu. Im Fehlerfall wird einfach nichts hinzugefügt.": "Adds the JobPackage with the logical path logicalJobName to the dictionary LoadedJobPackages. In the event of an error, nothing is added.",
    "LogicalTaskTree.JobProviderBase.": "LogicalTaskTree.JobProviderBase.",
    "Standard Konstruktor.": "Standard constructor.",
    "Liefert einen String mit Pipe-separierten Log-Event-Namen. Delegiert ggf. an die SlaveLoggerShell.": "Returns a string with pipe-separated log event names. Delegates to the SlaveLoggerShell if necessary.",
    "Liefert den Namen des Loggers, der einem Knoten zugeordnet werden soll.": "Returns the name of the logger that is to be assigned to a node.",
    "Übergibt LogInfos an den externen Logger.": "Transfers log information to the external logger.",
    "Bei LoggerShells, die bei der Instanziierung nur eine Namensreferenz mitbekommen haben, wird hier nachträglich der Logger übergeben.": "For LoggerShells that were only given a name reference during instantiation, the logger is subsequently transferred here.",
    "Erlaubt Snapshots.": "Allows snapshots.",
    "Wenn erforderlich, beim Trigger abmelden, Abbrechen der Task über CancellationToken, Status setzen.": "If necessary, log off at the trigger, cancel the task via CancellationToken, set status.",
    "Gibt an, ob ein (Teil-)Baum in einem JobController gestartet werden kann, d.h. dass der Knoten und alle seine Eltern (rekursiv) gestartet werden können.": "Specifies whether a (sub)tree can be started in a JobController, i.e. that the node and all its parents can be started (recursively).",
    "Die eigentliche, Knotentyp-spezifische Verarbeitung; muss überschrieben werden.": "The actual, node type-specific processing; must be overwritten.",
    "Vergleicht den Inhalt dieser LogicalNode nach logischen Gesichtspunkten mit dem Inhalt einer übergebenen LogicalNode.": "Compares the content of this LogicalNode according to logical aspects with the content of a transferred LogicalNode.",
    "Hierüber kann eine Ableitung von LogicalNode ihren eigenen Thread zum Abbruch veranlassen.": "A LogicalNode derivation can use this to cause its own thread to terminate.",
    "Returniert das ConcurrentDictionary Environment als einfaches Dictionary Results. Benutzt dazu die interne Routine GetResultsFromResultList().": "Returns the ConcurrentDictionary Environment as a simple dictionary Results. To do this, use the internal routine GetResultsFromResultList().",
    "Erzeugt einen Hashcode für diese LogicalNode.": "Generates a hash code for this LogicalNode.",
    "Aktualisiert bei TreeEvent-getriggerten Knoten die Werte des Knotens, bevor mit ihnen weitergearbeitet wird.": "For TreeEvent-triggered nodes, updates the values of the node before continuing to work with them.",
    "Returniert das ConcurrentDictionary ResultList als einfaches Dictionary Results. Benutzt dazu die interne Routine GetResultsFromResultList().": "Returns the ConcurrentDictionary ResultList as a simple dictionary Results. To do this, use the internal routine GetResultsFromResultList().",
    "Setzt bestimmte Eigenschaften auf die Werte der übergebenen LogicalNode &quot;source&quot;.": "Sets certain properties to the values of the transferred LogicalNode &quot;source&quot;.",
    "Setzt den Knoten auf die Starteinstellungen zurück.": "Resets the node to the start settings.",
    "Löscht interne Caches, so dass alles neu ausgewertet wird.": "Deletes internal caches so that everything is re-evaluated.",
    "Prüft, ob ein Thread gültig (nicht als ungültig markiert) ist.": "Checks whether a thread is valid (not marked as invalid).",
    "Schreibt eine Nachricht mit kurzer Sleeptime vorher und nacher, um zeitnahe Vorgänge später im Log in zeitlicher Folge sichtbar zu machen.": "Writes a message with a short sleeptime before and after in order to make timely processes visible later in the log in chronological order.",
    "Trägt thread in die Liste ungültiger Threads ein, falls der Thread noch aktiv ist.": "Adds thread to the list of invalid threads if the thread is still active.",
    "Löst das NodeLastNotNullLogicalChanged-Ereignis aus.": "Triggers the NodeLastNotNullLogicalChanged event.",
    "Löst das NodeBreaked-Ereignis aus.": "Triggers the NodeBreaked event.",
    "Löst das NodeProgressChanged-Ereignis aus.": "Triggers the NodeProgressChanged event.",
    "Löst das NodeProgressFinished-Ereignis aus.": "Triggers the NodeProgressFinished event.",
    "Löst das NodeStarted-Ereignis aus.": "Triggers the NodeStarted event.",
    "Löst das NodeWorkersStateChanged-Ereignis aus.": "Triggers the NodeWorkersStateChanged event.",
    "Hält die Verarbeitung im Tree an.": "Stops processing in the tree.",
    "Stößt weitere Verarbeitungen für das aktuelle TreeEvent an (Trigger, Logger).": "Triggers further processing for the current TreeEvent (trigger, logger).",
    "Verhindert Snapshots.": "Prevents snapshots.",
    "Triggert das TreeEvent &quot;AnyLastNotNullLogicalHasChanged&quot; und ruft &quot;OnNodeLastNotNullLogicalChanged&quot;.": "Triggers the TreeEvent &quot;AnyLastNotNullLogicalHasChanged&quot; and calls &quot;OnNodeLastNotNullLogicalChanged&quot;.",
    "Kapselt den Aufruf des nicht vererbbaren Events NodeLogicalChanged für für die abgeleiteten Klassen NodeList und JobList. Diese Routine gibt das Event über NodeLogicalChanged letzten Endes an die UI weiter.": "Encapsulates the call of the non-inheritable event NodeLogicalChanged for the derived classes NodeList and JobList. This routine ultimately forwards the event to the UI via NodeLogicalChanged.",
    "Sorgt für eine sofortige Neu-Auswertung aller gecashten Zustände.": "Ensures an immediate re-evaluation of all cashed states.",
    "Wird aufgerufen, wenn der Teilbaum neu geladen werden soll.": "Is called up when the subtree is to be reloaded.",
    "Setzt alle Knoten im Teilbaum zurück, von denen andere per TreeEvent abhängen.": "Resets all nodes in the subtree on which others depend via TreeEvent.",
    "Setzt alle Knoten im gesamten Tree zurück.": "Resets all nodes in the entire tree.",
    "Setzt alle Knoten im Teilbaum ab branch zurück.": "Resets all nodes in the subtree from branch.",
    "Lässt einen angehaltenen Tree weiterlaufen.": "Allows a paused tree to continue running.",
    "Prüft, ob ein Knoten gestartet werden kann und startet dann den Knoten, seinen Trigger, oder beide (über StartNodeOrTrigger).": "Checks whether a node can be started and then starts the node, its trigger, or both (via StartNodeOrTrigger).",
    "Setzt die Property StartCollapsed für einen ganzen (Teil-)Baum.": "Sets the StartCollapsed property for an entire (partial) tree.",
    "Setzt einen gemeinsamen (kombinierten) NodeWorkerState 'WorkersState' für alle NodeWorker. Retourniert NodeWorkersState.": "Sets a common (combined) NodeWorkerState 'WorkersState' for all NodeWorkers. Returns NodeWorkersState.",
    "Streut System.Sleeps zur Systementlastung ein. Ist feiner regulierbar, als fixe Sleeps in geschachtelten Inner-Loops.": "Intersperses System.Sleeps for system relief. Is more finely adjustable than fixed sleeps in nested inner loops.",
    "Setzt threadsafe LastLogical.": "Sets threadsafe LastLogical.",
    "Setzt threadsafe LastLogicalState.": "Sets threadsafe LastLogicalState.",
    "Setzt threadsafe LastState.": "Sets threadsafe LastState.",
    "Entfernt thread aus der Liste ungültiger Threads.": "Removes thread from the list of invalid threads.",
    "Setzt den Teilbaum auf nicht startbar.": "Sets the subtree to non-startable.",
    "Startet die Verarbeitung dieses Knotens nach einem Start durch den Anwender. Gibt die Information, dass der Start durch den Anwender erfolgte, im TreeEvent an Run weiter.": "Starts the processing of this node after a start by the user. Passes the information that the start was performed by the user to Run in the TreeEvent.",
    "Konstruktor für ein Snapshot-Dummy-Element.": "Constructor for a snapshot dummy element.",
    "Liefert die oberste JobList des Trees als IVishnuNode.": "Returns the topmost JobList of the tree as IVishnuNode.",
    "Setzt die oberste JobList des Trees. Returnt die bisher oberste JobList.": "Sets the topmost JobList of the tree. Returns the previously topmost JobList.",
    "Konstruktor - übernimmt die globalen Tree-Parameter und die Datenquelle für den Job.": "Constructor - takes over the global tree parameters and the data source for the job.",
    "Liefert den Namen des Checkers, der einem ValueConverter zugeordnet werden soll.": "Returns the name of the checker that is to be assigned to a ValueConverter.",
    "Konvertiert einen Wert in ein gegebenes Format. Muss überschrieben werden.": "Converts a value into a given format. Must be overwritten.",
    "Übernimmt den Checker bei ValueConvertern.": "Takes over the checker for ValueConverters.",
    "Wird angesprungen, wenn sich der Verarbeitungsfortschritt des Checkers geändert hat.": "Is activated if the processing progress of the checker has changed.",
    "Überschrieben, um das Abbrechen von ValueModifiern zu unterbinden. Stattdessen wird zum Originalknoten weitergeleitet.": "Overwritten to prevent ValueModifiers from being canceled. Instead, the original node is forwarded.",
    "Hier wird der Checker-Thread gestartet. Diese Routine läuft asynchron.": "The checker thread is started here. This routine runs asynchronously.",
    "Vergleicht den Inhalt dieses NodeConnectors nach logischen Gesichtspunkten mit dem Inhalt eines übergebenen NodeConnectors.": "Compares the content of this NodeConnector with the content of a transferred NodeConnector according to logical criteria.",
    "Erzeugt einen Hashcode für diesen NodeConnector.": "Generates a hash code for this NodeConnector.",
    "Merkt sich den zu referenzierenden Knoten und hängt sich in dessen Events.": "Remembers the node to be referenced and attaches itself to its events.",
    "Lädt den Zweig oder Knoten neu.": "Reloads the branch or node.",
    "Überschrieben, um das Starten von ValueModifiern zu unterbinden. Stattdessen wird über UserRun zum Originalknoten weitergeleitet.": "Overwritten to prevent ValueModifiers from being started. Instead, the original node is forwarded via UserRun.",
    "Wird angesprungen, wenn die Verarbeitung des Kind-Knotens beendet ist. Kaskadiert u.U. im Tree bis zum Root-Knoten.": "Is started when processing of the child node is complete. May cascade in the tree up to the root node.",
    "Wird angesprungen, wenn sich das Result eines Kind-Knotens geändert hat. Kaskadiert im Tree bis zum Root-Knoten nach oben.": "Is triggered when the result of a child node has changed. Cascades upwards in the tree to the root node.",
    "Stoppt den Originalknoten.": "Stops the original node.",
    "Startet den Originalknoten.": "Starts the original node.",
    "Konstruktor für ein Snapshot-Dummy-Element. Dieser Konstruktor leitet für den Konstruktor von NodeConnector direkt an LogicalNode weiter.": "Constructor for a snapshot dummy element. This constructor forwards directly to LogicalNode for the constructor of NodeConnector.",
    "Abbrechen der Task. Wenn der Knoten selber beschäftigt ist, dann diesen zum Abbruch veranlassen, ansonsten die Abbruch-Anforderung an alle Kinder weitergeben.": "Cancel the task. If the node itself is busy, cause it to abort, otherwise pass the abort request on to all children.",
    "Überschriebene RUN-Logik. Für NodeList bedeutet das: Einhängen in die Events und Weitergabe des Aufrufs an die Kinder. Diese Routine wird asynchron ausgeführt.": "Overwritten RUN logic. For NodeList, this means: Attaching to the events and forwarding the call to the children. This routine is executed asynchronously.",
    "Wird angesprungen, wenn sich der logische Zustand &quot;LastNotNullLogical&quot; eines Kindes geändert hat. Dieses Event ist entscheidend für eine mögliche Änderung des logischen Zustandes des Parent-Knoten.": "Is triggered when the logical state &quot;LastNotNullLogical&quot; of a child has changed. This event is decisive for a possible change in the logical state of the parent node.",
    "Wird aufgerufen, wenn sich das Result eines Knotens geändert hat. Dient dazu, die Berechnung des logischen Zustands dieser NodeList neu zu starten; bei &lt;=&gt; Vergleichen wichtig.": "Is called when the result of a node has changed. Used to restart the calculation of the logical state of this NodeList; important for &lt;=&gt; comparisons.",
    "Setzt threadsafe LastCountPositiveResults.": "Sets threadsafe LastCountPositiveResults.",
    "Setzt threadsafe LastCountResults.": "Sets threadsafe LastCountResults.",
    "Setzt threadsafe LastCountTerminatedElements.": "Sets threadsafe LastCountTerminatedElements.",
    "Setzt threadsafe LastReturnedLogical.": "Sets threadsafe LastReturnedLogical.",
    "Setzt threadsafe LastSingleNodes.": "Sets threadsafe LastSingleNodes.",
    "Setzt threadsafe ListLogicalState.": "Sets threadsafe ListLogicalState.",
    "Konstuktor": "Conductor",
    "Löst die Event-Verknüpfungen mit dem Child-Knoten am Index index und ruft danach ggf. Dispose für den Child-Knoten auf.": "Releases the event links with the child node at the index index and then calls Dispose for the child node if necessary.",
    "Löst die Event-Verknüpfungen mit dem Child-Knoten am Index index.": "Releases the event links with the child node at the index index.",
    "Speichert den Kindknoten am übergebenen Index und hängt sich in die Events des Kindknoten ein.": "Saves the child node at the transferred index and attaches itself to the events of the child node.",
    "Wird angesprungen, wenn in einem Kind eine Exception gelöscht wurde. Kaskadiert die Auflösung einer vormaligen Exception u.U. bis zum Root-Knoten nach oben.": "Is started if an exception has been deleted in a child. Cascades the resolution of a previous exception up to the root node.",
    "Wird angesprungen, wenn in einem Kind eine Exception aufgetreten ist. Kaskadiert die Exception bis zum Root-Knoten nach oben, ohne die Verarbeitung abzubrechen.": "Is started if an exception has occurred in a child. Cascades the exception up to the root node without aborting processing.",
    "Wird angesprungen, wenn sich das aktuelle logische Ergebnis des Child-Knotens geändert hat. Wird von einer SingleNode ausgelöst. Setzt sich im Tree nur bis zum direkten Parent-Knoten fort.": "Is triggered if the current logical result of the child node has changed. Is triggered by a SingleNode. Only continues in the tree up to the direct parent node.",
    "Wird angesprungen, wenn sich der Verarbeitungsfortschritt des Referenzierten Originalknotens geändert hat. Setzt sich im Tree nur bis zum direkten Parent-Knoten fort.": "Is triggered if the processing progress of the referenced original node has changed. Only continues in the tree up to the direct parent node.",
    "Wird angesprungen, wenn die Verarbeitung des Kind-Knotens gestarted wurde. Kaskadiert u.U. im Tree bis zum Root-Knoten nach oben.": "Is started when the processing of the child node has been started. May cascade upwards in the tree to the root node.",
    "Wird angesprungen, wenn sich der Verarbeitungszustand eines Kindes geändert hat. Wird von einer SingleNode ausgelöst. Setzt sich im Tree nur bis zum direkten Parent-Knoten fort.": "Is triggered when the processing status of a child has changed. Is triggered by a SingleNode. Only continues in the tree up to the direct parent node.",
    "Setzt threadsafe LastSingleNodesFinished.": "Sets threadsafe LastSingleNodesFinished.",
    "Konstruktor für ein Snapshot-Dummy-Element - gibt die Verarbeitung an die Basisklasse &quot;LogicalNode&quot; weiter.": "Constructor for a snapshot dummy element - passes the processing to the base class &quot;LogicalNode&quot;.",
    "Konstruktor - gibt die Verarbeitung an die Basisklasse &quot;LogicalNode&quot; weiter.": "Constructor - passes the processing to the base class &quot;LogicalNode&quot;.",
    "Vergleicht mehrere Results über einen übergebenen Vergleichsoperator. Gibt null zurück wenn eins der beteiligten Results = null ist.": "Compares several results via a transferred comparison operator. Returns null if one of the results involved is null.",
    "LogicalTaskTree.": "LogicalTaskTree.",
    "Wird von Vishnu vor jedem Run eines Checkers, Workers oder vor Start eines Triggers aufgerufen. Returnt true, wenn der Run/Start ausgewführt werden kann.": "Is called by Vishnu before each run of a checker, worker or before the start of a trigger. Returns true if the run/start can be executed.",
    "Standard-Konstruktor: prüft, ob ICanRun-dll und/oder IParameterReader-dll im aktuellen- oder UserAssemblies-Verzeichnis existieren und lädt diese.": "Standard constructor: checks whether ICanRun-dll and/or IParameterReader-dll exist in the current or UserAssemblies directory and loads them.",
    "LogicalTaskTree.Provider.": "LogicalTaskTree.Provider.",
    "Vergleicht den Inhalt dieser SingleNode nach logischen Gesichtspunkten mit dem Inhalt einer übergebenen SingleNode.": "Compares the content of this SingleNode with the content of a transferred SingleNode according to logical criteria.",
    "Erzeugt einen Hashcode für diese SingleNode.": "Generates a hash code for this SingleNode.",
    "Triggert das TreeEvent &quot;AnyResultHasChanged&quot; und ruft &quot;OnNodeResultChanged&quot;.": "Triggers the TreeEvent &quot;AnyResultHasChanged&quot; and calls &quot;OnNodeResultChanged&quot;.",
    "Setzt das ReturnObject auf ein Object (für Snapshots).": "Sets the ReturnObject to an object (for snapshots).",
    "Überschriebene RUN-Logik. Diese Routine wird asynchron ausgeführt.": "Overwritten RUN logic. This routine is executed asynchronously.",
    "Löst das SnapshotRefreshed-Ereignis aus.": "Triggers the SnapshotRefreshed event.",
    "Aktualisiert den Snapshot aus einer externen XML-Datei.": "Updates the snapshot from an external XML file.",
    "Konstruktor - übernimmt den Eltern-Knoten.": "Constructor - takes over the parent node.",
    "Sperrt ein dem übergebenen Namen intern zugeordnetes Objekt. Der Eintrag mit Namen und Objekt wird ggf. vorher neu erzeugt.": "Locks an object internally assigned to the transferred name. The entry with the name and object is recreated beforehand if necessary.",
    "Entsperrt ein dem übergebenen Namen intern zugeordnetes Objekt.": "Unlocks an object internally assigned to the transferred name.",
    "Setzt den internen Trigger auf aktiv.": "Sets the internal trigger to active.",
    "Setzt den internen Trigger auf deaktiv.": "Sets the internal trigger to deactivated.",
    "Konstruktor - übernimmt und erzeugt diverse Informationen für den TreeEventTrigger.": "constructor - takes over and generates various information for the TreeEventTrigger.",
    "Liefert den Trigger, wenn die TriggerShell einen TreeEventTrigger kapselt oder null.": "Returns the trigger if the TriggerShell encapsulates a TreeEventTrigger or null.",
    "Liefert die zuletzt übergebenen Parameter dieses Triggers.": "Returns the last transferred parameters of this trigger.",
    "Liefert den Namen des Triggers, der einem Checker zugeordnet werden soll.": "Returns the name of the trigger that is to be assigned to a checker.",
    "Bei TriggerShells, die bei der Instanziierung nur eine Namensreferenz mitbekommen haben, wird hier nachträglich der Trigger übergeben.": "For TriggerShells that were only given a name reference during instantiation, the trigger is subsequently transferred here.",
    "Startet den Trigger mit der aufzurufenden Callback-Routine als Parameter. Der Trigger wird nur dann tatsächlich neu gestartet, wenn alle vorher über RegisterTriggerIt angemeldeten Knoten auch Trigger.": "Starts the trigger with the callback routine to be called as a parameter. The trigger is only actually restarted if all nodes previously registered via RegisterTriggerIt are also Trigger.",
    "Stoppt den Trigger wenn alle zu triggernden Knoten Trigger.Stop aufgerufen haben.": "Stops the trigger when all nodes to be triggered have called Trigger.Stop.",
    "Standard-Konstruktor.": "Standard constructor.",
    "Die eigentliche, Knotentyp-spezifische Verarbeitung. Wirft hier eine NotImplementedException.": "The actual, node type-specific processing. Throws a NotImplementedException here.",
    "Liefert den Namen des Checkers, der diesem ValueConverter zugeordnet werden soll.": "Returns the name of the checker that is to be assigned to this ValueConverter.",
    "Konvertiert einen Wert in das für diesen ValueModifier gültige Format.": "Converts a value into the format valid for this ValueModifier.",
    "Konstruktor - übernimmt die zugeordnete NodeCheckerBase.": "Constructor - takes over the assigned NodeCheckerBase.",
    "Konstruktor - übernimmt den Namen einer bereits definierten NodeCheckerBase.": "Constructor - takes the name of an already defined NodeCheckerBase.",
    "Konstruktor - übernimmt einen Format-String oder den Pfad einer externen IValueModifier-Dll und die zugeordnete NodeCheckerBase.": "Constructor - accepts a format string or the path of an external IValueModifier dll and the assigned NodeCheckerBase.",
    "Konstruktor - übernimmt einen Format-String oder den Pfad einer externen IValueModifier-Dll und den Namen einer bereits definierten NodeCheckerBase.": "Constructor - takes a format string or the path of an external IValueModifier dll and the name of an already defined NodeCheckerBase.",
    "Abbrechen der Task. Worker Scheduler (nicht den Worker!) über CancellationToken abbrechen.": "Cancel the task. Cancel Worker Scheduler (not the worker!) via CancellationToken.",
    "Startet einen zuständigen Worker, nachdem sich ein definierter Zustand (TreEvent) im Tree geändert hat. Intern wird für jeden Exec eine eigene Task gestartet.": "Starts a responsible worker after a defined status (TreEvent) has changed in the tree. A separate task is started internally for each Exec.",
    "Returnt True, wenn der SlavePathName existiert und Zugriff möglich ist.": "Returns True if the SlavePathName exists and access is possible.",
    "Konstruktor - übernimmt den Pfad zur Worker-Exe, und einen Parameter-String, der beim Aufruf der Exe zusätzlich übergeben wird.": "Constructor - takes the path to the worker exe, and a parameter string that is also transferred when the exe is called.",
    "Konstruktor - übernimmt den Pfad zur Worker-Exe, und einen Parameter-String, der beim Aufruf der Exe zusätzlich übergeben wird. Optional kann zusätzlich ein Trigger übergeben werden, der einen einmal aktivierten Worker, wiederholt aufruft.": "Constructor - takes the path to the worker exe and a parameter string that is also transferred when the exe is called. Optionally, a trigger can also be passed that repeatedly calls a worker once it has been activated.",
    "Fügt ein WorkerShell-Array mit einem aus Knoten-Id + &quot;:&quot; + TreeEventsString gebildeten Key in Workers ein.": "Inserts a WorkerShell array with a key formed from node ID + &quot;:&quot; + TreeEventsString into Workers.",
    "Prüft, ob Workers zu einem aus durch &quot;:&quot; getrennten NodeId und TreeEvent zusammengesetzten Key ein WorkerShell-Array enthält.": "Checks whether Workers contains a WorkerShell array for a key composed of NodeId and TreeEvent separated by &quot;:&quot;.",
    "Throws a System.Threading.ThreadAbortException on the thread on which the call was done to start thread termination. By calling this method the thread is usually terminated. Exceptions: T:System.PlatformNotSupportedException: .": "Throws a System.Threading.ThreadAbortException on the thread on which the call was done to start thread termination. By calling this method the thread is usually terminated. Exceptions: T:System.PlatformNotSupportedException: .",
    "Is no longer supported. Throws a System.Threading.ThreadAbortException on the thread on which the call was done to start thread termination. By calling this method the thread is usually terminated. Exceptions: T:System.PlatformNotSupportedException: .": "Is no longer supported. Throws a System.Threading.ThreadAbortException on the thread on which the call was done to start thread termination. By calling this method the thread is usually terminated. Exceptions: T:System.PlatformNotSupportedException: .",
    "Leads to Thread.AllocateDataSlot().": "Leads to Thread.AllocateDataSlot().",
    "Leads to Thread.AllocateNamedDataSlot(...).": "Leads to Thread.AllocateNamedDataSlot(...).",
    "Leads to Thread.BeginCriticalRegion().": "Leads to Thread.BeginCriticalRegion().",
    "Leads to Thread.BeginThreadAffinity().": "Leads to Thread.BeginThreadAffinity().",
    "Leads to the extern void DisableComObjectEagerCleanup.": "Leads to the extern void DisableComObjectEagerCleanup.",
    "Leads to Thread.EndCriticalRegion().": "Leads to Thread.EndCriticalRegion().",
    "Leads to Thread.EndThreadAffinity().": "Leads to Thread.EndThreadAffinity().",
    "Leads to Thread.FreeNamedDataSlot(...).": "Leads to Thread.FreeNamedDataSlot(...).",
    "Leads to the internal Interop ApartmentState.": "Leads to the internal Interop ApartmentState.",
    "Is no longer supported.": "Is no longer supported.",
    "Returns the current processor-id.": "Returns the current processor-id.",
    "Leads to Thread.GetNamedDataSlot(...).": "Leads to Thread.GetNamedDataSlot(...).",
    "Leads to Thread.GetDomain().": "Leads to Thread.GetDomain().",
    "Leads to Thread.GetDomainID().": "Leads to Thread.GetDomainID().",
    "Leads to Thread.GetHashCode().": "Leads to Thread.GetHashCode().",
    "Returns the current helper-thread or null.": "Returns the current helper-thread or null.",
    "Interrupts a thread that is inside a Wait(), Sleep() or Join(). If that thread is not currently blocked in that manner, it will be interrupted when it next begins to block.": "Interrupts a thread that is inside a Wait(), Sleep() or Join(). If that thread is not currently blocked in that manner, it will be interrupted when it next begins to block.",
    "Leads to Thread.Join().": "Leads to Thread.Join().",
    "Waits for the thread to die or for timeout milliseconds to elapse.": "Waits for the thread to die or for timeout milliseconds to elapse.",
    "Leads to Thread.Join(...).": "Leads to Thread.Join(...).",
    "Leads to Thread.MemoryBarrier.": "Leads to Thread.MemoryBarrier.",
    "Leads to Thread.SetApartmentState(...).": "Leads to Thread.SetApartmentState(...).",
    "Leads to Thread.SetData(...).": "Leads to Thread.SetData(...).",
    "Suspends the current thread for timeout milliseconds. If timeout == 0, forces the thread to give up the remainder of its timeslice. If timeout == Timeout.Infinite, no timeout will occur.": "Suspends the current thread for timeout milliseconds. If timeout == 0, forces the thread to give up the remainder of its timeslice. If timeout == Timeout.Infinite, no timeout will occur.",
    "Leads to Thread.Sleep(...).": "Leads to Thread.Sleep(...).",
    "Wait for a length of time proportional to 'iterations'. Each iteration is should only take a few machine instructions. Calling this API is preferable to coding a explicit busy loop because the hardware can be informed that it is busy waiting.": "Wait for a length of time proportional to 'iterations'. Each iteration is should only take a few machine instructions. Calling this API is preferable to coding an explicit busy loop because the hardware can be informed that it is busy waiting.",
    "Causes the operating system to change the state of the current instance to .": "Causes the operating system to change the state of the current instance to .",
    "Causes the operating system to change the state of the current instance to , and optionally supplies an object containing data to be used by the method the thread executes.": "Causes the operating system to change the state of the current instance to , and optionally supplies an object containing data to be used by the method the thread executes.",
    "Leads to Thread.TrySetApartmentState(...).": "Leads to Thread.TrySetApartmentState(...).",
    "Leads to Thread.VolatileRead(...).": "Leads to Thread.VolatileRead(...).",
    "Leads to Thread.VolatileWrite(...).": "Leads to Thread.VolatileWrite(...).",
    "Leads to YieldInternal.": "Leads to YieldInternal.",
    "Creates a new Abortable-instance for a parameterized thread.": "Creates a new Abortable-instance for a parameterized thread.",
    "Creates a new Abortable-instance for a parameterized thread with a given maximum stacksize.": "Creates a new Abortable-instance for a parameterized thread with a given maximum stacksize.",
    "Creates a new Abortable-instance for a parameterless thread.": "Creates a new Abortable-instance for a parameterless thread.",
    "Creates a new Abortable-instance for a parameterless thread with a given maximum stacksize.": "Creates a new Abortable-instance for a parameterless thread with a given maximum stacksize.",
    "Sorgt dafür, dass alle anstehenden Aktionen ausgeführt werden, z.B. gefüllte Zwischentabellen (Buffer) abgearbeitet (ge-flusht) werden.": "Ensures that all pending actions are executed, e.g. filled intermediate tables (buffers) are processed (flushed).",
    "Hierüber wird eine neue Message des Typs InfoType.Info mit Absender null verbreitet.": "This is used to distribute a new message of type InfoType.Info with sender null.",
    "Hierüber wird eine neue Message des Typs InfoType.Info verbreitet.": "A new message of type InfoType.Info is distributed via this.",
    "Hierüber wird einen neue Message verbreitet.": "A new message is spread via this.",
    "Hierüber trägt sich ein interessierter Viewer in die Liste der zu informierenden Viewer ein.": "An interested viewer enters this in the list of viewers to be informed.",
    "Hierüber meldet sich ein eingetragener Viewer wieder ab.": "A registered viewer can use this to log out again.",
    "Hierüber verarbeitet der Viewer eine Information.": "The viewer processes information about this.",
    "Der parametrisierte Konstruktor, der Message-Text + Message-Typ + Timestamp in die Properties übernimmt.": "The parameterized constructor that transfers the message text + message type + timestamp to the properties.",
    "Der parametrisierte Konstruktor, der Message-Text + Message-Typ + Timestamp + ThreadInfos in die Properties übernimmt.": "The parameterized constructor that transfers the message text + message type + timestamp + thread info to the properties.",
    "Disposed alle Viewer.": "Disposed all viewers.",
    "Hier kann ggf. aufgeräumt werden.": "This can be tidied up if necessary.",
    "Flusht alle flushable Viewer/Logger.": "Flushes all flushable viewers/loggers.",
    "Hierüber werden alle InfoPublisher geflusht.": "All InfoPublishers are flushed via this.",
    "Returnt die statische Property der nestet Klasse NestedInstance (als IInfoController), welche ihrerseits den privaten Konstruktor aufruft, wenn noch keine Instanz existiert.": "Returns the static property of the nestet class NestedInstance (as IInfoController), which in turn calls the private constructor if no instance exists yet.",
    "Returnt die statische Property der nestet Klasse NestedInstance (als IInfoPublisher), welche ihrerseits den privaten Konstruktor aufruft, wenn noch keine Instanz existiert.": "Returns the static property of the nestet class NestedInstance (as IInfoPublisher), which in turn calls the private constructor if no instance exists yet.",
    "Returnt die statische Property der nestet Klasse NestedInstance (als IInfoSource), welche ihrerseits den privaten Konstruktor aufruft, wenn noch keine Instanz existiert.": "Returns the static property of the nestet class NestedInstance (as IInfoSource), which in turn calls the private constructor if no instance exists yet.",
    "Hierüber wird 'mal eben' einen Message verbreitet.": "A message is 'just' spread via this.",
    "Hierüber werden alle Logs ausgegeben.": "All logs are output here.",
    "Konvertiert eine InfoType-Collection in das entsprechende InfoType-Array.": "Converts an InfoType collection into the corresponding InfoType array.",
    "Konvertiert ein InfoType-Array, also z.B.: InfoType[] SERIOUS in einen entsprechenden String wie z.B.: &quot;MILESTONE|ERROR|EXCEPTION&quot;.": "Converts an InfoType array, e.g: InfoType[] SERIOUS into a corresponding string such as: &quot;MILESTONE|ERROR|EXCEPTION&quot;.",
    "Konvertiert einen String wie z.B.: &quot;DEBUG|INFO|WARN|MILESTONE|ERROR&quot; in die entsprechende InfoType-Collection.": "Converts a string such as: &quot;DEBUG|INFO|WARN|MILESTONE|ERROR&quot; into the corresponding InfoType collection.",
    "Konvertiert einen String wie z.B.: &quot;DEBUG|INFO|WARN|MILESTONE|ERROR&quot; in das entsprechende InfoType-Array.": "Converts a string such as: &quot;DEBUG|INFO|WARN|MILESTONE|ERROR&quot; into the corresponding InfoType array.",
    "Sorgt dafür, dass die implementierende Instanz ausgegeben/angezeigt wird.": "Ensures that the implementing instance is output/displayed.",
    "Kürzt das Log-File 'logPath' auf die letzten 'countItems' Einträge. Das ursprüngliche Log-File wird mit der Extension '.last' gesichert.": "Shortens the log file 'logPath' to the last 'countItems' entries. The original log file is saved with the extension '.last'.",
    "Sorgt dafür, dass alle anstehenden Aktionen ausgeführt werden, z.B. gefüllte Zwischentabellen (Buffer) abgearbeitet (geflusht) werden.": "Ensures that all pending actions are executed, e.g. filled intermediate tables (buffers) are processed (flushed).",
    "Callback zum Loggen der Message: wird vom zuständigen InfoController aufgerufen, eine entsprechende vorherige Registrierung vorausgesetzt.": "Callback for logging the message: is called by the responsible InfoController, assuming a corresponding prior registration.",
    "Übernimmt einen Eintrag für das Logging. Bietet Timer- oder Counter-gesteuertes Puffern von Messages. Loggt selbst nicht direkt, sondern ruft die hier abstract definierte Methode WriteLog auf, in der dann das physikalische Schreiben erfolgt.": "Takes over an entry for logging. Provides timer- or counter-controlled buffering of messages. Does not log directly itself, but calls the WriteLog method defined here abstract, in which the physical writing then takes place.",
    "Bietet die Möglichkeit, Loggings aufzuräumen. Macht selbst nichts, kann überschrieben werden.": "Offers the option of cleaning up loggings. Does nothing itself, can be overwritten.",
    "Kann überschrieben werden um das Log anzuzeigen; bei Textdateien z.B. über Ausgabe in den Standard-Editor.": "Can be overwritten to display the log; for text files e.g. via output in the standard editor.",
    "Muss am Schluss der Verarbeitung aufgerufen werden, um den Timer zu stoppen.": "Must be called at the end of processing to stop the timer.",
    "Schreibt einen Eintrag in's Logfile (oder irgendwo hin), wird aber von außen nicht direkt aufgerufen; vielmehr sollte man den Logger als Viewer beim InfoController eintragen.": "Writes an entry to the log file (or somewhere else), but is not called directly from outside; instead, you should enter the logger as a viewer in the InfoController.",
    "Konstruktor: setzt den Pfadnamen für das Logfile.": "Constructor: sets the path name for the log file.",
    "Benennt das Log (DebugFile) nach einer definierten Zeitspanne DebugFileArchivingInterval um und löscht Logs (DebugFiles), die älter als DebugFileArchiveLifetime sind. Um eventuelles Sperren des DebugFiles muss sich der aufrufende Prozess kümmern.": "Renames the log (DebugFile) after a defined period of time DebugFileArchivingInterval and deletes logs (DebugFiles) that are older than DebugFileArchiveLifetime. The calling process must take care of any locking of the DebugFile.",
    "Schreibt einen Eintrag in's Logfile, wird aber von außen nicht direkt aufgerufen; vielmehr muss man den Logger als Viewer über seine Methode HandleInfoForLog beim InfoController eintragen.": "Writes an entry in the log file, but is not called directly from outside; instead, the logger must be entered as a viewer via its HandleInfoForLog method in the InfoController.",
    "Parameterloser Konstruktor: setzt das Logfile auf GetEnvironmentVariable(&quot;TEMP&quot;) + \\ + ProductName + @&quot;.log&quot; und ruft den nächsten Konstruktor auf.": "Parameterless constructor: sets the log file to GetEnvironmentVariable(&quot;TEMP&quot;) + \\ + ProductName + @&quot;.log&quot; and calls the next constructor.",
    "Konstruktor: übernimmt plainMessage, setzt das Logfile auf GetEnvironmentVariable(&quot;TEMP&quot;) + \\ + ProductName + @&quot;.log&quot; und ruft den nächsten Konstruktor auf.": "Constructor: takes plainMessage, sets the logfile to GetEnvironmentVariable(&quot;TEMP&quot;) + \\ + ProductName + @&quot;.log&quot; and calls the next constructor.",
    "Konstruktor: übernimmt plainMessage und regexFilter, setzt das Logfile auf GetEnvironmentVariable(&quot;TEMP&quot;) + \\ + ProductName + @&quot;.log&quot; und ruft den nächsten Konstruktor auf.": "Constructor: takes plainMessage and regexFilter, sets the logfile to GetEnvironmentVariable(&quot;TEMP&quot;) + \\ + ProductName + @&quot;.log&quot; and calls the next constructor.",
    "Konstruktor: übernimmt logFilePathName, setzt plainMessage auf false und ruft den nächsten Konstruktor auf.": "Constructor: accepts logFilePathName, sets plainMessage to false and calls the next constructor.",
    "Konstruktor: übernimmt logFilePathName und plainMessage, setzt regexFilter auf &quot;&quot; und ruft den nächsten Konstruktor auf.": "Constructor: takes logFilePathName and plainMessage, sets regexFilter to &quot;&quot; and calls the next constructor.",
    "Vollständiger Konstruktor.": "Complete constructor.",
    "Wrapper for external PostMessage.": "Wrapper for external PostMessage.",
    "Wrapper for external RegisterMessage.": "Wrapper for external RegisterMessage.",
    "Wartet, bis alle Child-Prozesse beendet sind oder ein Countdown abgelaufen ist. Wenn bei abgelaufenem Countdown noch nicht alle Prozesse beendet sind, werden sie abgeschossen.": "Waits until all child processes have ended or a countdown has expired. If not all processes have been completed when the countdown expires, they are terminated.",
    "Erhöht den Zähler mit dem übergebenen Namen um 1. Der Zähler wird bei der ersten Referenzierung neu erzeugt.": "Increments the counter with the transferred name by 1. The counter is regenerated at the first referencing.",
    "Setzt den Zähler mit dem übergebenen Namen auf 0. Der Zähler wird bei der ersten Referenzierung neu erzeugt. Wird als Zähler-Name null übergeben, werden alle Zähler auf 0 gesetzt und der interne Trigger zurückgesetzt.": "Sets the counter with the transferred name to 0. The counter is regenerated the first time it is referenced. If zero is passed as the counter name, all counters are set to 0 and the internal trigger is reset.",
    "Muss am Schluss der Verarbeitung aufgerufen werden, um die letzte Statistik auszugeben und den Timer zu stoppen.": "Must be called at the end of processing to output the last statistics and stop the timer.",
    "Abbrechen der Task.": "Cancel the task.",
    "Lässt den angehaltenen TaskWorker weiterlaufen.": "Keeps the paused TaskWorker running.",
    "Hier wird aufgeräumt.": "We clean up here.",
    "Versucht, den TaskWorker anzuhalten (Loop+Sleep).": "Attempts to stop the TaskWorker (Loop+Sleep).",
    "Meldet den Task-Fortschritt an Routinen, die sich in TaskProgressChanged eingehängt haben.": "Reports the task progress to routines that have hooked into TaskProgressChanged.",
    "Meldet das Task-Ende an Routinen, die sich in TaskProgressFinished eingehängt haben.": "Reports the end of the task to routines that have hooked into TaskProgressFinished.",
    "Startet die Verarbeitung einer asynchronen Task (ist selbst noch synchron).": "Starts the processing of an asynchronous task (is itself still synchronous).",
    "Wartet auf das Beenden der Task.": "Waits for the task to be completed.",
    "Handler für die Messages.": "Handler for the messages.",
    "Konstruktor - übernimmt einen geeiggnete EventHandler.": "Constructor - takes over a suitable EventHandler.",
    "Liefert ein Dictionary, das zu jedem Parameter den Namen der Quelle enthält. Kann in bestimmten Fällen für die Fehlersuche hilfreich sein.": "Returns a dictionary that contains the name of the source for each parameter. Can be helpful for troubleshooting in certain cases.",
    "Liefert genau einen Wert zu einem Key. Wenn es keinen Wert zu dem Key gibt, wird defaultValue zurückgegeben. Wildcards der Form %Name% werden, wenn möglich, rekursiv ersetzt.": "Returns exactly one value for a key. If there is no value for the key, defaultValue is returned. Wildcards of the form %Name% are replaced recursively if possible.",
    "Liefert ein string-Array zu einem Key. Wenn es keinen Wert zu dem Key gibt, wird defaultValue zurückgegeben.": "Returns a string array for a key. If there is no value for the key, defaultValue is returned.",
    "NICHT IMPLEMENTIERT! Liefert ein Array von Werten zu einem Key. Wenn es keinen Wert zu dem Key gibt, wird defaultValue zurückgegeben.": "NOT IMPLEMENTED! Returns an array of values for a key. If there is no value for the key, defaultValue is returned.",
    "Liefert genau einen Wert zu einem Key. Wenn es keinen Wert zu dem Key gibt, wird defaultValue zurückgegeben. Wildcards der Form %Name% werden, wenn möglich, rekursiv ersetzt; Es wird versucht, den ermittelten String-Wert in den Rückgabetyp T zu casten.": "Returns exactly one value for a key. If there is no value for the key, defaultValue is returned. Wildcards of the form %Name% are replaced recursively if possible; an attempt is made to cast the determined string value to the return type T.",
    "Gibt true zurück, wenn die übergebene Eigenschaft nicht über externe Quellen, sondern durch den Default-Wert gefüllt wurde.": "Returns true if the transferred property was not filled via external sources but by the default value.",
    "Liste, die von außen mit Key-Value Paaren gefüllt werden kann. Diese Liste wird bei der Suche ebenfalls berücksichtigt.": "List that can be filled externally with key-value pairs. This list is also taken into account during the search.",
    "Fügt stringValueGetter an das Ende der Liste an.": "Adds stringValueGetter to the end of the list.",
    "Fügt stringValueGetter am übergebenen index in die Liste ein.": "Inserts stringValueGetter at the passed index into the list.",
    "Fügt stringValueGetter vor dem anchor in die Liste ein.": "Inserts stringValueGetter into the list before the anchor.",
    "Liste, die von außen mit Key-Value Paaren gefüllt werden kann. Der gegebene Key wird aus der Liste entfernt.": "List that can be filled with key-value pairs from outside. The given key is removed from the list.",
    "Löscht stringValueGetter aus der Liste.": "Deletes stringValueGetter from the list.",
    "Parameterloser Konstruktor, initialisiert die Listen.": "Parameterless constructor, initializes the lists.",
    "Liefert true, wenn der Key in der Aufzählung enthalten ist.": "Returns true if the key is contained in the enumeration.",
    "Liefert ein Dictionary, das zu jedem Parameter den Namen der Quelle und den letzten Wert enthält. Kann in bestimmten Fällen für die Fehlersuche hilfreich sein.": "Returns a dictionary that contains the name of the source and the last value for each parameter. Can be helpful for troubleshooting in certain cases.",
    "Liefert aus der Aufzählung den Wert zum übergebenen Key.": "Returns the value for the transferred key from the enumeration.",
    "Merkt sich den Namen der Quelle des Werts eines übergebenen Parameters in einer Aufzählung für spätere Debug-Ausgaben aller Parameter und der letzten Quellen ihrer Werte.": "Remembers the name of the source of the value of a passed parameter in an enumeration for later debug outputs of all parameters and the last sources of their values.",
    "Erstellt einen kompletten Verzeichnispfad, wenn dieser oder ein Teil davon nicht existiert. Retourniert den Teil des Verzeichnispfades, der bis inklusive zum ersten der neu angelegten Verzeichnisse geht oder null.": "Creates a complete directory path if this path or part of it does not exist. Returns the part of the directory path that goes up to and including the first of the newly created directories or zero.",
    "Abschlussarbeiten, ggf. Timer zurücksetzen.": "Finish work, reset timer if necessary.",
    "Destruktor": "Destructor",
    "Liefert ein Dictionary, das für alle in der Applikation geladenen Assemblies den FullName und die Assembly enthält. Kann in bestimmten Fällen für die Fehlersuche hilfreich sein.": "Returns a dictionary that contains the FullName and the assembly for all assemblies loaded in the application. Can be helpful for troubleshooting in certain cases.",
    "Liefert ein Dictionary, das zu jedem Parameter den Namen der Quelle enthält. Kann in bestimmten Fällen für die Fehlersuche hilfreich sein. Hinweis: ist der Schalter &quot;DumpAppSettings&quot; = true, wird in &quot;Dispose&quot; dieses Dictionary geloggt.": "Returns a dictionary that contains the name of the source for each parameter. Can be helpful for troubleshooting in certain cases. Note: if the switch &quot;DumpAppSettings&quot; = true, this dictionary is logged in &quot;Dispose&quot;.",
    "Liefert genau einen Wert zu einem Key. Wenn es keinen Wert zu dem Key gibt, wird defaultValue zurückgegeben.": "Returns exactly one value for a key. If there is no value for the key, defaultValue is returned.",
    "Lädt die Systemeinstellungen bei der Initialisierung oder lädt sie auf Anforderung erneut.": "Loads the system settings during initialization or reloads them on request.",
    "Ersetzt Wildcards im Format %Name% durch ihre Laufzeit-Werte.": "Replaces wildcards in the format %Name% with their runtime values.",
    "Setzt die Default-Verzeichnisse für den Microsoft SQL Server.": "Sets the default directories for the Microsoft SQL Server.",
    "Setzt den Registry-Zugriffskey für alle nachfolgende Zugriffe auf den übergebenen Basis-Pfad, wenn sich der übergebene registryBasePath fehlerfrei in ein entsprechendes Equivalent aus Registy-Keys umwandeln lässt.": "Sets the registry access key for all subsequent accesses to the transferred base path if the transferred registryBasePath can be converted into a corresponding equivalent from registry keys without errors.",
    "Konstruktor, wird ggf. über Reflection vom externen statischen GenericSingletonProvider über GetInstance() aufgerufen. Holt alle Infos und stellt sie als Properties zur Verfügung.": "Constructor, may be called via Reflection from the external static GenericSingletonProvider via GetInstance(). Retrieves all information and makes it available as properties.",
    "Konstruktor - übernimmt einen Meldungstext.": "Constructor - takes over a message text.",
    "Holt vom remote Server die neueste Versionsinformation.": "Retrieves the latest version information from the remote server.",
    "Standard-Konstruktor - füllt Properties aus dem (von Launcher.exe modifizierten) Environment.": "Standard constructor - fills properties from the environment (modified by Launcher.exe).",
    "NetEti.ApplicationEnvironment.": "NetEti.ApplicationEnvironment.",
    "Liefert ein string-Array zu einem Key. Wenn es keinen Wert zu dem Key gibt, wird defaultValue zurückgegeben. Liefert nur einen Einzelwert als Array verpackt, muss ggf. spaeter erweitert werden.": "Returns a string array for a key. If there is no value for the key, defaultValue is returned. Only returns a single value packed as an array, may need to be expanded later.",
    "Konstruktor - setzt den internen Reader": "Constructor - sets the internal reader",
    "Liefert genau einen Wert zu einem Key. Wenn es keinen Wert zu dem Key gibt, oder der Wert nicht vom Typ T ist, wird defaultValue zurückgegeben.": "Returns exactly one value for a key. If there is no value for the key or the value is not of type T, defaultValue is returned.",
    "Konstruktor - lädt alle Properties des übergebenen Objekts &quot;owner&quot; (i.d.R. AppSettings).": "Constructor - loads all properties of the transferred object &quot;owner&quot; (usually AppSettings).",
    "Liefert den Wert eines einzelnen Parameters (Regedit rechts).": "Returns the value of a single parameter (Regedit right).",
    "Liefert ein Array der Werte eines einzelnen Parameters (Regedit rechts).": "Returns an array of the values of a single parameter (Regedit right).",
    "Liefert die Unterschlüssel von RegistryRoot + dem übergebenen keyString (Regedit: linke Seite).": "Returns the subkeys of RegistryRoot + the transferred keyString (Regedit: left side).",
    "Liefert zu einem Schlüssel in der Registry links die Parameternamen von der rechten Seite der Registry (Regedit).": "Returns the parameter names from the right-hand side of the registry (Regedit) for a key in the registry on the left.",
    "Parameterloser Konstruktor, setzt die RegistryRoot auf Default = RegistryRoot.HkeyLocalMachine und ruft damit den parametrisierten Konstruktor.": "Parameterless constructor, sets the RegistryRoot to Default = RegistryRoot.HkeyLocalMachine and thus calls the parameterized constructor.",
    "Parametrisierter Konstruktur, erwartet eine RegistryRoot.": "Parameterized structure, expects a RegistryRoot.",
    "InitializeComponent": "InitializeComponent",
    "Konstruktor - übernimmt den Meldungstext.": "Constructor - takes over the message text.",
    "Schließt das SplashWindow.": "Closes the SplashWindow.",
    "Gibt eine Meldung im SplashWindow aus.": "Displays a message in the SplashWindow.",
    "Gibt die Programmversion im SplashWindow aus.": "Displays the program version in the SplashWindow.",
    "Erzeugt das SplashWindow, startet es und gibt eine Referenz darauf zurück.": "Creates the SplashWindow, starts it and returns a reference to it.",
    "Clean up any resources being used.": "Clean up any resources being used.",
    "Abschlussarbeiten, Ressourcen freigeben.": "Final work, release resources.",
    "Sucht im VisualTree vom FrameworkElement element aufwärts nach dem ersten Elternelement vom Typ T mit Name == name.": "Searches in the VisualTree from the FrameworkElement element upwards for the first parent element of type T with name == name.",
    "Liefert die aktuellen Zoom-Einstellungen der ZoomBox.": "Returns the current zoom settings of the ZoomBox.",
    "Bereitet das Setzen der aktuellen Zoom-Einstellungen der ZoomBox vor. Beim nächsten ZoomBox_LayoutUpdated werden diese dann übernommen.": "Prepares the setting of the current zoom settings of the ZoomBox. These are then adopted with the next ZoomBox_LayoutUpdated.",
    "Setzt die aktuellen Zoom-Einstellungen der ZoomBox.": "Sets the current zoom settings of the ZoomBox.",
    "Parst und retourniert alle Namen, die nicht zu den für diesen Parsertyp definierten Operatoren gehören.": "Parses and returns all names that do not belong to the operators defined for this parser type.",
    "Überführt einen Textausdruck anhand vorgegebener Regeln in einen äquivalenten Syntaxbaum.": "Converts a text expression into an equivalent syntax tree using predefined rules.",
    "NetEti.ExpressionParser.": "NetEti.ExpressionParser.",
    "Erstellt aus einem Textausdruck mit vorgeparsten Token einen äquivalenten Syntaxbaum.": "Creates an equivalent syntax tree from a text expression with pre-parsed tokens.",
    "Stellt den SyntaxTree als Baum-Darstellung in eine StringList.": "Places the SyntaxTree as a tree representation in a StringList.",
    "Stellt den SyntaxTree als normalisierten Text-Ausdruck dar.": "Represents the SyntaxTree as a normalized text expression.",
    "Calls notepad with a given content and/or file path.": "Calls notepad with a given content and/or file path.",
    "Statisch, ermittelt den Default für Logfile- Pfad und Namen.": "Static, determines the default for log file path and name.",
    "NetEti.FileTools.": "NetEti.FileTools.",
    "Liest den Wert eines Entries aus einer Section der ini-Datei ein. Wird der gewünschte Eintrag nicht gefunden, zieht der Default.": "Reads the value of an entry from a section of the ini file. If the desired entry is not found, the default is used.",
    "Konstruktor: lädt die ini-Datei in ein Dictionary für spätere Abfragen.": "Constructor: loads the ini file into a dictionary for later queries.",
    "Liest die ganze Datei in den Speicher.": "Reads the entire file into memory.",
    "Muss im externen EventHandler aufgerufen werden werden, wenn der laufende Vorgang abgebrochen werden soll.": "Must be called in the external EventHandler if the current process is to be canceled.",
    "Liefert das Inhaltsverzeichnis des Zip-Archivs als String-Liste.": "Returns the table of contents of the zip archive as a string list.",
    "Ruft UnzipFirstDumpToFile(zipPathAndFile, &quot;&quot;, 0, null).": "Calls UnzipFirstDumpToFile(zipPathAndFile, &quot;&quot;, 0, null).",
    "Entpackt das erste File aus dem Archiv (keine Unterordner) und liefert Informationen darüber zurück. Wenn maxBytes &gt; 0 ist, werden zur Ermittlung der Informationen nur maxBytes entpackt.": "Unpacks the first file from the archive (no subfolders) and returns information about it. If maxBytes &gt; is 0, only maxBytes are unpacked to determine the information.",
    "Prüft, ob eine Datei ein Zip-Archiv mit mindestens einem Eintrag ist.": "Checks whether a file is a zip archive with at least one entry.",
    "Entpackt alle ZIP-Archive aus dem Verzeichnis zipsFolder in ein neues Unterverzeichnis mit dem Namen des Archivs im outputFolder.": "Unpacks all ZIP archives from the zipsFolder directory into a new subdirectory with the name of the archive in the outputFolder.",
    "Entpackt alles aus dem Archiv incl. Unterverzeichnis-Strukturen.": "Extracts everything from the archive including subdirectory structures.",
    "Packt alles aus dem Verzeichnis inputFolderPath in das Archiv zipPathAndFile incl. Unterverzeichnis-Strukturen.": "Packs everything from the directory inputFolderPath into the archive zipPathAndFile including subdirectory structures.",
    "Packt die Files aus &quot;filePathes&quot; in ein Archiv &quot;zipPathAndFile&quot;. Optional kann ein Passwort mitgegeben werden.": "Packs the files from &quot;filePathes&quot; into an archive &quot;zipPathAndFile&quot;. Optionally, a password can be specified.",
    "NetEti.FileTools.Zip.": "NetEti.FileTools.Zip.",
    "Prüft, ob eine Datei ein Zip-Archiv ist.": "Checks whether a file is a Zip archive.",
    "Entpackt alles aus dem Archiv incl. Unterverzeichnis-Strukturen in einen gegebenen Ordner.": "Unpacks everything from the archive including subdirectory structures into a given folder.",
    "Liefert das Inhaltsverzeichnis des Zip-Archivs als List&lt;ZippedFileInfo&gt;.": "Returns the table of contents of the zip archive as List&lt;ZippedFileInfo&gt;.",
    "Entpackt alle ZIP-Archive aus dem Verzeichnis zipsFolder in ein gegebenes Verzeichnis in Unterverzeichnisse mit den Namen der jeweiligen Archive.": "Unpacks all ZIP archives from the directory zipsFolder into a given directory in subdirectories with the names of the respective archives.",
    "Standard-Konstruktor - Setzt den Pfad zur passenden 7Zip-dll (32/64).": "Standard constructor - Sets the path to the appropriate 7Zip dll (32/64).",
    "Konvertiert ein DateTimeOffset nach DateTime.": "Converts a DateTimeOffset to DateTime.",
    "Liefert eine Liste aller Dateinamen und Unterverzeichnisnamen und deren Dateinamen und Unterverzeichnisnamen u.s.w. rekursiv. benutzt die interne Hilfsroutine GenerateFileListIntern.": "Returns a list of all file names and subdirectory names and their file names and subdirectory names etc. recursively. uses the internal helper routine GenerateFileListIntern.",
    "Liefert eine Liste aller Dateinamen und Unterverzeichnisnamen und deren Dateinamen und Unterverzeichnisnamen u.s.w. rekursiv. Interne Hilfsroutine von GenerateFileList.": "Returns a list of all file names and subdirectory names and their file names and subdirectory names etc. recursively. Internal helper routine of GenerateFileList.",
    "Liefert ein string-Array mit den FilePathes aus einer ZippedFileInfo-List.": "Returns a string array with the FilePaths from a ZippedFileInfo list.",
    "Hier kann aufgeräumt werden.": "You can tidy up here.",
    "Überschriebene ToString-Methode.": "Overwritten ToString method.",
    "Lädt die Assembly vom übergebenen Pfad.": "Loads the assembly from the specified path.",
    "Lädt ein Objekt vom übergebenen Typ aus der angegebenen Assembly dynamisch. Alle von der angegebenen Assembly referenzierten Assemblies werden zusätzlich auch in assemblyDirectories gesucht.": "Dynamically loads an object of the specified type from the specified assembly. All assemblies referenced by the specified assembly are also searched for in assemblyDirectories.",
    "Singleton-Provider - übernimmt Pfade zu Verzeichnissen, in denen zusätzlich nach Assemblies gesucht werden soll.": "Singleton provider - takes paths to directories in which assemblies are also to be searched for.",
    "Liefert eine Liste mit allen in der AppDomain geladenen Assemblies.": "Provides a list of all assemblies loaded in the AppDomain.",
    "Kopiert thread-safe die Keys von IDictionary&lt;T, U&gt; source auf IEnumerable&lt;T&gt; target.": "Copies thread-safe the keys from IDictionary&lt;T, U&gt; source to IEnumerable&lt;T&gt; target.",
    "Kopiert thread-safe IDictionary&lt;T, U&gt; source auf IDictionary&lt;T, U&gt; target.": "Copies thread-safe IDictionary&lt;T, U&gt; source to IDictionary&lt;T, U&gt; target.",
    "Kopiert thread-safe die Values von IDictionary&lt;T, U&gt; source auf IEnumerable&lt;U&gt; target.": "Copies the values from IDictionary&lt;T, U&gt; source to IEnumerable&lt;U&gt; target in a thread-safe manner.",
    "Kopiert thread-safe IEnumerable&lt;T&gt; source auf IEnumerable&lt;T&gt; target.": "Copies thread-safe IEnumerable&lt;T&gt; source to IEnumerable&lt;T&gt; target.",
    "Liefert eine Instanz der gewünschten Klasse zurück.": "Returns an instance of the desired class.",
    "Liefert eine neue Instanz der gewünschten Klasse zurück.": "Returns a new instance of the desired class.",
    "Liefert die einzige Instanz der gewünschten Klasse zurück. Beim ersten Aufruf wird diese Instanz voher erzeugt.": "Returns the only instance of the desired class. This instance is created beforehand on the first call.",
    "Hangelt sich durch den Baum nach oben (bis zur Root) und ruft für jeden Knoten die Action auf.": "Shimmy up through the tree (up to the root) and call up the action for each node.",
    "Geht rekursiv durch den Baum und ruft für jeden Knoten die Action auf.": "Goes recursively through the tree and calls the action for each node.",
    "Rekursive Hilfsroutine für die öffentliche Routine 'Traverse'.": "Recursive auxiliary routine for the public routine 'Traverse'.",
    "Konstruktor übernimmt das Mutter-Element.": "constructor takes over the parent element.",
    "Vergleicht zwei Versionsstrings, die aus durch '.' separierten Zahlen bestehen, z.B.: 1.0.0.10 mit 1.0.0.9. Compares two version-strings, consisting of '.' separated lines, i.e.: 1.0.0.10 mit 1.0.0.9.": "Compares two version-strings, consisting of '.' separated lines, e.g.: 1.0.0.10 with 1.0.0.9. Compares two version-strings, consisting of '.' separated lines, i.e.: 1.0.0.10 with 1.0.0.9.",
    "Kopiert ein Verzeichnis inklusive aller darin enthaltenen Dateien. Wenn der Parameter &quot;copySubDirs&quot; auf true steht, werden auch alle im Verzeichnis enthaltenen Unterverzeichnisse rekursiv mit kopiert.": "Copies a directory including all the files it contains. If the parameter &quot;copySubDirs&quot; is set to true, all subdirectories contained in the directory are also copied recursively.",
    "Konvertiert einen übergebenen absoluten Dateipfad in sein UNC-Äquivalent, wenn möglich. Converts a given absolute file path into it's UNC-equivalent, if possible.": "Converts a given absolute file path into it's UNC-equivalent, if possible. Converts a given absolute file path into it's UNC-equivalent, if possible.",
    "Returnt true, wenn der übergebene String ein gültiges Datum ist. Returns true, if the given string is a valid date.": "Returns true, if the given string is a valid date. Returns true, if the given string is a valid date.",
    "Wandelt einen übergebenen String in einen SecureString Converts a given string to a SecureString": "Converts a given string to a SecureString Converts a given string to a SecureString",
    "Wandelt eine Zeichenkette, die einen Unicode-Hexcode darstellt z.B.: 20AC (=&gt; €) in das entsprechende Zeichen um. Converts a string, representing a hex-unicode character like 20AC, to ascii €.": "Converts a string, representing a hex-unicode character like 20AC (=&gt; €) to the corresponding character. Converts a string, representing a hex-unicode character like 20AC, to ascii €.",
    "Liefert textuelle Infos über den aktuellen Thread für Debug-Zwecke.": "Provides textual information about the current thread for debugging purposes.",
    "Versucht ein dem übergebenen Namen intern zugeordnetes Objekt zu sperren und retourniert true, wenn die Sperre geklappt hat. Der Eintrag mit Namen und Objekt wird ggf. vorher neu erzeugt.": "Attempts to lock an object internally assigned to the transferred name and returns true if the lock was successful. The entry with the name and object is recreated beforehand if necessary.",
    "Liefert den übergebenen Punkt zurück, ändert aber, wenn erforderlich, seine Koordinaten so ab, dass der Punkt sich inklusive Margins auf jeden Fall innerhalb der für alle Bildschirme maximalen Koordinaten befindet.": "Returns the transferred point but, if necessary, changes its coordinates so that the point, including margins, is always within the maximum coordinates for all screens.",
    "Liefert Eigenschaften des aktuellen Bildschirms.": "Provides properties of the current screen.",
    "Liefert den Index des aktuellen Bildschirms in der Liste aller Bildschirme.": "Returns the index of the current screen in the list of all screens.",
    "Infos für alle Bildschirme plus einem virtuellen Gesamtbildschirm.": "Information for all screens plus a virtual overall screen.",
    "Liefert Eigenschaften des ersten (Haupt-) Bildschirms.": "Returns properties of the first (main) screen.",
    "Liefert Eigenschaften des letzten aktuellen Bildschirms.": "Returns properties of the last current screen.",
    "Liefert thread safe Position und Maße des MainWindow.": "Provides thread safe position and dimensions of the MainWindow.",
    "Liefert den übergebenen Punkt zurück, ändert aber, wenn erforderlich, seine Koordinaten so ab, dass der Punkt sich auf jeden Fall innerhalb der Koordinaten des aktuellen Bildschirms befindet.": "Returns the transferred point but, if necessary, changes its coordinates so that the point is always within the coordinates of the current screen.",
    "Liefert den übergebenen Punkt zurück, ändert aber, wenn erforderlich, seine Koordinaten so ab, dass der Punkt sich inklusive margin auf jeden Fall innerhalb der Koordinaten des aktuellen Bildschirms befindet.": "Returns the transferred point but, if necessary, changes its coordinates so that the point, including the margin, is always within the coordinates of the current screen.",
    "True, wenn sich der übergebene Punkt innerhalb der Screen-Koordinaten des aktuellen Bildschirms befindet.": "True if the transferred point is within the screen coordinates of the current screen.",
    "True, wenn sich der übergebene Punkt mindestens mit dem Abstand margin innerhalb der Screen-Koordinaten des aktuellen Bildschirms befindet.": "True if the transferred point is located within the screen coordinates of the current screen with at least the distance margin.",
    "Erzwingt CanExecuteChanged.": "Forces CanExecuteChanged.",
    "Meldet für die UI, wenn sich eine Property geändert hat.": "Reports for the UI when a property has changed.",
    "Triggert OnPropertyChanged.": "Triggers OnPropertyChanged.",
    "Checkt, ob ein Aufruf, aus dem richtigen Thread (Dispatcher) heraus erfolgt.": "Checks whether a call is made from the correct thread (dispatcher).",
    "Standard Konstruktor - ermittelt den Dispatcher.": "Standard constructor - determines the dispatcher.",
    "Konstruktor - übernimmt eine String-List mit Property-Namen.": "Constructor - accepts a string list with property names.",
    "Prüft eine übergebene Expression auf ihren Status als public Property und extrahiert ihren Namen als String.": "Checks a passed expression for its status as a public property and extracts its name as a string.",
    "Warnt, falls das Objekt keine öffentliche Property mit dem übergebenen Namen hat(nur im Debug-Build).": "Warns if the object does not have a public property with the transferred name (only in the debug build).",
    "Prüfungsroutine auf Ausführungserlaubnis für das Kommando für die UI.": "Check routine for execution permission for the command for the UI.",
    "Führt das Kommando aus.": "Executes the command.",
    "Konstruktor - übernimmt eine auszuführende Action.": "Constructor - takes over an action to be executed.",
    "Konstruktor - übernimmt eine auszuführende Action und eine Check-Routine für die (De-)Aktivierung der Action.": "Constructor - takes over an action to be executed and a check routine for (de)activating the action.",
    "NetEti.ObjectSerializer.": "NetEti.ObjectSerializer.",
    "Deserialisiert eine Byte-Liste in ein entsprechendes Objekt.": "Deserializes a byte list into a corresponding object.",
    "Serialisiert ein Objekt in einen String mit einem gegebenen Encoding.": "Serializes an object into a string with a given encoding.",
    "Serialisiert ein Objekt in eine Byte-Liste.": "Serializes an object into a byte list.",
    "Löst den übergebenen Pfad unter Berücksichtigung der Suchreihenfolge in einen gesicherten Pfad auf, wenn möglich.": "Resolves the transferred path into a saved path, taking into account the search sequence, if possible.",
    "Routine, die den ParameterReader entsprechend der vorher in UserParameterReaderPath konfigurierten Parameter initialisiert.": "Routine that initializes the ParameterReader according to the parameters previously configured in UserParameterReaderPath.",
    "Registriert die übergebene IGetStringValue-Instanz (UserParameterReader) beim enthaltenen AppEnvReader. Der neue Getter wird in der Auswertungskette direkt hinter CommandLineAccess eingehängt, was ihm (nach der Kommandozeile) höchste Priorität gibt.": "Registers the passed IGetStringValue instance (UserParameterReader) with the contained AppEnvReader. The new getter is inserted directly after CommandLineAccess in the evaluation chain, which gives it the highest priority (after the command line).",
    "Ersetzt hier definierte Wildcards durch ihre Laufzeit-Werte: '%HOME%': '...bin\\Debug'.": "Replaces wildcards defined here with their runtime values: '%HOME%': '...bin\\Debug'.",
    "Liefert Properties aus einer Klasse, die nach vormaliger Serialisierung nicht in dieselbe Klasse umgewandelt werden kann. Tritt bei dynamisch geladener Assembly auf.": "Returns properties from a class that cannot be converted to the same class after previous serialization. Occurs with a dynamically loaded assembly.",
    "Wird von Vishnu vor jedem Run eines Checkers, Workers oder vor Start eines Triggers aufgerufen. Returnt true, wenn der Run/Start ausgeführt werden kann.": "Is called by Vishnu before each run of a checker, worker or before the start of a trigger. Returns true if the run/start can be executed.",
    "Übernahme von diversen Logging-Informationen.": "Transfer of various logging information.",
    "Startet den Trigger; vorher sollte sich der Consumer in TriggerIt eingehängt haben.": "Starts the trigger; the consumer should first have connected to TriggerIt.",
    "Stoppt den Trigger.": "Stops the trigger.",
    "Routine, die Startparameter übernimmt und den ParameterReader entsprechend konfiguriert; muss direkt nach Instanziierung aufgerufen werden.": "Routine that accepts start parameters and configures the ParameterReader accordingly; must be called directly after instantiation.",
    "Liefert zu einem String-Parameter einen String-Wert.": "Returns a string value for a string parameter.",
    "Liefert das oberste JobListViewModel des Trees als IVishnuViewModel.": "Returns the top JobListViewModel of the tree as IVishnuViewModel.",
    "Aktualisiert die ViewModels von eventuellen zusätzliche Ansichten, die dieselbe BusinessLogic abbilden (hier: JobGroupViewModel).": "Updates the ViewModels of any additional views that map the same BusinessLogic (here: JobGroupViewModel).",
    "Setzt das oberste JobListViewModel des Trees. Returnt das bisherige oberste JobListViewModel.": "Sets the top JobListViewModel of the tree. Returns the previous top JobListViewModel.",
    "Lädt eine Jobbeschreibung in einem Fremdformat, konvertiert diese in eine Vishnu JobDescription.xml und retourniert diese als XDocument.": "Loads a job description in a foreign format, converts it into a Vishnu JobDescription.xml and returns it as an XDocument.",
    "Standard Konstruktor. Dictionary&lt;string, Result&gt;.": "Standard constructor. Dictionary&lt;string, Result&gt;.",
    "Vergleicht Dieses Result mit einem übergebenen Result nach Inhalt. Der Timestamp wird bewusst nicht in den Vergleich einbezogen.": "Compares this result with a transferred result by content. The timestamp is deliberately not included in the comparison.",
    "Erzeugt einen eindeutigen Hashcode für dieses Result. Der Timestamp wird bewusst nicht in den Vergleich einbezogen.": "Generates a unique hash code for this result. The timestamp is deliberately not included in the comparison.",
    "Serialisierungs-Hilfsroutine: holt die Objekt-Properties in den Property-Container.": "Serialization helper routine: fetches the object properties into the property container.",
    "Deserialisierungs-Konstruktor.": "Deserialization constructor.",
    "Parametrisierter Konstruktor.": "Parameterized constructor.",
    "Mappt einen Benutzer-freundlichen Ereignis-Namen auf einen internen Ereignis-Namen.": "Maps a user-friendly event name to an internal event name.",
    "Mappt einen String mit durch Pipe ('|') getrennte Benutzer-freundliche Ereignis-Namen auf einen normalisierten String mit entsprechenden internen Ereignis-Namen.": "Maps a string with pipe ('|') separated user-friendly event names to a normalized string with corresponding internal event names.",
    "Mappt einen internen Ereignis-Namen auf einen Benutzer-freundlichen Ereignis-Namen.": "Maps an internal event name to a user-friendly event name.",
    "Mappt einen normalisierten String mit entsprechenden internen Ereignis-Namen auf einen String mit durch Pipe ('|') getrennte Benutzer-freundliche Ereignis-Namen.": "Maps a normalized string with corresponding internal event names to a string with user-friendly event names separated by a pipe ('|').",
    "Ersetzt definierte Wildcards durch ihre Laufzeit-Werte: '%HOME%': '...bin\\Debug'.": "Replaces defined wildcards with their runtime values: '%HOME%': '...bin\\Debug'.",
    "Konstruktor: übernimmt und erzeugt diverse Informationen für das TreeEvent.": "Constructor: takes over and creates various information for the TreeEvent.",
    "Überschriebene Equals-Methode.": "Overwritten equals method.",
    "Überschriebene GetHashCode-Methode.": "Overwritten GetHashCode method.",
    "Absolute Bildschirmposition der Mitte des beinhaltenden Controls.": "Absolute screen position of the center of the containing control.",
    "Liefert threadsafe Position und Maße das MainWindow.": "Provides threadsafe position and dimensions of the MainWindow.",
    "Überschriebene ToString-Methode - returniert nur den Namen.": "Overwritten ToString method - returns only the name.",
    "Konstruktor - übernimmt den logischen Namen des Trees.": "Constructor - takes the logical name of the tree.",
    "Konstruktor - übernimmt den logischen Namen des Trees und das Parent-Control.": "Constructor - takes the logical name of the tree and the parent control.",
    "Diese Routine wird von der Routine &quot;Start&quot; angesprungen, bevor der Trigger gestartet wird. Hier wird nur der Parameter &quot;|UserRun&quot; ausgewertet und die Variable &quot;_isUserRun&quot; entsprechend gesetzt.": "This routine is started by the &quot;Start&quot; routine before the trigger is started. Only the parameter &quot;|UserRun&quot; is evaluated here and the variable &quot;_isUserRun&quot; is set accordingly.",
    "Diese Routine löst das Trigger-Event aus. Für ein Setzen der Variablen &quot;_lastStart&quot; und &quot;_nextStart&quot; kann diese Routine überschrieben werden.": "This routine triggers the trigger event. This routine can be overwritten to set the variables &quot;_lastStart&quot; and &quot;_nextStart&quot;.",
    "Startet den Trigger; vorher sollte sich der Consumer in triggerIt eingehängt haben.": "Starts the trigger; the consumer should first have connected to triggerIt.",
    "Wird aufgerufen, wenn die übergebenen Parameter fehlerhaft waren.": "Is called if the transferred parameters were incorrect.",
    "Vishnu.Interchange.": "Vishnu.Interchange.",
    "Löscht den internen Assembly-Cache, sodass alle Assemblies beim nächsten Aufruf neu geladen werden.": "Deletes the internal assembly cache so that all assemblies are reloaded the next time they are called.",
    "Registriert Pfade von dynamisch zu ladenden Assemblies, die beim nächsten Ladevorgang auf jeden Fall neu von der Festplatte und nicht aus einem eventuell gecachtem Image geladen werden sollen.": "Registers paths of assemblies to be loaded dynamically, which should always be reloaded from the hard disk and not from a possibly cached image during the next loading process.",
    "Absolute Bildschirmposition der Mitte des zugehörigen Controls.": "Absolute screen position of the center of the associated control.",
    "Konstruktor - übernimmt die Parameter für den gesamten Tree.": "Constructor - takes over the parameters for the entire tree.",
    "Hier werden die beim disposing notwendigen Aktionen durchgeführt.": "The actions required for disposing are carried out here.",
    "WPF-Getter für die AttachedNameProperty.": "WPF getter for the AttachedNameProperty.",
    "Abstrakte Definition von GetUserResultViewModel: muss für konkrete Anwendung überschrieben werden.": "Abstract definition of GetUserResultViewModel: must be overwritten for specific application.",
    "Löst das OnDynamicUserControl_ContentRendered-Ereignis aus.": "Triggers the OnDynamicUserControl_ContentRendered event.",
    "WPF-Setter für die AttachedNameProperty.": "WPF setter for the AttachedNameProperty.",
    "Setzt den konkreten DataContext für das ContextMenu. Kann überschrieben werden (Beispiel: LogicalTaskJobGroupsControl.xaml.cs).": "Sets the specific DataContext for the ContextMenu. Can be overwritten (example: LogicalTaskJobGroupsControl.xaml.cs).",
    "Konstruktor - hängt sich in das LoadedEvent ein.": "Constructor - hooks into the LoadedEvent.",
    "Holt eine Property mit Namen propertyName vom Typ T aus dem ReturnObject des besitzenden Vishnu-Knotens. Das ReturnObject muss vom Typ requiredReturnObjectType sein.": "Retrieves a property with the name propertyName of type T from the ReturnObject of the owning Vishnu node. The ReturnObject must be of type requiredReturnObjectType.",
    "Vishnu.ViewModel.": "Vishnu.ViewModel.",
    "Wird von DynamicUserControlBase angesprungen, wenn das UserControl vollständig gezeichnet wurde.": "Is called up by DynamicUserControlBase when the UserControl has been completely drawn.",
    "Wird angesprungen, wenn sich der logische Zustand des zugeordneten Knotens aus der Business-Logic geändert hat.": "Is triggered if the logical status of the assigned node from the business logic has changed.",
    "Liefert true, wenn die Funktion ausführbar ist.": "Returns true if the function is executable.",
    "Prüft, ob die Tree-Ausrichtung verändert werden darf. Hier: liefert immer false zurück.": "Checks whether the tree alignment may be changed. Here: always returns false.",
    "Löscht eventuell vorhandene Vishnu-Infos (Messages und Logs).": "Deletes any existing Vishnu information (messages and logs).",
    "Holt eventuell vorhandene Vishnu-Infos (Messages und Logs) in den Vordergrund.": "Brings any existing Vishnu information (messages and logs) to the foreground.",
    "Liefert einen string für Debug-Zwecke.": "Returns a string for debugging purposes.",
    "Liefert das Ergebnis für die Property ToolTipInfo. Diese Routine zeigt per Default auf NextRunInfoAndResult, wird aber hier überschrieben.": "Returns the result for the ToolTipInfo property. This routine points to NextRunInfoAndResult by default, but is overwritten here.",
    "Loggt den Tree.": "Logs the tree.",
    "Lädt den Tree nach Änderung der JobDescriptions neu.": "Reloads the tree after changing the JobDescriptions.",
    "Öffnet die Logdatei im Standardeditor asynchron über ShowLogTaskTree.": "Opens the log file in the standard editor asynchronously via ShowLogTaskTree.",
    "Öffnet die Logdatei im Standardeditor.": "Opens the log file in the standard editor.",
    "Gibt die Vishnu-Parameter im NotePad-Editor aus.": "Outputs the Vishnu parameters in the NotePad editor.",
    "Wird von DynamicUserControlBase angesprungen, wenn das UserControl vollständig gerendered wurde.": "Is triggered by DynamicUserControlBase when the UserControl has been fully rendered.",
    "Konstruktor - übernimmt das anzuzeigende JobListViewModel und einen Filter für anzuzeigende NodeTypes.": "Constructor - takes over the JobListViewModel to be displayed and a filter for NodeTypes to be displayed.",
    "Vergleicht den Inhalt dieses JobListViewModels nach logischen Gesichtspunkten mit dem Inhalt eines übergebenen JobListViewModels.": "Compares the content of this JobListViewModel with the content of a transferred JobListViewModel according to logical criteria.",
    "Erzeugt einen Hashcode für dieses JobListViewModel.": "Generates a hash code for this JobListViewModel.",
    "Ausführungserlaubnis für den Event-Handler für das Öffnen des Expanders.": "Execution permission for the event handler for opening the expander.",
    "Klappt den ViewModel-Zweig ein und damit auch die TreeView (wegen der assoziierten Knoten).": "Collapses the ViewModel branch and thus also the TreeView (because of the associated nodes).",
    "Abschlussarbeiten.": "Final theses.",
    "Vergleicht den Inhalt dieses LogicalNodeViewModels nach logischen Gesichtspunkten mit dem Inhalt eines übergebenen LogicalNodeViewModels.": "Compares the content of this LogicalNodeViewModel according to logical aspects with the content of a transferred LogicalNodeViewModel.",
    "Klappt den ViewModel-Tree komplett aus und damit auch die TreeView (wegen der assoziierten Knoten).": "Folds out the ViewModel tree completely and thus also the TreeView (because of the associated nodes).",
    "Erzeugt einen Hashcode für dieses LogicalNodeViewModel.": "Generates a hash code for this LogicalNodeViewModel.",
    "Gibt die zugeordnete logicalNode aus der BusinessLogic zurück.": "Returns the assigned logicalNode from the BusinessLogic.",
    "Liefert das Ergebnis für die Property ToolTipInfo. Diese Routine zeigt per Default auf NextRunInfoAndResult, kann aber gegebenenfalls überschrieben werden.": "Returns the result for the ToolTipInfo property. This routine points to NextRunInfoAndResult by default, but can be overwritten if necessary.",
    "Event-Handler für das Schließen des Expanders.": "Event handler for closing the expander.",
    "Event-Handler für das Öffnen des Expanders.": "Event handler for opening the expander.",
    "Event-Handler für Größenänderung des Expanders.": "Event handler for resizing the expander.",
    "Lädt die Kinder eines Knotens.": "Loads the children of a node.",
    "Lädt den gesamten Tree inklusive JobDescription.xml asynchron neu.": "Reloads the entire tree including JobDescription.xml asynchronously.",
    "Speichert eine Referenz auf das zugehörige Control in der Geschäftslogik.": "Saves a reference to the associated control in the business logic.",
    "Aktualisiert die Anzeige eines Teilbaums.": "Updates the display of a subtree.",
    "Sucht einen Knoten in einem Tree-Branch zu einer gegebenen Index-Hierarchie im Stack &quot;indices&quot;.": "Searches for a node in a tree branch for a given index hierarchy in the &quot;indices&quot; stack.",
    "Setzt die Ausrichtung der Kind-Knoten.": "Sets the alignment of the child nodes.",
    "Wird angesprungen, wenn sich irgendwo in diesem Teilbaum ein LastNotNullLogical geändert hat.": "Is triggered if a LastNotNullLogical has changed anywhere in this subtree.",
    "Wird angesprungen, wenn sich irgendwo in diesem Teilbaum ein Logical geändert hat.": "Is triggered if a logical has changed somewhere in this subtree.",
    "Wird angesprungen, wenn sich irgendwo in diesem Teilbaum ein Verarbeitungsfortschritt geändert hat.": "Is triggered if a processing progress has changed somewhere in this subtree.",
    "Wird angesprungen, wenn irgendwo in diesem Teilbaum eine Verarbeitung beendet wurde.": "Is triggered when processing has been completed somewhere in this subtree.",
    "Wird angesprungen, wenn irgendwo in diesem Teilbaum eine Verarbeitung gestartet wurde.": "Starts when processing has been started somewhere in this subtree.",
    "Wird angesprungen, wenn sich für diesen Knoten sonstige Properties geändert haben, die an die UI weitergegeben werden sollen.": "Is activated if other properties have changed for this node that are to be passed on to the UI.",
    "Wird angesprungen, wenn für diesen Knoten Worker existieren und sich deren Zustand verändert hat.": "Is triggered if workers exist for this node and their status has changed.",
    "Wird angesprungen, wenn sich in LogicalTaskTree für die Anzeige relevante Eigenschaften geändert haben.": "Is activated if properties relevant to the display have changed in LogicalTaskTree.",
    "Wird angesprungen, wenn sich irgendwo in diesem Teilbaum ein NodeState geändert hat. Ändert abhängig von den Knoteneigenschaften &quot;LogicalState&quot;, &quot;State&quot; und &quot;Trigger&quot; die Anzeige des Verarbeitungszustandes des Knoten.": "Is triggered if a NodeState has changed anywhere in this subtree. Changes the display of the processing state of the node depending on the node properties &quot;LogicalState&quot;, &quot;State&quot; and &quot;Trigger&quot;.",
    "Überträgt Eigenschaften von einem gesicherten Branch auf einen aktiven Branch.": "Transfers properties from a secured branch to an active branch.",
    "Überträgt bestimmte Eigenschaften im VisualTree von sibling auf node.": "Transfers certain properties in the VisualTree from sibling to node.",
    "Macht aus einem übergebenen (Teil-)Baum eine flache Liste. Welche Knotentypen in der Liste angezeigt werden und welche nicht, kann extern in der app.": "Turns a transferred (sub)tree into a flat list. Which node types are displayed in the list and which are not can be defined externally in the app.",
    "Speichert den aktuellen Darstellungszustand des Main Windows (parameter) und aller Knoten (collapsed oder expanded).": "Saves the current display status of the main window (parameter) and all nodes (collapsed or expanded).",
    "Konstruktor - übernimmt die Geschäftslogik, das MainWindow, die Start-Ausrichtung des Baums und einen Filter für die anzuzeigenden NodeTypes.": "Constructor - takes over the business logic, the MainWindow, the start orientation of the tree and a filter for the NodeTypes to be displayed.",
    "Ruft die gleichnamige Methode im LogicalTaskTreeViewModel zum speichern des aktuellen Darstellungszustandes des Main Windows (parameter) und aller Knoten (collapsed oder expanded) auf.": "Calls the method of the same name in the LogicalTaskTreeViewModel to save the current display status of the main window (parameter) and all nodes (collapsed or expanded).",
    "Zeigt die Vishnu Onlinehilfe an.": "Displays the Vishnu online help.",
    "Leitet die Anforderung zur Veränderung der Tree-Ausrichtung (Yin_Yang) an das Main-JobListViewModel weiter.": "Forwards the request to change the tree alignment (Yin_Yang) to the Main-JobListViewModel.",
    "Konstruktor - übernimmt das ViewModel für den LogicalTaskTree und eine Methode des MainWindows zum Restaurieren der Fenstergröße abhängig vom Fensterinhalt.": "Constructor - takes over the ViewModel for the LogicalTaskTree and a method of the MainWindow for restoring the window size depending on the window content.",
    "Konstruktor - übernimmt das übergeordnete ViewModel und den Pfad zur Dll, die nicht geladen werden konnte.": "Constructor - takes over the superordinate ViewModel and the path to the Dll that could not be loaded.",
    "Konstruktor - übernimmt das ViewModel des übergeordneten LogicalTaskTree, den übergeordneten ViewModel-Knoten, den zugeordneten Knoten aus dem LogicalTaskTree, einen Schalter für Lazy-Loading und das Root-FrameworkElement zu diesem ViewModel.": "Constructor - takes the ViewModel of the parent LogicalTaskTree, the parent ViewModel node, the assigned node from the LogicalTaskTree, a switch for lazy loading and the Root-FrameworkElement for this ViewModel.",
    "Dummy-Konstruktor.": "Dummy constructor.",
    "Vergleicht den Inhalt dieses SingleNodeViewModels nach logischen Gesichtspunkten mit dem Inhalt eines übergebenen SingleNodeViewModels.": "Compares the content of this SingleNodeViewModel with the content of a transferred SingleNodeViewModel according to logical criteria.",
    "Erzeugt einen Hashcode für dieses SingleNodeViewModel.": "Generates a hash code for this SingleNodeViewModel.",
    "Sucht im LogicalTree vom FrameworkElement element nach dem ersten Kindelement vom Typ T.": "Searches in the LogicalTree of the FrameworkElement element for the first child element of type T.",
    "Sucht im VisualTree vom FrameworkElement element nach dem ersten Kindeskind-Element vom Typ T, welches auf ein Kindelement vom Typ 'predecessorType' mit dem Namen 'predecessorName' folgt.": "Searches in the VisualTree of the FrameworkElement element for the first child element of type T that follows a child element of type 'predecessorType' with the name 'predecessorName'.",
    "Sucht im VisualTree vom FrameworkElement element nach dem ersten Kindelement vom Typ T mit Name == name.": "Searches in the VisualTree of the FrameworkElement element for the first child element of type T with name == name.",
    "Sucht im VisualTree vom FrameworkElement element nach dem ersten Kindelement vom Typ T.": "Searches in the VisualTree of the FrameworkElement element for the first child element of type T.",
    "Sucht im VisualTree vom FrameworkElement element aufwärts nach dem ersten Elternelement vom Typ T.": "Searches in the VisualTree from the FrameworkElement element upwards for the first parent element of type T.",
    "Liefert true, wenn die Funktion ausführbar ist, hier immer false. Kann an geeigneter Stelle überschrieben werden.": "Returns true if the function is executable, here always false. Can be overwritten at a suitable point.",
    "Liefert true, wenn die Funktion ausführbar ist, hier immer true. Kann an geeigneter Stelle überschrieben werden.": "Returns true if the function is executable, in this case always true. Can be overwritten at a suitable point.",
    "Liefert true, wenn die Funktion ausführbar ist, hier immer true.": "Returns true if the function is executable, here always true.",
    "Prüft, ob die Tree-Ausrichtung verändert werden darf. Hier: liefert immer true zurück.": "Checks whether the tree alignment may be changed. Here: always returns true.",
    "Ist zum Löschen eventuell vorhandener Vishnu-Infos (Messages und Logs) vorgesehen. Kann dafür an geeigneter Stelle überschrieben werden.": "Is intended for deleting any existing Vishnu info (messages and logs). Can be overwritten at a suitable location.",
    "Vergibt einen neuen GlobalUniqueIdentifier für den VisualTreeCacheBreaker.": "Assigns a new GlobalUniqueIdentifier for the VisualTreeCacheBreaker.",
    "Ist zum Loggen des Trees an geeigneter Stelle vorgesehen. Kann dafür überschrieben werden.": "Is intended for logging the tree at a suitable location. Can be overwritten for this purpose.",
    "Kann überschrieben werden, um das Parent-Control in der Geschäftslogik zu speichern.": "Can be overwritten to save the parent control in the business logic.",
    "Wechselschalter - hält den Tree an oder lässt ihn weiterlaufen.": "Toggle switch - stops the tree or keeps it running.",
    "Ist zum Neu-Laden des Trees an geeigneter Stelle nach Änderung der JobDescriptions vorgesehen. Kann dafür überschrieben werden.": "Is intended for reloading the tree at a suitable point after changing the JobDescriptions. Can be overwritten for this purpose.",
    "Ist zum Anzeigen eventuell vorhandener Vishnu-Infos (Messages und Logs) im Vordergrund vorgesehen. Kann dafür an geeigneter Stelle überschrieben werden.": "Is intended for displaying any Vishnu information (messages and logs) in the foreground. Can be overwritten in a suitable place.",
    "Ist zum Anzeigen des Vishnu-Logs vorgesehen. Kann dafür an geeigneter Stelle überschrieben werden.": "Is intended for displaying the Vishnu log. Can be overwritten in a suitable place.",
    "Ist zum Anzeigen der Vishnu-Parameter vorgesehen. Kann dafür an geeigneter Stelle überschrieben werden.": "Is intended for displaying the Vishnu parameters. Can be overwritten at a suitable point.",
    "Anforderung zur Veränderung der Tree-Ausrichtung (Yin_Yang/F4).": "Request to change the tree alignment (Yin_Yang/F4).",
    "Konstruktor - setzt den VisualTreeCacheBreaker.": "Constructor - sets the VisualTreeCacheBreaker.",
    "WPF-Getter für das ExpandedCommand.": "WPF getter for the ExpandedCommand.",
    "WPF-Setter für das ExpandedCommand.": "WPF setter for the ExpandedCommand.",
    "Event-Handler für das Collapsed-Event des Expanders.": "Event handler for the collapsed event of the expander.",
    "Event-Handler für das Expanded-Event des Expanders.": "Event handler for the Expander's Expanded event.",
    "WPF-Getter für das CollapsedCommand.": "WPF getter for the CollapsedCommand.",
    "WPF-Getter für das SizeChangedCommand.": "WPF getter for the SizeChangedCommand.",
    "WPF-Setter für das CollapsedCommand.": "WPF setter for the CollapsedCommand.",
    "WPF-Setter für das SizeChangedCommand.": "WPF setter for the SizeChangedCommand.",
    "Event-Handler für das SizeChanged-Event des Expanders.": "Event handler for the SizeChanged event of the expander.",
    "WPF-Getter für die HasParentProperty.": "WPF getter for the HasParentProperty.",
    "WPF-Getter für die LastNotNullLogicalProperty.": "WPF getter for the LastNotNullLogicalProperty.",
    "WPF-Getter für die ParentChildOrientationProperty.": "WPF getter for the ParentChildOrientationProperty.",
    "WPF-Setter für die HasParentProperty.": "WPF setter for the HasParentProperty.",
    "WPF-Setter für die LastNotNullLogicalProperty.": "WPF setter for the LastNotNullLogicalProperty.",
    "WPF-Setter für die ParentChildOrientationProperty.": "WPF setter for the ParentChildOrientationProperty.",
    "Vishnu.WPF_UI.DependencyProperties.": "Vishnu.WPF_UI.DependencyProperties.",
    "Change Event - Adds the columns.": "Change Event - Adds the columns.",
    "Change Event - Makes specified Column's Width equal to Auto or Star depending on GridHelpers._gridColumnUnitType.": "Change Event - Makes specified Column's Width equal to Auto or Star depending on GridHelpers._gridColumnUnitType.",
    "Returns the actual ColumnCount of a given Grid.": "Returns the actual ColumnCount of a given grid.",
    "Returns a string representing the value of the ColumnsPropertiesProperty of a given Grid.": "Returns a string representing the value of the ColumnsPropertiesProperty of a given Grid.",
    "Returns the actual RowCount of a given Grid.": "Returns the actual RowCount of a given Grid.",
    "Returns a string representing the value of the RowsPropertiesProperty of a given Grid.": "Returns a string representing the value of the RowsPropertiesProperty of a given Grid.",
    "Change Event - Adds the Rows.": "Change Event - Adds the Rows.",
    "Change Event - Makes the specified Row's Height equal to Auto or Star depending on GridHelpers._gridRowUnitType.": "Change Event - Makes the specified Row's Height equal to Auto or Star depending on GridHelpers._gridRowUnitType.",
    "Sets the ColumnCount of a given Grid to the given value.": "Sets the ColumnCount of a given Grid to the given value.",
    "Sets the new value of the ColumnsPropertiesProperty of a given Grid.": "Sets the new value of the ColumnsPropertiesProperty of a given Grid.",
    "Sets the RowCount of a given Grid to the given value.": "Sets the RowCount of a given Grid to the given value.",
    "Sets the new value of the RowsPropertiesProperty of a given Grid.": "Sets the new value of the RowsPropertiesProperty of a given Grid.",
    "Liefert True, wenn der übergebene sourceType konvertiert werden könnte (also vom Typ string ist).": "Returns True if the passed sourceType could be converted (i.e. is of type string).",
    "Liefert True, wenn in den übergebenen destinationType konvertiert werden könnte (der destinationType also vom Typ string ist).": "Returns True if it is possible to convert to the transferred destinationType (i.e. the destinationType is of type string).",
    "Konvertiert von string nach OrientationSwitch.": "Converts from string to OrientationSwitch.",
    "Konvertiert von OrientationSwitch nach string.": "Converts from OrientationSwitch to string.",
    "Eine optionale Sammlung von Standardwerten für die Konvertierung.": "An optional collection of default values for the conversion.",
    "Liefert True, wenn Standartwerte für die Konvertierung angeboten werden.": "Returns True if default values are offered for the conversion.",
    "Setzt den konkreten DataContext für das ContextMenu.": "Sets the specific DataContext for the ContextMenu.",
    "Konstruktor: erzeugt eine Instanz von LogicalTaskJobGroupsControl und ruft InitializeComponent().": "Constructor: creates an instance of LogicalTaskJobGroupsControl and calls InitializeComponent().",
    "Konstruktor: erzeugt eine Instanz von LogicalTaskTreeControl und ruft InitializeComponent().": "Constructor: creates an instance of LogicalTaskTreeControl and calls InitializeComponent().",
    "Setzt die Fenstergröße unter Berücksichtigung von Maximalgrenzen auf die Höhe und Breite des Inhalts und die Property SizeToContent auf WidthAndHeight. Zentriert das Window dann neu relativ zur letzten Position.": "Sets the window size to the height and width of the content, taking maximum limits into account, and the SizeToContent property to WidthAndHeight. Then re-centers the window relative to the last position.",
    "Centers Window on Screen.": "Centers Window on Screen.",
    "Raises the System.Windows.Window.SourceInitialized event.": "Raises the System.Windows.Window.SourceInitialized event.",
    "Konstruktor des Haupt-Fensters.": "Constructor of the main window.",
    "Konkrete Überschreibung von GetUserResultViewModel, returnt ein spezifisches ResultViewModel.": "Concrete override of GetUserResultViewModel, returns a specific ResultViewModel.",
    "Wandelt Orientation in ExpandDirection (&quot;Horizontal&quot; in &quot;Down&quot; und &quot;Vertical&quot; in &quot;Right&quot;).": "Converts Orientation to ExpandDirection (&quot;Horizontal&quot; to &quot;Down&quot; and &quot;Vertical&quot; to &quot;Right&quot;).",
    "Wandelt ExpandDirection in Orientation.": "Converts ExpandDirection to Orientation.",
    "Vishnu.WPF_UI.ValueConverter.": "Vishnu.WPF_UI.ValueConverter.",
    "MultiValueConverter - returns true, if two values are equal.": "MultiValueConverter - returns true, if two values are equal.",
    "There is no way back =&gt; not implemented.": "There is no way back =&gt; not implemented.",
    "Wandelt einen nicht leeren String in Boolean true. (&quot;&quot; oder Null: true, alles andere: false).": "Converts a non-empty string to Boolean true. (&quot;&quot; or zero: true, everything else: false).",
    "Wandelt einen nullable bool in Farben (SolidColorBrush): null: gelb, true: grün, false: rot.": "Converts a nullable bool into colors (SolidColorBrush): null: yellow, true: green, false: red.",
    "Wandelt die Farben gelb, grün, rot (SolidColorBrush) in null, true, false.": "Converts the colors yellow, green, red (SolidColorBrush) to null, true, false.",
    "Wandelt eine Orientation (Horizontal, Vertical) abhängig von einem zusätzlichen Schalter vom Typ OrientationSwitch um: Unchanged=unverändert, Switched=umgedreht, Horizontal=horizontal, Vertical=vertikal.": "Converts an orientation (horizontal, vertical) depending on an additional switch of type OrientationSwitch: Unchanged=unchanged, Switched=reversed, Horizontal=horizontal, Vertical=vertical.",
    "Instanziiert nach einer Pfadangabe aus einer dynamisch geladenen, externen dll ein Objekt vom Typ DynamicUserControlBase.": "Instantiates an object of type DynamicUserControlBase after a path specification from a dynamically loaded, external dll.",
    "Ist nicht implementiert.": "Is not implemented.",
    "Übersetzt eine Knoten-Zustand (Enum) in ein Bild.": "Translates a node state (enum) into an image.",
    "Wandelt einen VisualNodeWorkerState in Text: none: &quot; &quot;, Valid: &quot;W&quot;, Invalid: &quot;X&quot;.": "Converts a VisualNodeWorkerState to text: none: &quot; &quot;, Valid: &quot;W&quot;, Invalid: &quot;X&quot;.",
    "Haupt-Verarbeitungslogik von Vishnu": "Main processing logic of Vishnu",
    "Provider für Vishnu-Jobs": "Provider for Vishnu jobs",
    "Allgemeine Routinen zur Anwendungssteuerung": "General routines for application control",
    "Ermittlung von Umgebungsparametern der Applikation": "Determination of environmental parameters of the application",
    "Eigene oder angepasste Controls für die Verwendung in Vishnu": "Own or customized controls for use in Vishnu",
    "Verarbeitungsroutinen für logische Ausdrücke": "Processing routines for logical expressions",
    "Routinen zum Zugriff über das Filesystem": "Routines for access via the file system",
    "ZIP Pack/Unpack-Routinen": "ZIP Pack/Unpack routines",
    "Globale Typen, Konstanten, Klassen und statische Funktionen": "Global types, constants, classes and static functions",
    "Unterstützung zur Nutzung mehrerer Bildschirme": "Support for using multiple screens",
    "Basis-Funktionalitäten für MVVM Anwendungen": "Basic functionalities for MVVM applications",
    "Objekt-Serilalisierung und De-Serialisierung": "Object serialization and de-serialization",
    "Definitionen, Schnittstellen und Klassen, die in Anwender-Elementen zum Tragen kommen": "Definitions, interfaces and classes that are used in user elements",
    "In Vishnu darstellbare UserControls. Enthält die Standard-UserControls von Vishnu.": "UserControls that can be displayed in Vishnu. Contains the standard Vishnu UserControls.",
    "MVVM ViewModel für Vishnu": "MVVM ViewModel for Vishnu",
    "Vishnu Bildschirmoberfläche": "Vishnu screen surface",
    "Hilfsklassen für die WPF-Bildschirmoberfläche von Vishnu": "Auxiliary classes for the WPF screen interface of Vishnu",
    "The requested page was not found": "The requested page was not found",
    "Spezifische Aufrufparameter für die Checker-Dll oder null.": "Specific call parameters for the checker dll or null.",
    "Unveränderte Aufrufparameter für die Checker-Dll oder null. Die OriginalCheckerParameters können im Gegensatz zu den CheckerParameters nicht mehr nachträglich durch ReplaceWildcardsNPathes verändert werden. Da ReplaceWildcardsNPathes u.U.": "Unchanged call parameters for the checker dll or null. In contrast to the CheckerParameters, the OriginalCheckerParameters can no longer be subsequently changed by ReplaceWildcardsNPathes. As ReplaceWildcardsNPathes may be able to",
    "Pfad zur Dll der externen Checker-Routine.": "Path to the dll of the external checker routine.",
    "Der Pfad zum aktuell dynamisch zu ladenden UserControl.": "The path to the UserControl currently to be loaded dynamically.",
    "Liefert ein Result für diesen Knoten.": "Returns a result for this node.",
    "Zeitpunkt des letzten Starts des Knoten.": "Time of the last start of the node.",
    "Der logische Zustand des Knotens.": "The logical state of the node.",
    "Der logische Ausdruck, der durch die referenzierte JobList abgearbeitet wird. Die Variablen entsprechen Checkern (Tree-Blätter bzw. Endknoten).": "The logical expression that is processed by the referenced JobList. The variables correspond to checkers (tree leaves or end nodes).",
    "Der Ergebnis-Zustand des Knotens: None, Done, Fault, Timeout, UserAbort.": "The result state of the node: None, Done, Fault, Timeout, UserAbort.",
    "Zeitpunkt des nächsten Starts des Knotens (wenn bekannt) oder DateTime.MinValue.": "Time of the next start of the node (if known) or DateTime.MinValue.",
    "Info-Text über den nächsten Start des Knotens (wenn bekannt) oder null.": "Info text about the next start of the node (if known) or null.",
    "Id des ursprünglich referenzierten Knotens.": "Id of the originally referenced node.",
    "Name eines ursprünglich referenzierten Knotens oder null.": "Name of an originally referenced node or null.",
    "Pfad des ursprünglich referenzierten Knotens.": "Path of the originally referenced node.",
    "Property für die Fortschrittsberechnung.": "Property for the progress calculation.",
    "Der Verarbeitungszustand des Knotens: None, Waiting, Working, Finished, Busy (= Waiting | Working) oder CanStart (= None|Finished).": "The processing status of the node: None, Waiting, Working, Finished, Busy (= Waiting | Working) or CanStart (= None|Finished).",
    "Dictionary von externen Prüfroutinen für einen jobPackage.Job mit Namen als Key. Wird als Lookup für unaufgelöste JobConnector-Referenzen genutzt.": "Dictionary of external check routines for a jobPackage.job with name as key. Used as a lookup for unresolved JobConnector references.",
    "Der Pfad zu aktuell dynamisch zu ladenden ConstantNodeUserControls.": "The path to ConstantNodeUserControls that are currently to be loaded dynamically.",
    "Bei true ist diese Joblist ein JobController, das heist u.a.: Run resettet den Teilbaum (setzt LastNotNullLogical auf null) und startet den Knoten sofort (nicht nur einen eventuellen Trigger). Default: false.": "If true, this job list is a JobController, which means, among other things: Run resets the subtree (sets LastNotNullLogical to zero) and starts the node immediately (not just a possible trigger). Default: false.",
    "Der externe Job mit logischem Ausdruck und u.a. Dictionary der Worker.": "The external job with logical expression and dictionary of workers.",
    "Der Pfad zu aktuell dynamisch zu ladenden NodeListUserControls.": "The path to the NodeListUserControls currently to be loaded dynamically.",
    "Verzögerung in Millisekunden, bevor ein LogicalCanged-Event weitergegeben wird.": "Delay in milliseconds before a LogicalCanged event is passed on.",
    "Der logische Ausdruck, der durch diese JobList abgearbeitet wird. Die Variablen entsprechen Checker-Knoten.": "The logical expression that is processed by this JobList. The variables correspond to checker nodes.",
    "Die höchste Hierarchietiefe von Unter-JobLists zu dieser JobList. Hat z.B. diese JobList keine untergeordnete JobList, ist MaxSubJobDepth = 0, bei einer Sub-JobList, die wiederum eine Sub-JobList hat, wäre MaxSubJobDepth = 2.": "The highest hierarchy depth of sub-JobLists for this JobList. For example, if this JobList has no subordinate JobList, MaxSubJobDepth = 0; for a sub-JobList that in turn has a sub-JobList, MaxSubJobDepth = 2.",
    "Der Pfad zu aktuell dynamisch zu ladenden SingleNodeUserControls.": "The path to the SingleNodeUserControls currently to be loaded dynamically.",
    "Ein optionaler Trigger, der steuert, wann ein Snapshot des Jobs erstellt werden soll oder null.": "An optional trigger that controls when a snapshot of the job should be created or zero.",
    "Der Pfad zu aktuell dynamisch zu ladenden SnapshotUserControls.": "The path to the SnapshotUserControls currently to be loaded dynamically.",
    "Dictionary von externen Prüfroutinen für eine JobList, die nicht in der LogicalExpression referenziert werden; Checker, die ausschließlich über ValueModifier angesprochen werden.": "Dictionary of external check routines for a JobList that are not referenced in the LogicalExpression; checkers that are addressed exclusively via ValueModifier.",
    "Liste von externen SingleNodes für die TopRootJobList, die in keiner der LogicalExpressions referenziert werden; Nodes, die ausschließlich über NodeConnectoren angesprochen werden.": "List of external SingleNodes for the TopRootJobList that are not referenced in any of the LogicalExpressions; nodes that are addressed exclusively via NodeConnectors.",
    "Der jobPackage.Job.": "The jobPackage.Job.",
    "Der Dateipfad zum gespeicherten Job.": "The file path to the saved job.",
    "Der logische Name des Jobs.": "The logical name of the job.",
    "Ein Job kann u.U. schon ein eindeutiges logisches Ergebnis haben, bevor alle Kinder ihre Verarbeitung beendet haben. Bei BreakWithResult=True werden diese dann abgebochen. Greift nicht, wenn ein JobTrigger gesetzt wurde.": "A job may already have a clear logical result before all children have finished their processing. If BreakWithResult=True, these are then canceled. Does not apply if a JobTrigger has been set.",
    "Liste von externen Prüfroutinen für einen jobPackage.Job.": "List of external check routines for a jobPackage.Job.",
    "Pfad zum dynamisch zu ladenden UserControl für eine Constant-SingleNode.": "Path to the UserControl to be loaded dynamically for a Constant-SingleNode.",
    "Liste von internen Triggern für einen jobPackage.Job.": "List of internal triggers for a jobPackage.Job.",
    "Bei True werden alle Knoten im Tree resettet, wenn dieser Knoten gestartet wird. Kann für Loops in Controlled-Jobs verwendet werden.": "If true, all nodes in the tree are reset when this node is started. Can be used for loops in controlled jobs.",
    "True, wenn dieser Snapshot nicht geladen werden konnte und stattdessen der Default-Snapshot geladen wurde.": "True if this snapshot could not be loaded and the default snapshot was loaded instead.",
    "Bei true wird dieser Knoten als Referenzknoten angelegt, wenn irgendwo im Tree (nicht nur im aktuellen Job) der Name des Knotens schon gefunden wurde. Bei false wird nur im aktuellen Job nach gleichnamigen Knoten gesucht. Default: false.": "If true, this node is created as a reference node if the name of the node has already been found somewhere in the tree (not just in the current job). If false, the system only searches for nodes with the same name in the current job. Default: false.",
    "Bei True wird zur Ergebnisermittlung im Tree &quot;Logical&quot; benutzt, bei False &quot;LastNotNullLogical&quot;.": "If True, &quot;Logical&quot; is used to determine the result in the tree; if False, &quot;LastNotNullLogical&quot; is used.",
    "Pfad zum dynamisch zu ladenden UserControl für einen JobConnector.": "Path to the UserControl to be loaded dynamically for a JobConnector.",
    "Pfad zum dynamisch zu ladenden UserControl für eine JobList.": "Path to the UserControl to be loaded dynamically for a JobList.",
    "Ein optionaler Logger, der dem Job zugeordnet ist oder null.": "An optional logger that is assigned to the job or null.",
    "Ein optionaler Trigger, der den Job wiederholt aufruft oder null (setzt intern BreakWithResult auf false).": "An optional trigger that calls the job repeatedly or null (internally sets BreakWithResult to false).",
    "Optionaler zum globalen Sperren verwendeter Name. Wird verwendet, wenn ThreadLocked gesetzt ist.": "Optional name used for global locking. Is used if ThreadLocked is set.",
    "Liste von externen Loggern für einen jobPackage.Job.": "List of external loggers for a jobPackage.Job.",
    "Der logische Ausdruck, der durch eine JobList im LogicalTaskTree abgearbeitet wird.": "The logical expression that is processed by a JobList in the LogicalTaskTree.",
    "Die größte Hierarchie-Tiefe von Sub-Jobs dieses Jobs. Hat dieser Job z.B. einen Sub-Job, ist der Wert 1. Hat der Sub-Job wiederum einen Sub-Job, dann 2 usw., ansonsten 0.": "The greatest hierarchy depth of sub-jobs of this job. For example, if this job has a sub-job, the value is 1. If the sub-job in turn has a sub-job, then 2 etc., otherwise 0.",
    "Pfad zum dynamisch zu ladenden UserControl für eine NodeList.": "Path to the UserControl to be loaded dynamically for a NodeList.",
    "Pfad zum dynamisch zu ladenden UserControl für eine SingleNode.": "Path to the UserControl to be loaded dynamically for a SingleNode.",
    "Liste von Snapshot-Namen für einen jobPackage.Job.": "List of snapshot names for a jobPackage.Job.",
    "Bei True wird der Job beim Start zusammengeklappt angezeigt, wenn die UI dies unterstützt.": "With True, the job is displayed collapsed at startup if the UI supports this.",
    "Bei True wird jeder Thread über die Klasse gesperrt, so dass nicht Thread-sichere Checker serialisiert werden; Default: False;": "If True, each thread is locked via the class so that non-thread-safe checkers are serialized; default: False;",
    "Verzögert den Start eines Knotens (und InitNodes). Kann für Loops in Controlled-Jobs verwendet werden. Default: 0 (Millisekunden).": "Delays the start of a node (and InitNodes). Can be used for loops in Controlled jobs. Default: 0 (milliseconds).",
    "Liste von externen Triggern für einen jobPackage.Job.": "List of external triggers for a jobPackage.Job.",
    "True, wenn dieser Snapshot geladen werden und vorher der Default-Snapshot geladen wurde.": "True if this snapshot is loaded and the default snapshot was previously loaded.",
    "Liste von externen Arbeitsroutinen für einen jobPackage.Job. Ist ein Dictionary mit WorkerShell-Arrays zu aus Knoten-Id + &quot;:&quot; + TreeEvents-String gebildeten Keys.": "List of external work routines for a jobPackage.job. Is a dictionary with WorkerShell arrays for keys formed from node ID + &quot;:&quot; + TreeEvents string.",
    "Liste von externen Arbeitsroutinen für einen jobPackage.Job.": "List of external work routines for a jobPackage.Job.",
    "String mit durch '|' separierten Logging-Event-Namen.": "String with logging event names separated by '|'.",
    "String mit zusätzlichen Logger-Parametern.": "String with additional logger parameters.",
    "Ein Teilbaum kann u.U. schon ein eindeutiges logisches Ergebnis haben, bevor alle Kinder ihre Verarbeitung beendet haben. Bei BreakWithResult=True werden diese dann abgebochen, wenn in dem bereffenden Ast keine Trigger aktiv sind.": "A subtree may already have a clear logical result before all children have finished their processing. If BreakWithResult=True, these are then broken off if no triggers are active in the relevant branch.",
    "Gibt an, ob ein (Teil-)Baum gestartet werden kann, d.h. dass bei einem Knoten mit Kindern alle seine Kinder (rekursiv) gestartet werden können oder bei einem Endknoten (Checker) ohne Kinder dieser selbst gestartet werden kann.": "Specifies whether a (sub-)tree can be started, i.e. that in the case of a node with children, all its children can be started (recursively) or in the case of an end node (checker) without children, this node itself can be started.",
    "Bei True können zusätzliche Testausgaben erfolgen. Default: False.": "If True, additional test outputs can take place. Default: False.",
    "Die eindeutige Kennung des Knotens.": "The unique identifier of the node.",
    "Die eindeutige Kennung des Knotens (identisch zur Property Id).": "The unique identifier of the node (identical to the property Id).",
    "Auf eine durch '/' getrennte Kette von Ids reduzierter Pfad zum Knoten.": "Path to the node reduced to a chain of Ids separated by '/'.",
    "Bei True werden alle Knoten im Tree resettet, wenn dieser Knoten gestartet wird. Kann für Loops in Controlled-Jobs verwendet werden. Default: false.": "If true, all nodes in the tree are reset when this node is started. Can be used for loops in controlled jobs. Default: false.",
    "Bei true befindet sich der Teilbaum/Knoten in aktivem (gestartetem) Zustand.": "If true, the subtree/node is in an active (started) state.",
    "Returns true, wenn gerade eine vom User definierte Ruhezeit für Vishnu-Akteure (Checker) läuft.": "Returns true if a user-defined rest period for Vishnu actors (checkers) is currently running.",
    "Bei True befindet sich diese LogicalNode innerhalb eines Snapshots.": "With True, this LogicalNode is located within a snapshot.",
    "Bei True dient dieser Knoten nur zur Anzeige und lässt keine weiteren Funktionen zu.": "With True, this node is only used for display and does not allow any other functions.",
    "Das letzte auslösende TreeEvent (bei TreeEvent-getriggerten Knoten) oder null.": "The last triggering TreeEvent (for TreeEvent-triggered nodes) or null.",
    "Der letzte logische Zustand eines Knotens. Für den Zugriff auf Zustände von Child-Knoten, ohne dort die Ermittlung der Zustände erneut anzustoßen. Senkt die Prozessorlast.": "The last logical state of a node. For accessing the states of child nodes without re-initiating the determination of the states there. Reduces the processor load.",
    "Der letzte Ergebniszustand eines Knotens. Für den Zugriff auf Zustände von Child-Knoten, ohne dort die Ermittlung der Zustände erneut anzustoßen. Senkt die Prozessorlast.": "The last result state of a node. For accessing the states of child nodes without re-initiating the determination of the states there. Reduces the processor load.",
    "Merkfeld für den letzten Zustand von Logical, der nicht null war; wird benötigt, damit Worker nur dann gestartet werden, wenn sich der Zustand von Logical signifikant geändert hat und nicht jedesmal, wenn der Checker arbeitet (Logical = null).": "Flag field for the last state of Logical that was not null; is required so that workers are only started if the state of Logical has changed significantly and not every time the checker works (Logical = null).",
    "Result für diesen Knoten.": "Result for this node.",
    "Der letzte Verarbeitungszustand eines Knotens. Für den Zugriff auf Zustände von Child-Knoten, ohne dort die Ermittlung der Zustände erneut anzustoßen. Senkt die Prozessorlast.": "The last processing state of a node. For accessing the states of child nodes without re-initiating the determination of the states there. Reduces the processor load.",
    "Die Hierarchie-Ebene des Knotens.": "The hierarchy level of the node.",
    "Die Hierarchie-Ebene des Knotens (identisch zur Property Level).": "The hierarchy level of the node (identical to the property level).",
    "Ein optionaler Logger, der bei bestimmten Ereignissen aufgerufen wird oder null.": "An optional logger that is called when certain events occur or null.",
    "Der logische Zustand eines Knotens; hierum geht es letztendlich in der gesamten Verarbeitung.": "The logical state of a node; this is ultimately what all processing is about.",
    "Der Ergebnis-Zustand des Knotens: None, Start, Done, Fault, Timeout, UserAbort.": "The result state of the node: None, Start, Done, Fault, Timeout, UserAbort.",
    "&quot;Menschenfreundliche&quot; Darstellung des Knotens.": "&quot;Human-friendly&quot; representation of the node.",
    "Kombination aus Name und Id des Knotens.": "Combination of name and Id of the node.",
    "Der Knotentyp: None, NodeConnector, ValueModifier, JobConnector, Constant, Checker, NodeList, JobList, Snapshot.": "The node type: None, NodeConnector, ValueModifier, JobConnector, Constant, Checker, NodeList, JobList, Snapshot.",
    "Das Parent-Control, in dem dieser Knoten dargestellt wird.": "The parent control in which this node is displayed.",
    "Der Pfad zum Knoten bestehend aus einer durch '/' getrennte Kette von NameIds: NameId ist Name + &quot;(&quot; + Id + &quot;)&quot; bei Knoten mit Name != null, nur Id bei Name = null.": "The path to the node consisting of a chain of NameIds separated by '/': NameId is Name + &quot;(&quot; + Id + &quot;)&quot; for nodes with Name != null, only Id for Name = null.",
    "Der Pfad zum Knoten (identisch zur Property Path).": "The path to the node (identical to the Path property).",
    "Id eines ursprünglich referenzierten Knotens oder null.": "Id of an originally referenced node or null.",
    "Pfad eines ursprünglich referenzierten Knotens oder null.": "Path of an originally referenced node or null.",
    "Anzahl der SingleNodes (letztendlich Checker) am Ende eines (Teil-)Baums.": "Number of SingleNodes (ultimately checkers) at the end of a (sub)tree.",
    "Prozentwert für den Anteil der beendeten SingleNodes (letztendlich Checker) am Ende eines (Teil-)Baums.": "Percentage value for the proportion of completed SingleNodes (ultimately checkers) at the end of a (sub)tree.",
    "Der Beginn einer möglichen Ruhezeit.": "The beginning of a possible rest period.",
    "Das Ende einer möglichen Ruhezeit.": "The end of a possible rest period.",
    "Der Verarbeitungszustand eines Knotens: None, Waiting, Working, Finished, Triggered, Ready (= Finished | Triggered), CanStart (= None|Ready), Busy (= Waiting | Working).": "The processing state of a node: None, Waiting, Working, Finished, Triggered, Ready (= Finished | Triggered), CanStart (= None|Ready), Busy (= Waiting | Working).",
    "Zusätzliche Parameter, einige, die für den gesamten Tree Gültigkeit haben und einige knotenspezifische Parameter oder null.": "Additional parameters, some that are valid for the entire tree and some node-specific parameters or null.",
    "Ein optionaler Trigger, der den Job wiederholt aufruft oder null (setzt intern BreakWithResult außer Kraft).": "An optional trigger that calls the job repeatedly or null (internally overrides BreakWithResult).",
    "Der Knotentyp: None, NodeConnector, ValueModifier, Constant, Checker.": "The node type: None, NodeConnector, ValueModifier, Constant, Checker.",
    "Ein Sammelstatus für alle zugeordneten Worker.": "A collective status for all assigned workers.",
    "Liefert die RootJobList des LogicalTaskTrees inklusive Setter.": "Returns the RootJobList of the LogicalTaskTree including setter.",
    "Zusätzliche Parameter, die für den gesamten Tree Gültigkeit haben oder null.": "Additional parameters that are valid for the entire tree or null.",
    "Ein optionaler Logger, der vom Knoten aufgerufen wird oder null. Wird vom IJobProvider bei der Instanziierung mitgegeben.": "An optional logger that is called by the node or null. Is provided by the IJobProvider during instantiation.",
    "Ein optionaler Trigger, der den Job wiederholt aufruft oder null (setzt intern BreakWithResult auf false). Wird vom IJobProvider bei der Instanziierung mitgegeben.": "An optional trigger that calls the job repeatedly or null (internally sets BreakWithResult to false). Is provided by the IJobProvider during instantiation.",
    "Bei True wird nach erfolgreichem globalen Locking kein weiterer Startversuch unternommen und das Locking aufgehoben.": "With True, no further start attempt is made after successful global locking and the lock is released.",
    "Das zuletzt zurückgegebene Ergebnis.": "The last result returned.",
    "Rückgabe-Objekt des Checkers, kann null sein.": "Return object of the checker, can be null.",
    "Der Arbeitsprozess - hier wird mit der Welt kommuniziert, externe Prozesse gestartet oder beobachtet.": "The work process - this is where communication with the world takes place and external processes are started or observed.",
    "Das letzte Verarbeitungsergebnis für diesen Knoten.": "The last processing result for this node.",
    "Anzahl Kinder mit Ergebnis=True.": "Number of children with result=True.",
    "Anzahl Kinder mit Ergebnis.": "Number of children with result.",
    "Anzahl beendete Kinder.": "Number of terminated children.",
    "Bei True wird zur Ergebnisermittlung im Tree Logical benutzt, bei False LastNotNullLogical; Default: false.": "If True, Logical is used to determine the result in the tree; if False, LastNotNullLogical is used; default: false.",
    "Der Pfad zu aktuell dynamisch zu ladenden JobListUserControls.": "The path to the JobListUserControls currently to be loaded dynamically.",
    "Die letzte Anzahl mit True beendeter Kinder eines Knotens. Für den Zugriff auf Zustände von Child-Knoten, ohne dort die Ermittlung der Zustände erneut anzustoßen. Senkt die Prozessorlast.": "The last number of children of a node that ended with True. For accessing the states of child nodes without re-initiating the determination of the states there. Reduces the processor load.",
    "Die letzte Anzahl beendeter Kinder eines Knotens mit Ergebnis True oder False. Für den Zugriff auf Zustände von Child-Knoten, ohne dort die Ermittlung der Zustände erneut anzustoßen. Senkt die Prozessorlast.": "The last number of completed children of a node with the result True or False. For accessing the states of child nodes without re-initiating the determination of the states there. Reduces the processor load.",
    "Die letzte Anzahl beendeter Kinder eines Knotens. Für den Zugriff auf Zustände von Child-Knoten, ohne dort die Ermittlung der Zustände erneut anzustoßen. Senkt die Prozessorlast.": "The last number of completed children of a node. For accessing the states of child nodes without re-initiating the determination of the states there. Reduces the processor load.",
    "Die letzte Anzahl Endknoten-Kinder eines Knotens. Für den Zugriff auf Zustände von Child-Knoten, ohne dort die Ermittlung der Zustände erneut anzustoßen. Senkt die Prozessorlast.": "The last number of end node children of a node. For accessing the states of child nodes without re-initiating the determination of the states there. Reduces the processor load.",
    "Der logische Zustand eines Knotens.": "The logical state of a node.",
    "Der Ergebnis-Zustand eines Knotens. In einer NodeList wird dieser bei jeder Anfrage on the fly rekursiv ermittelt.": "The result state of a node. In a NodeList, this is determined recursively on the fly for each request.",
    "Schranke für die Ermittlung der Property 'Logical', Details .": "Boundary for determining the 'Logical' property, Details .",
    "Anzahl der logisch verknüpften Elemente (SingleNodes oder Teilbäume) auf der Ebene dieser NodeList.": "Number of logically linked elements (SingleNodes or subtrees) at the level of this NodeList.",
    "Anzahl der SingleNodes (letztendlich Checker) am Ende eines (Teil-)Baums; Achtung: dieser Wert ist, ebenso wie SingleNodesFinished, verhundertfacht ().": "Number of SingleNodes (ultimately checkers) at the end of a (sub)tree; note: this value, like SingleNodesFinished, is multiplied by a factor of one hundred ().",
    "Prozentwert für den Anteil der beendeten SingleNodes (letztendlich Checker) am Ende eines (Teil-)Baums. In einer NodeList wird dieser bei jeder Anfrage on the fly rekursiv ermittelt. Achtung: dieser Wert ist, ebenso wie SingleNodes, verhundertfacht ().": "Percentage value for the proportion of completed SingleNodes (ultimately checkers) at the end of a (sub)tree. In a NodeList, this is determined recursively on the fly for each request. Please note: this value, like SingleNodes, is multiplied by a factor of one hundred ().",
    "Der Verarbeitungszustand eines Knotens. In einer NodeList wird dieser bei jeder Anfrage on the fly rekursiv ermittelt.": "The processing state of a node. In a NodeList, this is determined recursively on the fly for each request.",
    "Enthält Komma-separiert TreeParams.Name und IdInfo der Knoten, in deren Events sich dieser NodeParent eingehängt hat oder den Text &quot;NULL&quot;.": "Contains comma-separated TreeParams.Name and IdInfo of the nodes in whose events this NodeParent has attached itself or the text &quot;NULL&quot;.",
    "Die letzte Anzahl beendeter Endknoten-Kinder eines Knotens. Für den Zugriff auf Zustände von Child-Knoten, ohne dort die Ermittlung der Zustände erneut anzustoßen. Senkt die Prozessorlast.": "The last number of terminated end node children of a node. For accessing the states of child nodes without re-initiating the determination of the states there. Reduces the processor load.",
    "Dll mit der Instanz von ICanRun. Wenn vorhanden, wird CanRun vor jedem Start eines Knotens aufgerufen. Liefert CanRun false zurück, wir der Start abgebrochen. In CanRun können darüber hinaus die per ref übergebenen Parameter noch modifiziert werden.": "Dll with the instance of ICanRun. If available, CanRun is called before each start of a node. If CanRun returns false, the start is aborted. The parameters passed via ref can also be modified in CanRun.",
    "Pfad zu einer optionalen Dll, die eine ICanRun-Instanz zur Verfügung stellt. Wenn vorhanden, wird vor jedem Run des zugehörigen Checkers oder Workers CanRun aufgerufen. Liefert CanRun false zurück, wird der Start abgebrochen.": "Path to an optional dll that provides an ICanRun instance. If available, CanRun is called before each run of the associated checker or worker. If CanRun returns false, the start is aborted.",
    "Anzahl Endknoten eines Teilbaumes, hier immer = 100. Normalerweise kann hier nur die 1 (für eine SingleNode) zurückgegeben werden, durch die Verhundertfachung wird aber eine granulare Fortschrittsmeldung für einen Knoten ermöglicht.": "Number of end nodes of a subtree, here always = 100. Normally, only 1 (for a SingleNode) can be returned here, but the hundredfold increase enables a granular progress report for a node.",
    "Verarbeitungsfortschritt in Prozent.": "Processing progress in percent.",
    "Der Verarbeitungszustand des Knotens: Null, None, Waiting, Working, Finished, Triggered, Ready (= Finished | Triggered), Busy (= Waiting | Working) oder CanStart (= None | Ready).": "The processing status of the node: Null, None, Waiting, Working, Finished, Triggered, Ready (= Finished | Triggered), Busy (= Waiting | Working) or CanStart (= None | Ready).",
    "Die XML-Datei, aus der dieser Snapshot erstellt wurde.": "The XML file from which this snapshot was created.",
    "Der Zeitpunkt, zu dem dieser Snapshot erstellt wurde.": "The time at which this snapshot was created.",
    "True, wenn dieser Snapshot geladen wird und vorher der Default-Snapshot geladen wurde.": "True if this snapshot is loaded and the default snapshot was previously loaded.",
    "Enthält Informationen zum besitzenden Trigger. Implementiert sind NextRun und NextRunInfo. Für das Hinzufügen weiterer Informationen kann diese Klasse abgeleitet werden.": "Contains information about the owning trigger. NextRun and NextRunInfo are implemented. This class can be derived to add further information.",
    "Ein normalisierter String mit durch '|' getrennten internen Event-Namen.": "A normalized string with internal event names separated by '|'.",
    "Ersetzt das Starten und Stoppen bei internen Triggern.": "Replaces starting and stopping with internal triggers.",
    "Das letzte aufgetretene TreeEvent für diesen Trigger oder null.": "The last TreeEvent that occurred for this trigger or null.",
    "Id des Knotens, der von dem Event getriggert wird (nicht des Knotens, der das Event auslöst).": "Id of the node that is triggered by the event (not the node that triggers the event).",
    "Enthält den Namen des referenzierten Originalknotens.": "Contains the name of the referenced original node.",
    "True, wenn die TriggerShell einen TreeEventTrigger kapselt.": "True if the TriggerShell encapsulates a TreeEventTrigger.",
    "Enthält Informationen zum besitzenden Trigger. Implementiert sind NextRun und NextRunInfo. Für das Hinzufügen weiterer Informationen kann die Klasse TriggerInfo abgeleitet werden.": "Contains information about the owning trigger. NextRun and NextRunInfo are implemented. The TriggerInfo class can be derived to add further information.",
    "Result für diesen Knoten. Wirft hier eine NotImplementedException.": "Result for this node. Throws a NotImplementedException here.",
    "Der logische Zustand eines Knotens; hierum geht es letztendlich in der gesamten Verarbeitung. Wirft hier eine NotImplementedException.": "The logical state of a node; this is ultimately what the entire processing is about. Throws a NotImplementedException here.",
    "Anzahl der SingleNodes (letztendlich Checker) am Ende eines (Teil-)Baums. Wirft hier eine NotImplementedException.": "Number of SingleNodes (ultimately checkers) at the end of a (sub)tree. Throws a NotImplementedException here.",
    "Prozentwert für den Anteil der beendeten SingleNodes (letztendlich Checker) am Ende eines (Teil-)Baums. Wirft hier eine NotImplementedException.": "Percentage value for the proportion of completed SingleNodes (ultimately checkers) at the end of a (sub)tree. Throws a NotImplementedException here.",
    "Der Verarbeitungszustand eines Knotens: None, Waiting, Working, Finished, Triggered, Ready (= Finished | Triggered), CanStart (= None|Ready), Busy (= Waiting | Working). Wirft hier eine NotImplementedException.": "The processing state of a node: None, Waiting, Working, Finished, Triggered, Ready (= Finished | Triggered), CanStart (= None|Ready), Busy (= Waiting | Working). Throws a NotImplementedException here.",
    "Der Pfad zum aktuell dynamisch zu ladenden UserControl. Wirft hier eine NotImplementedException.": "The path to the UserControl currently to be loaded dynamically. Throws a NotImplementedException here.",
    "Referenz auf eine ausführende NodeCheckerBase.": "Reference to an executing NodeCheckerBase.",
    "Formatierungs-String.": "Formatting string.",
    "Ausführender Checker oder ValueModifier.": "Executing Checker or ValueModifier.",
    "Das modifizierte ReturnObject des zugeordneten INodeCheckers.": "The modified ReturnObject of the assigned INodeChecker.",
    "Pfad zum externen ValueModifier.": "Path to the external ValueModifier.",
    "Die bei Änderung des Zustands von Logical aufzurufende Exe.": "The exe. to be called when the state of Logical changes.",
    "Bei True werden die Parameter über eine XML-Datei übergeben, ansonsten über die Kommandozeile; Default: false.": "If true, the parameters are transferred via an XML file, otherwise via the command line; default: false.",
    "Ein optionaler Trigger, der den Job wiederholt aufruft oder null. Wird vom IJobProvider bei der Instanziierung mitgegeben.": "An optional trigger that calls the job repeatedly or null. Is specified by the IJobProvider during instantiation.",
    "Zustand des Workers. None, Valid, Invalid.": "Status of the worker. None, Valid, Invalid.",
    "Liefert die Keys von Workers.": "Returns the keys from Workers.",
    "Liefert die Values von Workers.": "Returns the values of Workers.",
    "Contans an optional exception of the executed thread.": "Contans an optional exception of the executed thread.",
    "Contains the current culture.": "Contains the current culture.",
    "Contains the current principal or null.": "Contains the current principal or null.",
    "Leads to the CurrentThread.": "Leads to the CurrentThread.",
    "Contains the current ui-culture.": "Contains the current ui-culture.",
    "Leads to Thread.ExecutionContext.": "Leads to Thread.ExecutionContext.",
    "Returns true if the thread has been started and is not dead.": "Returns true if the thread has been started and is not dead.",
    "Return whether or not this thread is a background thread. Background threads do not affect when the Execution Engine shuts down.": "Return whether or not this thread is a background thread. Background threads do not affect when the Execution Engine shuts down.",
    "Returns true if the thread is a threadpool thread.": "Returns true if the thread is a threadpool thread.",
    "Leads to the extern int thread-id.": "Leads to the extern int thread-id.",
    "Contains the thread-name or null.": "Contains the thread-name or null.",
    "Returns the priority of the thread.": "Returns the priority of the thread.",
    "Return the thread state as a consistent set of bits. This is more general then IsAlive or IsBackground.": "Return the thread state as a consistent set of bits. This is more general then IsAlive or IsBackground.",
    "Der InfoType der Message, z.B.: InfoType.Error.": "The InfoType of the message, e.g.: InfoType.Error.",
    "Konvertiert einen InfoType in sein String-Äquivalent, also z.B.: InfoType.Error in &quot;ERROR&quot;.": "Converts an InfoType into its string equivalent, e.g.: InfoType.Error to &quot;ERROR&quot;.",
    "Das Message-Objekt": "The message object",
    "Informationen zum aktuellen Thread.": "Information on the current thread.",
    "Der Timestamp der Message im Format '31.01.2009 12:22:36'.": "The timestamp of the message in the format '31.01.2009 12:22:36'.",
    "Maximale Anzahl von archivierten Logs (DebugFiles, o.ä.). Bei Überzahl werden jeweils die ältesten gelöscht. Default: 0 (entspricht unendlich vielen).": "Maximum number of archived logs (debug files, etc.). If there are too many, the oldest ones are deleted. Default: 0 (corresponds to an infinite number).",
    "Zeitabstand, in dem das aktuelle Logging (DebugFile, o.ä.) archiviert und geleert wird. Muss von außen gesetzt werden. Default: TimeSpan.Zero.": "Time interval at which the current logging (DebugFile, etc.) is archived and emptied. Must be set externally. Default: TimeSpan.Zero.",
    "Bei True ist die Logging-Ausgabe zeitgesteuert. LoggingTriggerCounter gibt dann die Anzahl Millisekunden bis zum nächsten Trigger-Event vor. Bei False wird die Ausgabe durch die Gesamtzahl Zählvorgänge gesteuert.": "If True, the logging output is time-controlled. LoggingTriggerCounter then specifies the number of milliseconds until the next trigger event. If False, the output is controlled by the total number of counting processes.",
    "Anzahl Millisekunden oder Anzahl Zählvorgänge bis zur nächsten Logging-Ausgabe; Default: 5000.": "Number of milliseconds or number of counts until the next logging output; default: 5000.",
    "Ziel-Pfad, z.B. bei Text-Logs Name und Pfad des Logfiles.": "Target path, e.g. for text logs, name and path of the log file.",
    "Maximale Anzahl Zeilen, die ein MessageBuffer aufnehmen kann, bevor er zwangsweise geflusht wird. Diese Einstellung wirkt auch bei Timer-gesteuerten Logging. Default: 10000.": "Maximum number of lines that a MessageBuffer can hold before it is forcibly flushed. This setting is also effective for timer-controlled logging. Default: 10000.",
    "Bei True werden Messages unverändert ausgegeben; wegen der Asynchronität des Message-Handlings kann es hier zu Reihenfolge-Vertauschungen kommen.": "If True, messages are output unchanged; due to the asynchronous nature of message handling, the order may be reversed.",
    "Einrückung der Folgezeilen bei mehrzeiligen Messages. Default: 4.": "Indentation of subsequent lines for multi-line messages. Default: 4.",
    "Bei True ist die Statistik-Ausgabe zeitgesteuert. LoggingTriggerCounter gibt dann die Anzahl Millisekunden bis zum nächsten Trigger-Event vor. Bei False wird die Statistik-Ausgabe durch die Gesamtzahl Zählvorgänge gesteuert.": "If True, the statistics output is time-controlled. LoggingTriggerCounter then specifies the number of milliseconds until the next trigger event. If False, the statistics output is controlled by the total number of counting processes.",
    "Anzahl Millisekunden oder Anzahl Zählvorgänge bis zur nächsten Statistik-Ausgabe; Default: 5000.": "Number of milliseconds or number of counting processes until the next statistics output; default: 5000.",
    "Nur Zeilen, die diesen regulären Ausdruck erfüllen, werden geloggt.": "Only lines that fulfill this regular expression are logged.",
    "Aktueller Zustand des TaskWorkers: Ready, Running oder Halted.": "Current status of the TaskWorker: Ready, Running or Halted.",
    "Liefert einen beschreibenden Namen dieses StringValueGetters, z.B. Name plus ggf. Quellpfad.": "Returns a descriptive name of this StringValueGetter, e.g. name plus source path if applicable.",
    "Pfad einer XML-Datei im Format der app.config mit User-spezifischen Einstellungen.": "Path of an XML file in the format of app.config with user-specific settings.",
    "Info-Text mit erweiterten Status-Informationen zum Ladeversuch der AppConfigUser.": "Info text with extended status information on the AppConfigUser loading attempt.",
    "True wenn eine XML-Datei im Format der app.config mit User-spezifischen Einstellungen geladen werden konnte.": "True if an XML file in the format of app.config with user-specific settings could be loaded.",
    "Implementiert IGetStringValue zur Kapselung von Zugriffen über konkrete Reader wie zum Beispiel CommandLineAccess, SettingsAccess, EnvAccess.": "Implements IGetStringValue to encapsulate access via concrete readers such as CommandLineAccess, SettingsAccess, EnvAccess.",
    "Application.": "Application.",
    "Das Verzeichnis, in dem die Applikation gestartet wurde als absoluter Pfad.": "The directory in which the application was started as an absolute path.",
    "Wenn true, kann immer abgebrochen werden - zu Debug-Zwecken.": "If true, can always be canceled - for debugging purposes.",
    "Kann ggf. bei einer spätere Versionsprüfung genutzt werden.": "Can be used for a later version check if necessary.",
    "Verzeichnis, in dem die Installationsdaten bei einer ClickOnce-Installation (EnvAccess:ISNETWORKDEPLOYED = true) liegen.": "Directory in which the installation data is located for a ClickOnce installation (EnvAccess:ISNETWORKDEPLOYED = true).",
    "Implementiert IGetStringValue für Zugriffe auf die Kommandozeile.": "Implements IGetStringValue for accessing the command line.",
    "Connection-String für eine Datenbank-Verbindung.": "Connection string for a database connection.",
    "Enthält den Pfad des untersten Verzeichnisses, das beim letzten &quot;Directory.Create&quot; neu angelegt wurde.": "Contains the path of the lowest directory that was created during the last &quot;Directory.Create&quot;.",
    "Bei True wird das aktuell gesetzte WorkingDirectory angelegt, wenn es noch nicht existiert.": "If True, the currently set WorkingDirectory is created if it does not yet exist.",
    "Der angepasste Datenbank-Server Instanz-Name.": "The customized database server instance name.",
    "Maximale Anzahl von archivierten Logs (DebugFiles, o.ä.). Bei Überzahl werden jeweils die ältesten gelöscht. Default: 20.": "Maximum number of archived logs (debug files, etc.). If there are too many, the oldest ones are deleted. Default: 20.",
    "Zeitabstand, in dem das aktuelle Log (DebugFile, o.ä.) archiviert und geleert wird. Default: 24 Stunden.": "Time interval at which the current log (DebugFile, etc.) is archived and emptied. Default: 24 hours.",
    "Pfad und Name des Logfiles Default: WorkingDirectory + \\ + ApplicationName + .": "Path and name of the log file Default: WorkingDirectory + \\ + ApplicationName + .",
    "Filter, der die zu loggenden Zeilen begrenzt. Default: &quot;&quot; - alles wird geloggt.": "Filter that limits the lines to be logged. Default: &quot;&quot; - everything is logged.",
    "Die zu loggenden Informationsarten public enum InfoType { DEBUG, INFO, WARN, MILESTONE, ERROR, EXCEPTION, USERTYPE1, USERTYPE2 }; als String, wie z.B.: &quot;DEBUG|INFO|WARN|MILESTONE|ERROR&quot;. Default: wird im Startprogramm gesetzt, üblicherweise InfoType.": "The types of information to be logged public enum InfoType { DEBUG, INFO, WARN, MILESTONE, ERROR, EXCEPTION, USERTYPE1, USERTYPE2 }; as a string, e.g: &quot;DEBUG|INFO|WARN|MILESTONE|ERROR&quot;. Default: is set in the start program, usually InfoType.",
    "Bei True können Anwendungen Debug-Ausgaben erzeugen. Default: False.": "If True, applications can generate debug outputs. Default: False.",
    "Die voreingestellte Datenbank.": "The default database.",
    "Das Default-Verzeichnis für SQL-Server Datendateien": "The default directory for SQL Server data files",
    "Das Default-Verzeichnis für die SQL-Server Logdateien": "The default directory for the SQL server log files",
    "Bei true gibt BasicAppSettings über den InfoController am Ende der Verarbeitung alle AppSetting-Properties mit Wert und Quelle aus. Default: false.": "If true, BasicAppSettings outputs all AppSetting properties with value and source via the InfoController at the end of processing. Default: false.",
    "Bei true gibt BasicAppSettings über den InfoController am Ende der Verarbeitung die Vollnamen aller in der AppDomain geladenen Assemblies aus. Default: false.": "If true, BasicAppSettings outputs the full names of all assemblies loaded in the AppDomain via the InfoController at the end of processing. Default: false.",
    "Implementiert IGetStringValue für Zugriffe auf das Environment.": "Implements IGetStringValue for accessing the environment.",
    "Die Version des höchsten installierten .": "The version of the highest installed .",
    "Implementiert IGetStringValue für Zugriffe auf INI-Dateien.": "Implements IGetStringValue for accessing INI files.",
    "True, wenn die Anwendung per ClickOnce installiert wurde (siehe auch ClickOnceDataDirectory).": "True if the application was installed via ClickOnce (see also ClickOnceDataDirectory).",
    "True, wenn die Anwendung auf .Net-Framework basiert.": "True if the application is based on .Net framework.",
    "True, wenn die Anwendung auf einem vollständigen .Net-Framework basiert.": "True if the application is based on a complete .Net framework.",
    "True, wenn die Anwendung eine .Net Core-Anwendung ist.": "True if the application is a .Net Core application.",
    "True, wenn die Anwendung eine UWP-Anwendung ist.": "True if the application is a UWP application.",
    "Bei True sollen alle Child-Prozesse der Anwendung am Programmende nach einer gewissen Wartezeit rekursiv terminiert werden. Achtung: BasicAppSettings stellt nur die Property zur Verfügung.": "If True, all child processes of the application should be terminated recursively at the end of the program after a certain waiting time. Attention: BasicAppSettings only provides the property.",
    "Bei True wird das WorkingDirectory am Programmende entfernt. Sollte aus Sicherheitsgründen nur erfolgen, wenn es beim Programmstart auch erzeugt wurde. Das Anlegen oder Löschen des WorkingDirectory erfolgt nicht durch BasicAppSettings sondern kann ggf.": "If True, the WorkingDirectory is removed at the end of the program. For security reasons, this should only be done if it was created when the program was started. The WorkingDirectory is not created or deleted by BasicAppSettings, but can be deleted if necessary.",
    "Wenn true, soll jeder Sql-Befehl in's Logfile geschrieben werden. Zur freien Verwendung.": "If true, every sql command should be written to the log file. For free use.",
    "Der Rechnername": "The computer name",
    "Geforderte Mindestversion für spätere Prüfung gegen die ProgrammVersion. Default: &quot;1.0.0.": "Required minimum version for later checking against the program version. Default: &quot;1.0.0.",
    "Die komplette Betriebssystem-Version": "The complete operating system version",
    "Numerische Haupt-Betriebssystem-Version &gt; 5 =&gt; mindestens Vista": "Numeric main operating system version &gt; 5 =&gt; at least Vista",
    "Die Prozess-Id des aktuellen Prozesses.": "The process ID of the current process.",
    "Der Prozessortyp": "The processor type",
    "Die Anzahl Prozessoren": "The number of processors",
    "Die aktuelle ProgrammVersion = Application.": "The current program version = Application.",
    "Implementiert IGetStringValue für Zugriffe auf public Properties der AppSettings.": "Implements IGetStringValue for accessing public properties of the AppSettings.",
    "Implementiert IGetStringValue für Zugriffe auf die Registry.": "Implements IGetStringValue for accessing the registry.",
    "Basis-Pfad, in dem in der Registry nach einer Einstellung gesucht wird. Enthält der Pfad eine der RegistryRoots, z.B. &quot;HKEY_CURRENT_USER&quot;, wird die intern eingestellte RegistryRoot ebenfalls umgestellt.": "Base path in which a setting is searched for in the registry. If the path contains one of the RegistryRoots, e.g. &quot;HKEY_CURRENT_USER&quot;, the internally set RegistryRoot is also changed.",
    "Ein optionales Suchverzeichnis für verschiedene Zwecke.": "An optional search directory for various purposes.",
    "Implementiert IGetStringValue für Zugriffe auf die app.config.": "Implements IGetStringValue for accessing the app.config.",
    "Bei true kann die Applikation nur einmal gestartet werden.": "If true, the application can only be started once.",
    "Pfad und Name des Statistics-Logfiles Default: WorkingDirectory + \\ + ApplicationName + .": "Path and name of the statistics log file Default: WorkingDirectory + \\ + ApplicationName + .",
    "Filter, der die zu loggenden Zeilen begrenzt. Default: &quot;&quot; - alles wird geloggt. z.B.: @&quot;(?:_NOPPES_)&quot; - Nichts wird geloggt, bzw.": "Filter that limits the lines to be logged. Default: &quot;&quot; - everything is logged. e.g: @&quot;(?:_NOPPES_)&quot; - nothing is logged, or",
    "Environment: &quot;TEMP&quot;": "Environment: &quot;TEMP&quot;",
    "Der Windows-Domain-Name": "The Windows domain name",
    "Der Windows-Username": "The Windows user name",
    "Implementiert IGetStringValue für Zugriffe auf die app.config.user.": "Implements IGetStringValue for accessing the app.config.user.",
    "Das Arbeitsverzeichnis Default: Bei &quot;SingleInstance=true: C:\\Users\\&lt;user&gt;\\AppData\\Local\\Temp\\&lt;ApplicationName&gt; Bei &quot;SingleInstance=false: C:\\Users\\&lt;user&gt;\\AppData\\Local\\Temp\\&lt;ApplicationName&gt;\\&lt;ProcessId&gt;": "The working directory Default: If &quot;SingleInstance=true: C:\\Users\\&lt;user&gt;\\AppData\\Local\\Temp\\&lt;ApplicationName&gt; If &quot;SingleInstance=false: C:\\Users\\&lt;user&gt;\\AppData\\Local\\Temp\\&lt;ApplicationName&gt;\\&lt;ProcessId&gt;",
    "True, wenn das WorkingDirectory beim Programmstart erzeugt wurde. Das Anlegen oder Löschen des WorkingDirectory erfolgt nicht durch BasicAppSettings sondern kann ggf. durch die Anwendung oder das Logging erfolgen. Default: false.": "True if the WorkingDirectory was created when the program was started. The WorkingDirectory is not created or deleted by BasicAppSettings, but can be created or deleted by the application or logging. Default: false.",
    "Ersetzt die Kommandozeilen-Argumente.": "Replaces the command line arguments.",
    "Url für die Aktivierung.": "Url for activation.",
    "True, wenn die Anwendung per ClickOnce installiert wurde.": "True if the application was installed via ClickOnce.",
    "RuntimeInformation.FrameworkDescription.": "RuntimeInformation.FrameworkDescription.",
    "Zeitpunkt der letzten Update-Prüfung.": "Time of the last update check.",
    "Qualifizierter Name der aktualisierten Applikation.": "Qualified name of the updated application.",
    "Die neue ProgrammVersion.": "The new program version.",
    "Die Update-Url für das Programm.": "The update url for the program.",
    "aktuell installierte Version.": "currently installed version.",
    "True, wenn ein Update bereitsteht und zwingend erforderlich ist.": "True if an update is available and absolutely necessary.",
    "True, wenn ein Update bereitsteht.": "True when an update is available.",
    "Neueste verfügbare Version.": "Latest available version.",
    "Geforderte Mindestversion.": "Required minimum version.",
    "Liefert die Kommandozeile als einen String.": "Returns the command line as a string.",
    "Umstellung auf .net standard 2.0. Ersetzt die Kommandozeilen-Argumente für ClickOnce-Installationen unter .net standard 2.0.": "Conversion to .net standard 2.0. Replaces the command line arguments for ClickOnce installations under .net standard 2.0.",
    "Die aktuell eingestellte RegistryRoot Default: RegistryRoot.": "The currently set RegistryRoot Default: RegistryRoot.",
    "Enthält alle aus der XmlDatei eingelesenen (Anwendungs-)Einstellungen.": "Contains all (application) settings read in from the xml file.",
    "Der Meldungstext.": "The message text.",
    "Versionsstring.": "Version string.",
    "Holt oder setzt die horizontale Scrollweite in geräteunabhängigen Pixeln. Default: 0.0.": "Gets or sets the horizontal scroll width in device-independent pixels. Default: 0.0.",
    "Returnt True, wenn die horizontale Scrollbar gerade sichtbar ist.": "Returns True if the horizontal scrollbar is currently visible.",
    "Returnt True, wenn die vertikale Scrollbar gerade sichtbar ist.": "Returns True if the vertical scrollbar is currently visible.",
    "Holt oder setzt den minimalen Scale-Faktor. Der minimale Scale Faktor gibt an, wie stark Elemente verkleinert werden können. Dadurch wird indirekt auch die maximale Anzahl Elemente begrenzt, die sich gleichzeitig auf dem Bildschirm befinden können.": "Gets or sets the minimum scale factor. The minimum scale factor specifies how much elements can be reduced in size. This also indirectly limits the maximum number of elements that can be on the screen at the same time.",
    "Holt oder setzt die vertikale Scrollweite in geräteunabhängigen Pixeln. Default: 0.0.": "Gets or sets the vertical scroll width in device-independent pixels. Default: 0.0.",
    "Der ursprünglich übergebene Text-Ausdruck.": "The originally transferred text expression.",
    "Liste von höherwertigen Operatoren mit zugeordneten Unterausdrücken.": "List of high-order operators with assigned sub-expressions.",
    "Liste von Operatoren mit ihren relativen Prioritäten.": "List of operators with their relative priorities.",
    "Liste von jeweils ein oder zwei möglichen Operanden mit jeweils einem zugeordneten Operator.": "List of one or two possible operands, each with an assigned operator.",
    "Liste von jeweils mehrern möglichen Text-Token mit jeweils einem zugeordneten internen Schlüssel.": "List of several possible text tokens, each with an assigned internal key.",
    "Der Name des Knotens.": "The name of the node.",
    "Der Typ des Knotens.": "The type of node.",
    "Dateiname und -Pfad der Datei im Archiv.": null,
    "Bei true handelt es sich um ein Verzeichnis.": "If true, this is a directory.",
    "Timestamp der Datei im Archiv.": "Timestamp of the file in the archive.",
    "Größe der Datei im Archiv.": "Size of the file in the archive.",
    "Liste der Kinder eines Knotens.": "List of the children of a node.",
    "Die äußere Begrenzung des Screens.": "The outer boundary of the screen.",
    "True, wenn der Screen der primäre Bildschirm ist.": "True if the screen is the primary screen.",
    "Der (Device-)Name des Screens.": "The (device) name of the screen.",
    "Die Abmessungen des Screens.": "The dimensions of the screen.",
    "Eine String-List mit Property-Namen für das Event &quot;PropertiesChanged&quot; aus &quot;INotifyPropertiesChanged&quot;.": "A string list with property names for the event &quot;PropertiesChanged&quot; from &quot;INotifyPropertiesChanged&quot;.",
    "Bei True werden Knoten, die nicht auf kooperativen Cancel reagieren (können) durch &quot;Abort()&quot; hart abgebrochen. Immer: false; künftig wegfallend.": "If true, nodes that do not (cannot) react to cooperative cancel are aborted hard by &quot;Abort()&quot;. Always: false; to be dropped in the future.",
    "Wird programmintern als Merkfeld für die aktuellen Bildschirmgrenzen genutzt. Wird von MainWindow.xaml.cs gesetzt.": "Is used internally in the program as a reminder field for the current screen limits. Is set by MainWindow.xaml.cs.",
    "Liste von Verzeichnissen, in denen nach zu ladenden Assemblies gesucht werden soll.": "List of directories in which to search for assemblies to be loaded.",
    "Bei true wird der Tree automatisch gestartet. Default: false.": "If true, the tree is started automatically. Default: false.",
    "Steuert das Verhalten beim UserRun eines Knoten in einem Controlled-Tree, der über ein TreeEvent getriggert wird und dessen Startvoraussetzungen noch nicht erfüllt sind: None: kein Start möglich, Info: kein Start möglich - es erfolgt eine Meldung, Question": "Controls the behavior of the UserRun of a node in a controlled tree that is triggered via a TreeEvent and whose start requirements have not yet been met: None: no start possible, Info: no start possible - a message is displayed, Question",
    "Bei true befindet sich Vishnu im Demo-Modus. Dies ist direkt nach Erstinstallation der Fall. Default: false.": "At true, Vishnu is in demo mode. This is the case immediately after initial installation. Default: false.",
    "Wenn ungleich null, dann sollte die Anwendung die Exception melden und sich beenden.": "If not equal to zero, the application should report the exception and exit.",
    "Kombinierbare Liste von Typen von Knoten des Trees zur Filterung der Knoten in einer flachen Liste von Knoten (FlatNodeViewModelList).": "Combinable list of types of nodes of the tree for filtering the nodes in a flat list of nodes (FlatNodeViewModelList).",
    "Die bevorzugte Vishnu-Hilfe (wird über F1 oder das Kontext-Menü geladen): &quot;online&quot;: die Vishnu-Hilfe wird aus dem Internet geladen (default); &quot;local&quot;: die Vishnu-Hilfe wird als .chm lokal geladen.": "The preferred Vishnu help (loaded via F1 or the context menu): &quot;online&quot;: Vishnu help is loaded from the Internet (default); &quot;local&quot;: Vishnu help is loaded locally as .chm.",
    "Der Dateipfad zum Verzeichnis der lokalen Konfiguration. Default: Pfad zum AppConfigUser-Verzeichnis.": "The file path to the local configuration directory. Default: Path to the AppConfigUser directory.",
    "Bei True werden definierte Worker nicht aufgerufen. Default: false.": "If true, defined workers are not called. Default: false.",
    "Verzeichnis, in dem Snapshots von Knoten abgespeichert werden.": "Directory in which snapshots of nodes are saved.",
    "XML-Name des obersten Jobs. Default: JobDescription.xml.": "XML name of the top job. Default: JobDescription.xml.",
    "Beginn einer vom User definierten Ruhezeit für Vishnu-Akteure (Checker).": "Start of a user-defined rest period for Vishnu actors (checkers).",
    "Ende einer vom User definierten Ruhezeit für Vishnu-Akteure (Checker).": "End of a user-defined rest period for Vishnu actors (checkers).",
    "Vom User definiertes Verzeichnis, in dem Snapshots von Knoten abgespeichert werden. Ist der SnapshotDirectory-Pfad relativ oder leer (i.d.R. nicht sinnvoll), dann ist der SnapshotDirectory-Pfad immer relativ zum Verzeichnis, in dem die JobDescription.": "Directory defined by the user in which snapshots of nodes are saved. If the SnapshotDirectory path is relative or empty (usually not useful), then the SnapshotDirectory path is always relative to the directory in which the JobDescription.",
    "Überlebensdauer eines Snapshots.": "Survival time of a snapshot.",
    "Ausrichtung des Trees beim Start der Anwendung. AlternatingHorizontal: Alternierender Aufbau, waagerecht beginnend (Default). Vertical: Senkrechter Aufbau. Horizontal: Waagerechter Aufbau. AlternatingVertical: Alternierender Aufbau, senkrecht beginnend.": "Alignment of the tree at the start of the application. AlternatingHorizontal: Alternating structure, starting horizontally (default). Vertical: Vertical structure. Horizontal: Horizontal structure. AlternatingVertical: Alternating structure, starting vertically.",
    "Parameter zur Steuerung des Startverhaltens von getriggerten Knoten beim Start durch den Anwender (UserRun): None = kein direkter Start, All = alle getriggerten Knoten innerhalb eines durch UserRun gestarteten (Teil-)Trees starten direkt (wie nicht getrigg": "Parameter for controlling the start behavior of triggered nodes when started by the user (UserRun): None = no direct start, All = all triggered nodes within a (partial) tree started by UserRun start directly (as if not triggered).",
    "Bei True wird mit der Job-Ansicht gestartet, ansonsten mit der Tree-Ansicht (default: false).": "If true, the job view is started, otherwise the tree view is started (default: false).",
    "Liste von INodeChecker-Dll-Namen, die für jeden Run neu geladen werden sollen. Dient zum Debuggen von Memory Leaks, die mutmaßlich durch User-Checker verursacht werden.": "List of INodeChecker dll names that are to be reloaded for each run. Used to debug memory leaks that are presumably caused by user checkers.",
    "Verzeichnis, in dem Job-übergreifende Assemblies des Users abgelegt sind.": "Directory in which the user's cross-job assemblies are stored.",
    "Dateipfad einer optionalen Dll, die IParameterReader implementiert. Wenn vorhanden, wird die Dll dynamisch geladen und erweitert Vishnus Fähigkeiten zur Parameter-Ersetzung in ReplaceWildcards.": "File path of an optional dll that implements IParameterReader. If present, the dll is loaded dynamically and extends Vishnu's parameter replacement capabilities in ReplaceWildcards.",
    "Der Herausgeber der ClickOnce Installation.": "The publisher of the ClickOnce installation.",
    "Das Vishnu-Rootverzeichnis zur Laufzeit.": "The Vishnu root directory at runtime.",
    "VishnuSourceRoot bezeichnet immer das Root-Verzeichnis der Vishnu-Entwicklung.": "VishnuSourceRoot always refers to the root directory of the Vishnu development.",
    "Datenklasse mit wesentlichen Darstellungsmerkmalen des Vishnu-MainWindow.": "Data class with essential display features of the Vishnu MainWindow.",
    "Definiert, ob die Kind-Elemente dieses Knotens horizontal oder vertikal angeordnet werden sollen.": "Defines whether the child elements of this node should be arranged horizontally or vertically.",
    "Die Kennung des zugehörigen LogicalTaskTree-Knotens für die UI verfügbar gemacht.": "The identifier of the associated LogicalTaskTree node is made available for the UI.",
    "True, wenn der TreeView-Knoten, welcher mit diesem Knoten assoziiert ist, ausgeklappt ist.": "True if the TreeView node associated with this node is expanded.",
    "Der Name des zugehörigen LogicalTaskTree-Knotens für die UI verfügbar gemacht.": "The name of the associated LogicalTaskTree node is made available for the UI.",
    "Der eindeutige Pfad des zugehörigen LogicalTaskTree-Knotens.": "The unique path of the associated LogicalTaskTree node.",
    "Rückgabe-Objekt des Checkers.": "Return object of the checker.",
    "Der Pfad zum Knoten.": "The path to the knot.",
    "Das Parent-Control.": "The parent control.",
    "Das ReturnObject der zugeordneten LogicalNode.": "The ReturnObject of the assigned LogicalNode.",
    "Bindung an ein optionales, spezifisches User-ViewModel.": "Binding to an optional, specific user view model.",
    "Eindeutige Kennung des Knotens, zu dem dieses Result gehört.": "Unique identifier of the node to which this result belongs.",
    "Das logische Ergebnis der Verarbeitung des Teilbaums dieses Knotens.": "The logical result of processing the subtree of this node.",
    "Ein eventuelles Rückgabeobjekt des Knoten (Checker).": "A possible return object of the node (checker).",
    "Zeitpunkt der Entstehung des Results.": "Date of creation of the result.",
    "Liste mit Verarbeitungsergebnissen der Vorläufer des Knotens, der das Ereignis meldet.": "List with processing results of the predecessors of the node reporting the event.",
    "Logischer Wert des Knotens, der das Ereignis meldet (true, false oder null).": "Logical value of the node that reports the event (true, false or null).",
    "User-Name des Ereignisses": "User name of the event",
    "Name des Knotens, der das Ereignis meldet.": "Name of the node reporting the event.",
    "Pfad zum Knoten, der das Ereignis meldet.": "Path to the node that reports the event.",
    "Liste mit Verarbeitungsergebnissen des Knotens, der das Ereignis meldet.": "List with processing results of the node reporting the event.",
    "Id des Knotens, der das Ereignis meldet.": "Id of the node reporting the event.",
    "Id des Knotens, in dem das Ereignis auftritt.": "Id of the node in which the event occurs.",
    "Verarbeitungszustand des Knotens, der das Ereignis meldet (None, Start, Done, Fault, Timeout, UserAbort.).": "Processing status of the node reporting the event (None, Start, Done, Fault, Timeout, UserAbort.).",
    "Id des zugehörigen Threads": "Id of the corresponding thread",
    "Datum und Uhrzeit des Ereignisses": "Date and time of the event",
    "Interner, Assembly-übergreifender Parameter. Enthält den LogicalTaskTree als IBusinessLogicRoot, um hier einen direkten Assembly-Verweis auf LogicalTaskTree zu vermeiden. Wird innerhalb der Assembly Vishnu.ViewModel wieder aufgelöst.": "Internal, cross-assembly parameter. Contains the LogicalTaskTree as IBusinessLogicRoot to avoid a direct assembly reference to LogicalTaskTree. Is resolved again within the Vishnu.ViewModel assembly.",
    "Pfad zum Verzeichnis der Checker.dll.": "Path to the Checker.dll directory.",
    "Die absolute Bildschirmposition der Mitte des beinhaltenden Controls.": "The absolute screen position of the center of the containing control.",
    "Name des Trees.": "Name of the tree.",
    "Das zugehörige Control.": "The associated Control.",
    "Interner, Assembly-übergreifender Parameter. Enthält das LogicalTaskTreeViewModel als IViewModelRoot, um hier einen direkten Assembly-Verweis auf Vishnu.ViewModel zu vermeiden. Wird innerhalb der Assembly Vishnu.ViewModel wieder aufgelöst.": "Internal, cross-assembly parameter. Contains the LogicalTaskTreeViewModel as IViewModelRoot to avoid a direct assembly reference to Vishnu.ViewModel. Is resolved again within the Vishnu.ViewModel assembly.",
    "Enthält weitergehende Informationen zum Trigger. Implementiert sind NextRun und NextRunInfo. Für das Hinzufügen weiterer Informationen kann diese Property und/oder die Klasse TriggerInfo abgeleitet werden.": "Contains further information about the trigger. NextRun and NextRunInfo are implemented. This property and/or the TriggerInfo class can be derived to add further information.",
    "Die von TriggerBase abgeleitete Klasse kann diesen Namen setzen. Er wird dann später in OnTriggerFired im TreeEvent mitgegeben.": "The class derived from TriggerBase can set this name. It is then passed later in OnTriggerFired in the TreeEvent.",
    "Der nächste Trigger-Zeitpunkt.": "The next trigger time.",
    "Info-Text über den nächsten Trigger-Zeitpunkt: bei TimerTriggern ein DateTime.Now.ToString(); bei sonstigen Triggern eine andere geeignete Information.": "Info text about the next trigger time: for TimerTriggers a DateTime.Now.ToString(); for other triggers other suitable information.",
    "Der Index des Screens, in dem zum Zeitpunkt des Abspeicherns das MainWindow angezeigt wird.": "The index of the screen in which the MainWindow is displayed at the time of saving.",
    "0: Tree-Ansicht, 1: Jobs-Ansicht.": "0: Tree view, 1: Jobs view.",
    "True wenn mindestens ein Scrollbar sichtbar ist.": "True if at least one scrollbar is visible.",
    "X-Koordinate der mittleren Bildschirmposition des Fensters (Einheit: geräteunabhängige Pixel).": "X coordinate of the center screen position of the window (unit: device-independent pixels).",
    "Y-Koordinate der mittleren Bildschirmposition des Fensters (Einheit: geräteunabhängige Pixel).": "Y-coordinate of the center screen position of the window (unit: device-independent pixels).",
    "Höhe des Fensters (Einheit: geräteunabhängige Pixel).": "Height of the window (unit: device-independent pixels).",
    "Geräteunabhängige Pixel, die der Fensterinhalt nach links verschoben ist (vorzeichenbehaftet).": "Device-independent pixels that the window content is shifted to the left (signed).",
    "Geräteunabhängige Pixel, die der Fensterinhalt nach oben verschoben ist (vorzeichenbehaftet).": "Device-independent pixels that the window content is shifted upwards (signed).",
    "Breite des Fensters (Einheit: geräteunabhängige Pixel).": "Width of the window (unit: device-independent pixels).",
    "Vergrößerungsgrad des Fensterinhalts (vorzeichenbehaftet).": "Degree of enlargement of the window content (signed).",
    "Attached Property (String) für einen zusätzlichen Namen des UserControls.": "Attached property (string) for an additional name of the UserControl.",
    "Übernimmt den aktuellen, spezifischen DataContext für Vishnu als IVishnuViewModel.": "Adopts the current, specific DataContext for Vishnu as IVishnuViewModel.",
    "ReferencedNodePath": "ReferencedNodePath",
    "Name + Id + GUID": "Name + Id + GUID",
    "ItemsSource für eine einfache Auflistung von Endknoten des Trees.": "ItemsSource for a simple listing of end nodes of the tree.",
    "Liefert oder setzt die Zeilenanzahl für das enthaltende Grid.": "Gets or sets the number of rows for the containing grid.",
    "ViewModel für den LogicalTaskTree.": "ViewModel for the LogicalTaskTree.",
    "Returns true, wenn der Tree gerade pausiert wurde.": "Returns true if the tree has just been paused.",
    "Listet in einem String mögliche Exceptions der Child-Knoten durch Zeilenumbruch getrennt auf.": "Lists possible exceptions of the child nodes in a string, separated by a line break.",
    "Command für den Break-Button im LogicalTaskTreeControl.": "Command for the Break button in the LogicalTaskTreeControl.",
    "Veröffentlicht einen ButtonText entsprechend this._myLogicalNode.IsActive.": "Publishes a ButtonText corresponding to this._myLogicalNode.IsActive.",
    "Veröffentlicht einen ButtonText entsprechend this._myLogicalNode.CanTreeStart.": "Publishes a ButtonText corresponding to this._myLogicalNode.CanTreeStart.",
    "Bei true befindet sich der Job in aktivem, gleich gestartetem Zustand.": "If true, the job is in an active, immediately started state.",
    "Command für den Run-Button im LogicalTaskTreeControl.": "Command for the Run button in the LogicalTaskTreeControl.",
    "Command für den Run-or-Break-Button im LogicalTaskTreeControl.": "Command for the Run-or-Break button in the LogicalTaskTreeControl.",
    "Die Kinder des aktuellen Knotens.": "The children of the current node.",
    "Dient als erster Bindungsanker zur Attached Property ExpanderBehavior.CollapsedCommandProperty.": "Serves as the first binding anchor for the attached property ExpanderBehavior.CollapsedCommandProperty.",
    "Name + (Id + gegebenenfalls ReferencedNodeId) der ursprünglich referenzierten SingleNode.": "Name + (Id + ReferencedNodeId, if applicable) of the originally referenced SingleNode.",
    "Dient als erster Bindungsanker zur Attached Property ExpanderBehavior.ExpandedCommandProperty.": "Serves as the first binding anchor for the attached property ExpanderBehavior.ExpandedCommandProperty.",
    "Freitext für beliebige Anwendungen.": "Free text for any application.",
    "Nur bei der Root-Node False.": "False only for the root node.",
    "Enthält TreeParams.Name und IdInfo des Knotens, in dessen Events sich dieses LogicalNodeViewModel eingehängt hat oder den Text &quot;NULL&quot;.": "Contains TreeParams.Name and IdInfo of the node in whose events this LogicalNodeViewModel is attached or the text &quot;NULL&quot;.",
    "True, wenn der TreeView-Knoten, welcher mit diesem Knoten assoziiert ist, ausgewählt ist.": "True if the TreeView node associated with this node is selected.",
    "True zeigt an, dass es sich um einen Knoten innerhalb eines geladenen Snapshots handelt.": "True indicates that this is a node within a loaded snapshot.",
    "Merkfeld für den letzten Zustand von Logical, der nicht null war; Wird benötigt, damit Worker nur dann gestartet werden, und die Anzeige wechselt, wenn sich der Zustand von Logical signifikant geändert hat und nicht jedes mal, wenn der Checker arbeitet (Lo": "Flag field for the last state of Logical that was not zero; required so that workers are only started and the display only changes if the state of Logical has changed significantly and not every time the checker works (Lo",
    "Zeitpunkt des letzten Starts des Knoten als String.": "Time of the last start of the node as a string.",
    "Das logische Ergebnis des zugehörigen LogicalTaskTree-Knotens für die UI verfügbar gemacht.": "The logical result of the associated LogicalTaskTree node is made available for the UI.",
    "Kombinierte Ausgabe von NextRunInfo (wann ist der nächste Durchlauf) und Result (in voller Länge).": "Combined output of NextRunInfo (when is the next run) and Result (in full length).",
    "Liste mit allen Result-Objekten der Vorgänger des Teilbaums.": "List with all result objects of the subtree's predecessors.",
    "Id der ursprünglich referenzierten SingleNode.": "Id of the originally referenced SingleNode.",
    "Der übergeordnete Knoten im ViewModel.": "The parent node in the ViewModel.",
    "Ein Text für die Anzahl der beendeten Endknoten dieses Teilbaums zur Anzeige im ProgressBar (i.d.R. nnn%) für die UI verfügbar gemacht.": "A text for the number of completed end nodes of this subtree for display in the ProgressBar (usually nnn%) is made available for the UI.",
    "Liste von ReturnObjekten der zugeordneten LogicalNode und ihrer Kinder.": "List of ReturnObjects of the assigned LogicalNode and its children.",
    "Liefert die für den Knoten gültige Root-JobList.": "Returns the root job list valid for the node.",
    "Kurztext für Exceptions der zugeordneten LogicalNode.": "Short text for exceptions of the assigned LogicalNode.",
    "Die Anzahl der Endknoten dieses Teilbaums für die UI verfügbar gemacht.": "The number of end nodes of this subtree made available for the UI.",
    "Die Anzahl der beendeten Endknoten dieses Teilbaums für die UI verfügbar gemacht.": "The number of completed end nodes of this subtree is made available for the UI.",
    "Das Ende einer möglichen Ruhezeit als formatierter String.": "The end of a possible rest period as a formatted string.",
    "Der Haupt-Dispatcher-Thread.": "The main dispatcher thread.",
    "Das MainWindow.": "The MainWindow.",
    "Gibt an, ob das Element visible, hidden oder collapsed ist.": "Indicates whether the element is visible, hidden or collapsed.",
    "Reicht einen u.U. aus mehreren technischen Quellen kombinierten Zustand als Aufzählungstyp an die GUI (und den IValueConverter) weiter.": "Passes a state, possibly combined from several technical sources, to the GUI (and the IValueConverter) as an enumeration type.",
    "Kombinierter NodeWorkerState für alle zugeordneten NodeWorker.": "Combined NodeWorkerState for all assigned NodeWorkers.",
    "ItemsSource für optionale Zusatz-Infos zum Tree.": "ItemsSource for optional additional information about the tree.",
    "Setzt die Fenstergröße unter Berücksichtigung von Maximalgrenzen auf die Höhe und Breite des Inhalts und die Property SizeToContent auf WidthAndHeight.": "Sets the window size to the height and width of the content, taking maximum limits into account, and the SizeToContent property to WidthAndHeight.",
    "Liste von JobListViewModels mit ihren Checkern.": "List of JobListViewModels with their checkers.",
    "Ruft die Vishnu Onlinehilfe auf.": "Calls up the Vishnu online help.",
    "Der Titel des Haupt-Fensters.": "The title of the main window.",
    "Pfad zur Dll, bei der der Ladefehler auftrat.": "Path to the dll where the loading error occurred.",
    "ItemsSource für die TreeView in LogicalTaskTreeControl.": "ItemsSource for the TreeView in LogicalTaskTreeControl.",
    "Bestimmt die Ausrichtung bei der Darstellung der Elemente im Tree.": "Determines the alignment of the elements in the tree.",
    "Liefert das RootJobListViewModel des LogicalTaskTreeViewModels inklusive Setter.": "Returns the RootJobListViewModel of the LogicalTaskTreeViewModel including setter.",
    "True, wenn der Snapshot nicht geladen werden konnte und durch einen Default-Snapshot ersetzt wurde.": "True if the snapshot could not be loaded and was replaced by a default snapshot.",
    "Bei True befindet sich diese NodeList innerhalb eies Snapshots.": "With True, this NodeList is located within a snapshot.",
    "Command für den Refresh des Snapshots.": "Command for refreshing the snapshot.",
    "Herkunft des Snapshots.": "Origin of the snapshot.",
    "Zeitpunkt der letzten Aktualisierung des Snapshots.": "Time of the last update of the snapshot.",
    "Command für das ContextMenuItem &quot;Lösche Infos&quot; im ContextMenu für das &quot;MainGrid&quot; des Controls.": "Command for the ContextMenuItem &quot;Delete info&quot; in the ContextMenu for the &quot;MainGrid&quot; of the control.",
    "Command für den Copy-Button im ToolTip des Controls.": "Command for the Copy button in the ToolTip of the control.",
    "Liefert oder setzt die Spalte im enthaltenden Grid für das aktuelle Element.": "Gets or sets the column in the containing grid for the current element.",
    "Liefert oder setzt die Zeile im enthaltenden Grid für das aktuelle Element.": "Gets or sets the row in the containing grid for the current element.",
    "Zeigt an, ob das zugehörige Control vollständig gezeichnet wurde.": "Indicates whether the associated control has been completely drawn.",
    "Indicates that a ui-triggered background progress is actually running.": "Indicates that a ui-triggered background progress is actually running.",
    "Command für das ContextMenuItem &quot;Log Tree&quot; im ContextMenu für das &quot;MainGrid&quot; des Controls.": "Command for the ContextMenuItem &quot;Log Tree&quot; in the ContextMenu for the &quot;MainGrid&quot; of the control.",
    "Das Control zu diesem ViewModel.": "The control for this ViewModel.",
    "Command für das ContextMenuItem &quot;Pause Tree&quot; im ContextMenu für das &quot;MainGrid&quot; des Controls.": "Command for the ContextMenuItem &quot;Pause Tree&quot; in the ContextMenu for the &quot;MainGrid&quot; of the control.",
    "Command für das ContextMenuItem &quot;Reload&quot; im ContextMenu für das &quot;MainGrid&quot; des Controls.": "Command for the ContextMenuItem &quot;Reload&quot; in the ContextMenu for the &quot;MainGrid&quot; of the control.",
    "ViewModel des übergeordneten LogicalTaskTree.": "ViewModel of the parent LogicalTaskTree.",
    "Command für das ContextMenuItem &quot;Zeige Infos&quot; im ContextMenu für das &quot;MainGrid&quot; des Controls.": "Command for the ContextMenuItem &quot;Show info&quot; in the ContextMenu for the &quot;MainGrid&quot; of the control.",
    "Command für das ContextMenuItem &quot;Show Log&quot; im ContextMenu für das &quot;MainGrid&quot; des Controls.": "Command for the ContextMenuItem &quot;Show Log&quot; in the ContextMenu for the &quot;MainGrid&quot; of the control.",
    "Command für das ContextMenuItem &quot;Show Settings&quot; im ContextMenu für das &quot;MainGrid&quot; des Controls.": "Command for the ContextMenuItem &quot;Show Settings&quot; in the ContextMenu for the &quot;MainGrid&quot; of the control.",
    "Command für das ContextMenuItem &quot;Show Vishnu Help&quot; im ContextMenu für das &quot;MainGrid&quot; des Controls.": "Command for the ContextMenuItem &quot;Show Vishnu Help&quot; in the ContextMenu for the &quot;MainGrid&quot; of the control.",
    "Command für das Umschalten der Tree-Darstellung.": "Command for switching the tree display.",
    "Liefert das Ergebnis von GetToolTipInfo(). Diese Routine zeigt per Default auf NextRunInfoAndResult, kann aber gegebenenfalls überschrieben werden.": "Returns the result of GetToolTipInfo(). This routine points to NextRunInfoAndResult by default, but can be overwritten if necessary.",
    "Eindeutiger GlobalUniqueIdentifier. Wird im Konstruktor vergeben und fließt in die überschriebene Equals-Methode ein.": "Unique GlobalUniqueIdentifier. Is assigned in the constructor and flows into the overwritten Equals method.",
    "Attached Property (bool). Bei true soll sich das Control auf dem Bildschirm zentrieren.": "Attached property (bool). If true, the control should be centered on the screen.",
    "Attached Property (ICommand) für das Collapsed-Event eines Expanders.": "Attached property (ICommand) for the collapsed event of an expander.",
    "Attached Property (ICommand) für das SizeChanged-Event eines Expanders.": "Attached property (ICommand) for the SizeChanged event of an expander.",
    "Attached Property (bool). Bei true hat der Knoten Child-Knoten.": "Attached property (bool). If true, the node has child nodes.",
    "Attached Property (Orientation), Horizontal oder Vertical.": "Attached Property (Orientation), Horizontal or Vertical.",
    "Property für die OrientationModificationProperty.": "Property for the OrientationModificationProperty.",
    "Bei 1 mit der Job-Ansicht gestartet, ansonsten mit der Tree-Ansicht (default: 0).": "If 1, start with the job view, otherwise with the tree view (default: 0).",
    "Wesentlichen Darstellungsmerkmale des Vishnu-MainWindows. Werden beim Start der Anwendung aus den AppSettings gefüllt.": "Essential display features of the Vishnu MainWindow. Are filled from the AppSettings when the application is started.",
    "Ganz links auf dem aktuellen Screen.": "Far left on the current screen.",
    "Ganz oben auf dem aktuellen Screen.": "At the top of the current screen.",
    "Bei true werden mehrere Bildschirme als ein einziger großer Bildschirm behandelt, ansonsten zählt für Größen- und Positionsänderungen der Bildschirm, auf dem sich das MainWindow hauptsächlich befindet (ActualScreen). Wird aktuell (02.02.": "If true, several screens are treated as a single large screen, otherwise the screen on which the MainWindow is mainly located (ActualScreen) counts for size and position changes. If currently (02.02.",
    "Pfad zur Dll, die nicht geladen werden konnte.": "Path to the dll that could not be loaded.",
    "ViewModel für einen Ladefehler-Knoten.": "ViewModel for a loading error node.",
    "Dieser Teil der Vishnu-Dokumentation richtet sich an Software-Entwickler oder Anwender, die Grundkenntnisse in der Entwicklung von .Net Software haben.": "This part of the Vishnu documentation is aimed at software developers or users who have basic knowledge of .Net software development.",
    "Kapselt den Aufruf einer externen Arbeitsroutine, die dynamisch als Dll-Plugin geladen wird.": "Encapsulates the call of an external work routine that is dynamically loaded as a Dll plug-in.",
    "Statische Klasse für die Speicherung von JobList-Zuständen auf User-Anforderung. Es wird für jede JobList gespeichert, ob sie in der Bildschirmdarstellung zusammengefaltet ist (collapsed) oder ihre Unterknoten sichtbar sind.": "Static class for saving JobList states on user request. It is saved for each JobList whether it is collapsed in the screen display or whether its sub-nodes are visible.",
    "Interface für Lieferanten von Jobs für JobList-Knoten im LogicalTaskTree.": "Interface for suppliers of jobs for JobList nodes in the LogicalTaskTree.",
    "Konkreter Job für eine Joblist in einem LogicalTaskTree.": "Concrete job for a job list in a LogicalTaskTree.",
    "Wird automatisch generiert, wenn der Name eines Jobs innerhalb eines logischen Ausdrucks mehrfach auftritt. Stellt das Gruppen-Ergebnis des zuerst aufgetretenen Jobs gleichen Namens ähnlich wie in einem Einzelknoten dar.": "Is generated automatically if the name of a job occurs more than once within a logical expression. Represents the group result of the first job with the same name as in a single node.",
    "Root eines (Teil-)Baums eines LogicalTaskTree. Hier werden die Logik, Bedingungen, Status für einen (Teil-)Baum verwaltet. Diese Klasse wird von außen mit der Logik und den Details (Worker, Namen, boolescher Ausdruck, etc.) bestückt.": "Root of a (sub)tree of a LogicalTaskTree. The logic, conditions and status for a (sub)tree are managed here. This class is populated externally with the logic and details (worker, name, Boolean expression, etc.).",
    "Container für einen Job, einen logischen Namen für diesen Job und einen optionalen Dateipfad zum Job-File.": "container for a job, a logical name for this job and an optional file path to the job file.",
    "Basisklasse für alle JobProvider; muss abgeleitet werden. implementiert IJobProvider.": "Base class for all JobProviders; must be derived. implements IJobProvider.",
    "Klassendefinition für einen undefinierten JobProvider.": "Class definition for an undefined JobProvider.",
    "Kapselt den Aufruf eines externen Loggers, der dynamisch als Dll-Plugin geladen wird.": "Encapsulates the call of an external logger that is dynamically loaded as a Dll plug-in.",
    "Abstrakte Basisklasse für einen Knoten im LogicalTaskTree.": "Abstract base class for a node in the LogicalTaskTree.",
    "Wird aufgerufen, wenn sich der Ergebnis-Zustand eines Knotens geändert hat.": "Is called up when the result status of a node has changed.",
    "Enthält einen nach erweiterten logischen Ausdrücken augebauten, hierarchisch strukturierten Tree mit Blättern, in denen benutzerspezifische Verarbeitungsknoten dynamisch eingehängt werden können. Dient als Framework zur Prozess-Überwachung und -Steuerung.": "Contains a hierarchically structured tree based on extended logical expressions with leaves in which user-specific processing nodes can be dynamically inserted. Serves as a framework for process monitoring and control.",
    "Basisklasse für NodeChecker und ValueModifier; implementiert INodeChecker; muss abgeleitet werden.": "Base class for NodeChecker and ValueModifier; implements INodeChecker; must be derived.",
    "Wird automatisch generiert, wenn der Name eines Einzelknotens innerhalb eines logischen Ausdrucks mehrfach auftritt.": "Is generated automatically if the name of a single node occurs more than once within a logical expression.",
    "Knoten mit Kindern in LogicalTaskTree.": "Nodes with children in LogicalTaskTree.",
    "Funktion: Basisklasse für Knoten mit Kindern: NodeList und NodeConnector.": "Function: Base class for nodes with children: NodeList and NodeConnector.",
    "Vergleicht i.d.R. zwei oder mehr Result.ReturnObjects möglichst typgerecht über einen übergebenen Vergleichsoperator miteinander. Unterstützte Typen sind: bool, DateTime, int, double und String.": "Generally compares two or more Result.ReturnObjects with each other using a transferred comparison operator, if possible according to type. Supported types are: bool, DateTime, int, double and String.",
    "Basisklasse für CheckerShell, TriggerShell, WorkerShell. Stellt Parameter-Ersetzung zur Verfügung. Berücksichtigt eine lokale IParameterReplacer-Dll oder eine solche im UserAssemblies Verzeichnis. Stellt bool CanRun() zur Verfügung.": "Base class for CheckerShell, TriggerShell, WorkerShell. Provides parameter replacement. Considers a local IParameterReplacer dll or one in the UserAssemblies directory. Provides bool CanRun().",
    "Dummy-JobProvider für Snapshots.": "Dummy-JobProvider for snapshots.",
    "Sucht, lädt und liefert Jobs für JobList-Knoten im LogicalTaskTree.": "Searches, loads and delivers jobs for JobList nodes in the LogicalTaskTree.",
    "Endknoten in einem LogicalTaskTree. Besitzt einen Checker, der die Arbeit macht und ein logisches Ergebnis zurück liefert, ggf. auch noch ein Rückgabe-Objekt.": "End node in a LogicalTaskTree. Has a checker that does the work and returns a logical result, possibly also a return object.",
    "Knoten in einem LogicalTaskTree, der zur Anzeige eines Remote-LogicalTaskTree dient.": "Node in a LogicalTaskTree that is used to display a remote LogicalTaskTree.",
    "Wird aufgerufen, wenn der Snapshot refreshed wurde.": "Is called up when the snapshot has been refreshed.",
    "Verwaltet ein statisches Dictionary von Namen und Lock-Objekten. Sperrt und entsperrt das einem Namen zugeordnete Objekt global.": "Manages a static dictionary of names and lock objects. Locks and unlocks the object assigned to a name globally.",
    "Trigger für interne Events aus dem Tree. Macht Tree-Events für Trigger &quot;von außen&quot; nutzbar und erweitert so das Trigger-Einsatzspektrum. Ein TreeEventTrigger triggert 1 bis n Checker.": "Trigger for internal events from the tree. Makes tree events usable for triggers &quot;from outside&quot; and thus extends the trigger application spectrum. A TreeEventTrigger triggers 1 to n checkers.",
    "Kapselt einen internen (TreeEvent-) oder externen (Dll-) Trigger.": "Encapsulates an internal (TreeEvent) or external (Dll) trigger.",
    "Klassendefinition für einen undefinierten Job.": "Class definition for an undefined job.",
    "Klassendefinition für eine undefinierte JobList.": "Class definition for an undefined JobList.",
    "Klassendefinition für eine undefinierte LogicalNode.": "Class definition for an undefined LogicalNode.",
    "Filtert das ReturnObject eines INodeCheckers nach Typ und ggf. Format-String.": "Filters the ReturnObject of an INodeChecker by type and, if applicable, format string.",
    "Dictionary, das WorkerShell-Arrays zu aus Knoten-Id + &quot;:&quot; + TreeEvents gebildeten Keys enthält.": "Dictionary that contains WorkerShell arrays for keys formed from node ID + &quot;:&quot; + TreeEvents.",
    "Kapselt den Aufruf einer externen Arbeitsroutine, die als Reaktion auf eine definierte Änderung des Tree-Zustands (TreeEvent) als externe Exe ausgeführt wird (fire and forget) TODO: später eventuell auch als lightweight Dll-Plugin realisieren.": "Encapsulates the call of an external work routine, which is executed as an external exe in response to a defined change in the tree state (TreeEvent) (fire and forget) TODO: may also be realized later as a lightweight Dll plug-in.",
    "DotNet 7.0 threading helper class. Behaves like Thread, except the following specials: - Abort() works similarly to previous runtime versions; - Abortable offers an additional property 'AbortableException'; - Abortable implements IDisposable.": "DotNet 7.0 threading helper class. Behaves like Thread, except the following specials: - Abort() works similarly to previous runtime versions; - Abortable offers an additional property 'AbortableException'; - Abortable implements IDisposable.",
    "Zeigt an, dass die implementierende Instanz eine parameterlose Methode zum Aufräumen und ggf. Wegschreiben gesammelter Informationen bietet.": "Indicates that the implementing instance provides a parameterless method for cleaning up and, if necessary, writing away collected information.",
    "Bildet die komplette Sicht auf den InfoController ab, umfasst das Abschicken und Empfangen von Nachrichten.": "Depicts the complete view of the InfoController, including sending and receiving messages.",
    "Bildet die Sicht auf den InfoController ab, die das Abschicken von Nachrichten umfasst.": "Depicts the view of the InfoController, which includes the sending of messages.",
    "Bildet die Sicht auf den InfoController ab, die das Empfangen von Nachrichten umfasst.": "Depicts the view of the InfoController that includes the receipt of messages.",
    "Muss von einem Viewer implementiert werden, der sich beim InfoController (IInfoSource) anmelden will.": "Must be implemented by a viewer that wants to log on to the InfoController (IInfoSource).",
    "Die Gesamt-Information, die vom InfoController verarbeitet und weitergegeben wird: Message-Object + Message-Typ + Timestamp.": "The total information that is processed and forwarded by the InfoController: Message object + message type + timestamp.",
    "Singleton, dispatcht Meldungen unter Berücksichtigung ihrer Schweregrade. Verwaltet eine Delegate-Liste, in die sich Viewer eintragen können, die dann bei Eingang einer neuen Message von InfoController informiert werden.": "Singleton, dispatches messages according to their severity. Manages a delegate list in which viewers can enter themselves, who are then informed by InfoController when a new message is received.",
    "Aufzählung der möglichen Typen einer Information.": "Enumeration of the possible types of information.",
    "Liefert Typen und Klassen für den InfoController.": "Provides types and classes for the InfoController.",
    "Zeigt an, dass die implementierende Instanz eine parameterlose Methode zur Ausgabe bietet; bei Loggern z.B. zum Ausgeben des Logs.": "Indicates that the implementing instance offers a parameterless method for output; in the case of loggers, for example, to output the log.",
    "Schreibt Messages mit hinzugefügten Timestamps in Logfiles; implementiert IInfoViewer.": "Writes messages with added timestamps to log files; implements IInfoViewer.",
    "Abstrakte Basis für diverse Logger; implementiert IInfoViewer.": "Abstract basis for various loggers; implements IInfoViewer.",
    "Provides Windows message handling via System.Runtime.InteropServices.": "Provides Windows message handling via System.Runtime.InteropServices.",
    "Statische Routinen für den Umgang mit Prozessen.": "Static routines for handling processes.",
    "Ermöglicht statistische Auswertungen ohne das System bei häufig durchlaufenen Zählstellen mit zu vielen Log-Aufrufen zu belasten. Kann über Timer oder Anzahl Zählvorgänge getriggert werden.": "Enables statistical evaluations without burdening the system with too many log calls for frequently passed counting points. Can be triggered via timer or number of counting processes.",
    "Führt eine übergebene Action in einer eigenen Task aus.": "Executes a transferred action in a separate task.",
    "Aufzählungstyp für verschiedene Task-Zustände.": "Enumeration type for various task states.",
    "Wrapperklasse um einen EventHandler; Implementiert IInfoViewer. Eine Instanz dieser Klasse kann um einen EventHandler&lt;InfoArgs&gt; gewrappt werden und als Viewer weiterverwendet werden.": "Wrapper class around an EventHandler; implements IInfoViewer. An instance of this class can be wrapped around an EventHandler&lt;InfoArgs&gt; and used as a viewer.",
    "Verwaltet eine Liste von IGetStringValue-Objekten und fragt diese der Reihe nach ab um das erste gültige Ergebnis selbst wieder als IGetStringValue an den Aufrufer zurück zu geben.": "Manages a list of IGetStringValue objects and queries them one after the other to return the first valid result to the caller as IGetStringValue.",
    "Stellt für mehrere AppEnvReader-Instanzen ein gemeinsames statisches ConcurrentDictionary zur Verfügung, über das eine gemeinsame Parameterliste verwaltet werden kann.": "Provides a shared static ConcurrentDictionary for multiple AppEnvReader instances, which can be used to manage a shared parameter list.",
    "Holt Applikationseinstellungen aus verschiedenen Quellen: Kommandozeile, app.config, ggf. app.config.user, Environment. Implementiert auch das Lesen der Registry, nutzt dies aber selbst noch nicht.": "Retrieves application settings from various sources: Command line, app.config, possibly app.config.user, environment. Also implements reading of the registry, but does not yet use this itself.",
    "Spezieller Exception-Typ für ClickOnce-Exceptions.": "Special exception type for ClickOnce exceptions.",
    "This is a partial replacement for ApplicationDeployment which is not available in .NET 6 We use a custom Launcher.exe which will set various &quot;CLICKONCE_*&quot; local environment variables Thanks to Simon Hewitt (simmotech) for this helpful workaround.": "This is a partial replacement for ApplicationDeployment which is not available in .NET 6 We use a custom Launcher.exe which will set various &quot;CLICKONCE_*&quot; local environment variables Thanks to Simon Hewitt (simmotech) for this helpful workaround.",
    "Klasse mit ClickOnce-Updateinformationen.": "Class with ClickOnce update information.",
    "Zugriffe auf Kommandozeilen-Parameter Implementiert IGetStringValue. Minimal-Funktionalität: Wenn der übergebene Key in der Kommandozeile existiert, wird dieser unverändert zurückggegeben, ansonsten der Default Value.": "Accesses command line parameters Implements IGetStringValue. Minimal functionality: If the passed key exists in the command line, it is returned unchanged, otherwise the default value is returned.",
    "Zugriffe auf das Environment und auf einige Application-Properties. Implementiert IGetStringValue.": "Accesses the environment and some application properties. Implements IGetStringValue.",
    "Zugriffe auf Properties der aktuellen Anwendung (AppSettings). Nutzt System.Reflection, implementiert IGetStringValue.": "Accesses properties of the current application (AppSettings). Uses System.Reflection, implements IGetStringValue.",
    "Liest Werte aus der Registry ein.": "Reads values from the registry.",
    "Aufzählung der Registry-Rootkeys.": "Enumeration of the registry root keys.",
    "Zugriffe auf die über das .Net-Framework verwalteten AppSettings Implementiert IGetStringValue.": "Accesses the AppSettings managed via the .Net framework Implements IGetStringValue.",
    "Stellt eine ProgressBar mit zusätzlichen Eigenschaften zur Verfügung: abschaltbarer glow-Effekt, wählbare Farbe, zentrierter Zusatztext.": "Provides a ProgressBar with additional features: switchable glow effect, selectable color, centered additional text.",
    "Definiert einen eigenen Klassentyp für eine einfache String-Message, damit diese vom InfoController über den Typ gesondert von anderen Messages behandelt werden kann.": "Defines a separate class type for a simple string message so that it can be handled separately from other messages by the InfoController via the type.",
    "Demo-Logik für SplashWindow (thanks to amr azab, http://www.codeproject.com/Articles/116875/WPF-Loading-Splash-Screen, and Nate Lowry, http://blog.dontpaniclabs.com/post/2013/11/14/Dynamic-Splash-Screens-in-WPF).": "Demo logic for SplashWindow (thanks to amr azab, http://www.codeproject.com/Articles/116875/WPF-Loading-Splash-Screen, and Nate Lowry, http://blog.dontpaniclabs.com/post/2013/11/14/Dynamic-Splash-Screens-in-WPF).",
    "Standalone Webbrowser zur Anzeige der Vishnu Onlinehilfe. Die Anwendung merkt sich die Position und Größe dieses Bildschirms und stellt sie beim nächsten Aufruf wieder her. Ebenso wird mit der letzten Url verfahren.": "Standalone web browser for displaying Vishnu online help. The application remembers the position and size of this screen and restores it the next time it is called up. The same applies to the last url.",
    "Stellt ein ContentControl mit zusätzlichen Eigenschaften zur Verfügung: Zoom-Funktionen über Strg-Mausrad, vertikales Scrollen über Mausrad, horizontales Scrollen über Umschalt-Mausrad, Normalansicht über rechte Maustaste, Komplettansicht über Strg-rechte": "Provides a ContentControl with additional properties: Zoom functions via Ctrl-mouse wheel, vertical scrolling via mouse wheel, horizontal scrolling via Shift-mouse wheel, normal view via right mouse button, complete view via Ctrl-right mouse button.",
    "Ein Parser für arithmetische Ausdrücke (experimentell). Erstellt aus einem Textausdruck einen äquivalenten Baum.": "A parser for arithmetic expressions (experimental). Creates an equivalent tree from a text expression.",
    "Ein Parser für boolesche Ausdrücke. Erstellt aus einem Textausdruck einen äquivalenten Baum.": "A parser for Boolean expressions. Creates an equivalent tree from a text expression.",
    "Ein Parser für allgemeine Ausdrücke. Erstellt aus einem Textausdruck einen äquivalenten Baum. Muss abgeleitet werden; in der Ableitung muss dann die Syntax definiert werden.": "A parser for general expressions. Creates an equivalent tree from a text expression. Must be derived; the syntax must then be defined in the derivation.",
    "Ein Parser für erweiterte boolesche Ausdrücke. Es werden zusätzlich zu den in BooleanParser definierten Operatoren Operatoren für 'kleiner', 'gleich' und 'größer' berücksichtigt.": "A parser for extended Boolean expressions. In addition to the operators defined in BooleanParser, operators for 'less than', 'equal to' and 'greater than' are taken into account.",
    "Allgemeine Syntaxelemente, die in einem logischen Ausdruck vorkommen können.": "General syntax elements that can occur in a logical expression.",
    "Generischer Tree mit geparstem logischem oder arithmetischen Ausdruck. Funktion: Wertet Ausdrücke aus und erstellt passende Syntax-Bäume.": "Generic tree with parsed logical or arithmetic expression. Function: Evaluates expressions and creates suitable syntax trees.",
    "Ein Parser mit der Fähigkeit, Schwellenwert-Operatoren aufzulösen. Abgeleitet vom Parser für erweiterte boolesche Ausdrücke. Es werden zusätzlich zu den in LogicalParser definierten Operatoren neun Operatoren für 10%, 20%, ...": "A parser with the ability to resolve threshold operators. Derived from the parser for extended Boolean expressions. In addition to the operators defined in LogicalParser, nine operators for 10%, 20%, ...",
    "Gibt Textzeilen oder eine existierende Textdatei in NotePad.exe aus.": "Outputs lines of text or an existing text file in NotePad.exe.",
    "Liest Werte aus einer ini-Datei ein.": "Reads values from an ini file.",
    "Liest Werte aus einer Konfigurationsdatei (Xml) ein.": "Reads values from a configuration file (xml).",
    "Funktion: Routinen zum Packen und Entpacken von ZIP-Archiven. Nutzt die ICSharpCode.SharpZipLib.dll.": "Function: Routines for packing and unpacking ZIP archives. Uses the ICSharpCode.SharpZipLib.dll.",
    "Stellt ein paar allgemeine Hilfsroutinen für alle beteiligten Klassen zur Verfügung.": "Provides a few general help routines for all classes involved.",
    "Funktion: Routinen zum Packen und Entpacken von ZIP-Archiven. Nutzt die SevenZipSharp.dll, System.IO.Compress und SevenZip Die mit Ics beginnenden Routinen setzen auf 'ICSharpCode.SharpZipLib.dll' und 7Zip auf.": "Function: Routines for packing and unpacking ZIP archives. Uses SevenZipSharp.dll, System.IO.Compress and SevenZip The routines starting with Ics are based on 'ICSharpCode.SharpZipLib.dll' and 7Zip.",
    "Informationen für eine Datei im Archiv: Pfad, Größe, Timestamp und Flag IsDirectory.": "Information for a file in the archive: path, size, timestamp and IsDirectory flag.",
    "Stellt Methoden für das dynamische Laden von Assemblies und das Instanziieren darin enthaltener Klassen zur Verfügung.": "Provides methods for the dynamic loading of assemblies and the instantiation of classes contained therein.",
    "Statische Helper-Klasse - stellt statische generische Methoden zur Verfügung, welche Dictionaries sperren und kopieren.": "Static helper class - provides static generic methods that lock and copy dictionaries.",
    "Statische Helper-Klasse - stellt eine statische Methode &quot;GetEnumerableThreadSafeCopy&quot; zur Verfügung, welche generische Listen sperrt und kopiert.": "Static helper class - provides a static method &quot;GetEnumerableThreadSafeCopy&quot;, which locks and copies generic lists.",
    "Stellt generische Klassen mit private Standard-Konstruktor als Nicht-Singletons zur Verfügung.": "Provides generic classes with private standard constructor as non-singletons.",
    "Stellt generische Klassen als Singletons zur Verfügung. Hauptvorteil ist, dass die Nutzklassen selbst keine statischen Elemente mehr enthalten müssen und somit prinzipiell vererbbar sind.": "Provides generic classes as singletons. The main advantage is that the user classes themselves no longer have to contain any static elements and can therefore be inherited in principle.",
    "Stellt einen generischen Baum zur Verfügung": "Provides a generic tree",
    "Globale Typen, Konstanten und statische Funktionen Global types, constants and static functions": "Global types, constants and static functions Global types, constants and static functions",
    "Lesen von Values (string) über Keys (string).": "Reading values (string) via keys (string).",
    "Lesen von Values (Typ) über Keys (string).": "Reading values (type) via keys (string).",
    "Leeres Interface zur Markierung von Klassenableitungen als undefined (vermeidet NULL in bestimmten Kontexten).": "Empty interface for marking class derivations as undefined (avoids NULL in certain contexts).",
    "Mindestinformationen über einen Screen. Thanks to Nils on StackOverflow http://stackoverflow.com/questions/1927540/how-to-get-the-size-of-the-current-screen-in-wpf.": "Minimum information about a screen. Thanks to Nils on StackOverflow http://stackoverflow.com/questions/1927540/how-to-get-the-size-of-the-current-screen-in-wpf.",
    "Exportiert das Event &quot;PropertiesChanged&quot; und den Typ &quot;PropertiesChangedEventHandler&quot;. Das Event &quot;PropertiesChanged&quot; kann von LogicalNodeViewmodel abonniert werden.": "Exports the event &quot;PropertiesChanged&quot; and the type &quot;PropertiesChangedEventHandler&quot;. The &quot;PropertiesChanged&quot; event can be subscribed to by LogicalNodeViewmodel.",
    "Kapselt ICommand-Details für WPF-Kommandos.": "Encapsulates ICommand details for WPF commands.",
    "Basisklasse für ViewModels, kapselt INotifyPropertyChanged. Übernommen und angepasst aus einer Version von: Roman Semenov (poma) https://github.com/poma/SshConnect/blob/master/SshConnect/MvvmFoundation/ObservableObject.cs. Vielen Dank für diese Starthilfe.": "Base class for ViewModels, encapsulates INotifyPropertyChanged. Adopted and adapted from a version by: Roman Semenov (poma) https://github.com/poma/SshConnect/blob/master/SshConnect/MvvmFoundation/ObservableObject.cs. Many thanks for this help.",
    "EventArgs für das Event &quot;PropertiesChanged&quot; aus &quot;INotifyPropertiesChanged&quot;. Das Event &quot;PropertiesChanged&quot; kann von LogicalNodeViewmodel abonniert werden.": "EventArgs for the event &quot;PropertiesChanged&quot; from &quot;INotifyPropertiesChanged&quot;. The &quot;PropertiesChanged&quot; event can be subscribed to by LogicalNodeViewmodel.",
    "&quot;PropertiesChangedEventHandler&quot; definiert den Typ einer Eventhandler-Routine für das Event &quot;PropertiesChanged&quot;. &quot;PropertiesChanged&quot; kann von LogicalNodeViewmodel abonniert werden.": "&quot;PropertiesChangedEventHandler&quot; defines the type of an event handler routine for the &quot;PropertiesChanged&quot; event. &quot;PropertiesChanged&quot; can be subscribed to by LogicalNodeViewmodel.",
    "Prüft Expressions als Properties.": "Checks expressions as properties.",
    "AnonymousDataMember oder AnonymousDataMemberAttribute kennzeichnet einen DataMember, der als 'object' deklariert wird, der aber zur Laufzeit Instanzen verschiedener unbekannter Typen enthalten kann.": "AnonymousDataMember or AnonymousDataMemberAttribute identifies a DataMember that is declared as an 'object', but which can contain instances of various unknown types at runtime.",
    "Bietet Unterstützung für die Serialisierung und De-Serialisierung von Objekten.": "Provides support for serialization and de-serialization of objects.",
    "Erbt allgemeingültige Einstellungen von BasicAppSettings oder davon abgeleiteten Klassen und fügt anwendungsspezifische Properties hinzu. Holt Applikationseinstellungen aus verschiedenen Quellen: Kommandozeile, Vishnu.exe.config (app.config), Vishnu.exe.": "Inherits general settings from BasicAppSettings or classes derived from it and adds application-specific properties. Retrieves application settings from various sources: Command line, Vishnu.exe.config (app.config), Vishnu.exe.",
    "Schalter für Dialog-Verhalten. Die konkrete Ausformung der Dialoge wird in der jeweiligen Anwendungssituation festgelegt: None: kein Dialog, Info: Es erfolgt eine Meldung, die nur bestätigt werden kann.": "Switch for dialog behavior. The specific form of the dialogs is defined in the respective application situation: None: no dialog, Info: a message is displayed that can only be confirmed.",
    "Holt Properties aus einer vormals serialisierten Klasse, bei der ein Typecast (in dieselbe Klasse) nicht funktioniert.": "Retrieves properties from a previously serialized class for which a typecast (to the same class) does not work.",
    "Definiert Methoden zum Zugriff auf die oberste JobList des Trees. Wird intern beim Mergen von veränderten Jobs nach Reload genutzt.": "Defines methods for accessing the topmost JobList of the tree. Is used internally when merging changed jobs after a reload.",
    "Stellt die Funktion 'bool CanRun(...)' zur Verfügung.": "Provides the function 'bool CanRun(...)'.",
    "Definiert die notwendigen Eigenschaften eines expandierbaren, respektive zusammenklappbaren Knotens in einem Tree (aus Sicht der Klasse ConfigurationManager).": "Defines the necessary properties of an expandable or collapsible node in a tree (from the point of view of the ConfigurationManager class).",
    "Eine Klasse, die als Prüf-Prozess in einem Endknoten eines LogicalTaskTree arbeiten soll, muss dieses Interface implementieren.": "A class that is to work as a check process in an end node of a LogicalTaskTree must implement this interface.",
    "Interface für eine Klasse, die Logging-Informationen annehmen und verarbeiten kann.": "Interface for a class that can accept and process logging information.",
    "Interface für eine Klasse, die einen Prozess mehrfach anstoßen kann, z.B. TimerTrigger oder FileWatcherTrigger.": "Interface for a class that can trigger a process multiple times, e.g. TimerTrigger or FileWatcherTrigger.",
    "Eine Klasse, die als Worker-Prozess (Aktion bei TreeEvent, z.B. Logical-Änderung) in einem Endknoten eines LogicalTaskTree arbeiten soll, muss dieses Interface implementieren.": "A class that is to work as a worker process (action on TreeEvent, e.g. logical change) in an end node of a LogicalTaskTree must implement this interface.",
    "Interface für Klassen, die Parameter-Werte (string-&gt;string) zur Verfügung stellen.": "Interface for classes that make parameter values (string-&gt;string) available.",
    "Helper für einen ValueModifier; konvertiert einen Wert in einen anderen Wert und/oder ein anderes Format.": "Helper for a ValueModifier; converts a value into another value and/or another format.",
    "Definiert Methoden zum Zugriff auf das oberste JobListViewModel des Trees. Wird intern beim Mergen von veränderten Jobs nach Reload genutzt.": "Defines methods for accessing the top JobListViewModel of the tree. Is used internally when merging changed jobs after a reload.",
    "Interface für eine Klasse, die ein Fremdformat in ein XDocument im Vishnu-Job-Format konvertiert und retourniert.": "Interface for a class that converts a foreign format into an XDocument in Vishnu job format and returns it.",
    "Bietet informativen Zugriff auf eine LogicalNode von Vishnu.": "Provides informative access to a LogicalNode from Vishnu.",
    "Interface für die ViewModels von dynamischen User-Controls.": "Interface for the ViewModels of dynamic user controls.",
    "Ergebnis-Zustände eines Knotens.": "Result states of a node.",
    "Verarbeitungszustände eines Knotens.": "Processing states of a node.",
    "Kombinierbare Typenliste der Endknoten des Trees.": "Combinable type list of the end nodes of the tree.",
    "Zustand evtl. zugeordneter Worker (None, Valid, Invalid).": "Status of any assigned workers (None, Valid, Invalid).",
    "Verändert die Ausrichtung bei der Darstellung der Elemente im jeweiligen Control.": "Changes the alignment when displaying the elements in the respective control.",
    "Nimmt die Ergebnisse eines Knotens des LogicalTaskTree auf.": "Records the results of a node of the LogicalTaskTree.",
    "Typisierte Liste von Results.": "Typed list of results.",
    "Klasse mit diversen Informationen für Ereignisse im LogicalTaskTree.": "Class with various information for events in the LogicalTaskTree.",
    "Parameter, die Checkern bei jedem Aufruf von Vishnu mitgegeben werden (nicht User-spezifisch).": "Parameters that are given to checkers each time Vishnu is called (not user-specific).",
    "Basisklasse für spezifische Trigger - muss abgeleitet werden. Löst abhängig von der jeweiligen Implementierung das Event 'triggerIt' aus. Implementiert die Schnittstelle 'INodeTrigger' aus 'Vishnu.Interchange.": "Base class for specific triggers - must be derived. Triggers the 'triggerIt' event depending on the respective implementation. Implements the interface 'INodeTrigger' from 'Vishnu.Interchange.",
    "Startverhalten von getriggerten Knoten beim Start durch den Anwender (UserRun): None = kein direkter Start, All = alle getriggerten Knoten innerhalb eines durch UserRun gestarteten (Teil-)Trees starten direkt (wie nicht getriggerte Knoten), Direct = alle g": "Start behavior of triggered nodes when started by the user (UserRun): None = no direct start, All = all triggered nodes within a (partial) tree started by UserRun start directly (like non-triggered nodes), Direct = all g",
    "Enthält Informationen zum besitzenden Trigger. Implementiert ist NextRun. Für das Hinzufügen weiterer Informationen kann diese Klasse abgeleitet werden.": "Contains information on the owning trigger. NextRun is implemented. This class can be derived to add further information.",
    "Klassendefinition für ein undefiniertes TreeEvent.": "Class definition for an undefined TreeEvent.",
    "Funktion: Datenklasse mit wesentlichen Darstellungsmerkmalen eines WPF-Windows.": "Function: Data class with essential display features of a WPF window.",
    "Interaktionslogik für ConstantNodeUserControl.": "Interaction logic for ConstantNodeUserControl.",
    "Interaktionslogik für JobConnectorUserControl.": "Interaction logic for JobConnectorUserControl.",
    "Interaktionslogik für JobListUserControl.": "Interaction logic for JobListUserControl.",
    "Interaktionslogik für NodeListUserControl.": "Interaction logic for NodeListUserControl.",
    "Interaktionslogik für SingleNodeUserControl.": "Interaction logic for SingleNodeUserControl.",
    "Interaktionslogik für SnapshotUserControl.": "Interaction logic for SnapshotUserControl.",
    "Ersetzt das LogicalTaskTreeViewModel als Dummy-Parameter beim Reload-Vorgang.": "Replaces the LogicalTaskTreeViewModel as a dummy parameter during the reload process.",
    "Basisklasse für die dynamische Einbindung von UserControls in externen Dlls.": "Base class for the dynamic integration of UserControls in external dlls.",
    "Basisklasse für ViewModels von dynamischen UserControls für Vishnu. Stellt den Zugriff auf User-Properties innerhalb des ReturnObjects des zugeordneten Checkers zur Verfügung.": "Base class for ViewModels of dynamic UserControls for Vishnu. Provides access to user properties within the ReturnObject of the assigned checker.",
    "Interface für die Weiterverarbeitung von ContentRendered-Events.": "Interface for the further processing of ContentRendered events.",
    "ViewModel für einen JobConnector Ist von SingleNodeViewModel und darüber von VishnuViewModelBase abgeleitet.": "ViewModel for a JobConnector Is derived from SingleNodeViewModel and above it from VishnuViewModelBase.",
    "ViewModel für die Darstellung eines logicalTaskTree als gruppierte und gefilterte Liste von Knoten.": "ViewModel for displaying a logicalTaskTree as a grouped and filtered list of nodes.",
    "ViewModel für einen JobList-Knoten in der TreeView in LogicalTaskTreeControl Auch wenn hier keine eigene Funktionalität codiert ist, wird diese Ableitung von LogicalNodeViewModel benötigt, um in der TreeView die unterschiedliche Darstellung der verschieden": "ViewModel for a JobList node in the TreeView in LogicalTaskTreeControl Even if no separate functionality is coded here, this derivation of LogicalNodeViewModel is required in order to display the different representations of the various JobList nodes in the TreeView.",
    "ViewModel für einen Knoten in der TreeView in LogicalTaskTreeControl": "ViewModel for a node in the TreeView in LogicalTaskTreeControl",
    "ViewModel für die Darstellung eines logicalTaskTree in einer TreeView.": "ViewModel for the representation of a logicalTaskTree in a TreeView.",
    "ViewModel für das MainWindow.": "ViewModel for the MainWindow.",
    "ViewModel für einen NodeList-Knoten in der TreeView in LogicalTaskTreeControl Auch wenn hier keine eigene Funktionalität codiert ist, wird diese Ableitung von LogicalNodeViewModel benötigt, um in der TreeView die unterschiedliche Darstellung der verschiede": "ViewModel for a NodeList node in the TreeView in LogicalTaskTreeControl Even if no separate functionality is coded here, this derivation of LogicalNodeViewModel is required in order to display the different representations of the various nodes in the TreeView.",
    "Minimale gemeinsame Basisklasse für LogicalTaskTreeViewModel und DummyLogicalTaskTreeViewModel.": "Minimal common base class for LogicalTaskTreeViewModel and DummyLogicalTaskTreeViewModel.",
    "ViewModel für einen SingleNode-Knoten in der TreeView in LogicalTaskTreeControl Auch wenn hier keine eigene Funktionalität codiert ist, wird diese Ableitung von LogicalNodeViewModel benötigt, um in der TreeView die unterschiedliche Darstellung der verschie": "ViewModel for a SingleNode node in the TreeView in LogicalTaskTreeControl Even if no separate functionality is coded here, this derivation of LogicalNodeViewModel is required to display the different representations of the various nodes in the TreeView.",
    "ViewModel für einen Snapshot eines externen Trees.": "ViewModel for a snapshot of an external tree.",
    "Bietet statische Routinen zur Durchsuchung des VisualTrees und des LogicalTrees.": "Provides static routines for searching the VisualTree and the LogicalTree.",
    "Basisklasse für alle Vishnu-ViewModels. Erbt von ObservableObject u.a. INotifyPropertyChanged und implementiert IVishnuViewModel.": "Base class for all Vishnu ViewModels. Inherits INotifyPropertyChanged from ObservableObject and implements IVishnuViewModel.",
    "Kombinierter Status aus State und LogicalState für die UI.": "Combined status from State and LogicalState for the UI.",
    "Stellt die Enum aus der Business-Logic für die UI zur Verfügung.": "Provides the enum from the business logic for the UI.",
    "Zentriert das Fenster auf dem Screen, wenn sich dessen Größe geändert hat.": "Centers the window on the screen if its size has changed.",
    "Mappt Expander-Events auf Commands.": "Maps expander events to commands.",
    "Statischer Container für Attached Properties.": "Static container for attached properties.",
    "DependencyObject-Hilfsklasse für die DependencyProperty OrientationModification.": "DependencyObject helper class for the DependencyProperty OrientationModification.",
    "Diese Klasse stellt DependencyProperties für die Zeilenzahl und Spaltenzahl von WPF-Grids zur Verfügung. Damit wird es möglich, die Spalten- und Zeilenzahl von Grids zur Laufzeit über Databinding zu setzen.": "This class provides DependencyProperties for the number of rows and columns of WPF grids. This makes it possible to set the number of columns and rows of grids at runtime via data binding.",
    "Converter-Hilfsklasse für BinaryModificationSwitch. Konvertiert OrientationSwitch zu string und umgekehrt.": "Converter helper class for BinaryModificationSwitch. Converts OrientationSwitch to string and vice versa.",
    "Interaktionslogik für LogicalTaskJobGroupsControl.": "Interaction logic for LogicalTaskJobGroupsControl.",
    "Interaktionslogik für LogicalTaskTreeControl.": "Interaction logic for LogicalTaskTreeControl.",
    "Interaktionslogik für MainWindow.": "Interaction logic for MainWindow.",
    "Interaktionslogik für NodeErrorControl.": "Interaction logic for NodeErrorControl.",
    "ValueConverter, wandelt Die Child-Anordnung eines Knotens (Horizontal, Vertical) in eine ExpandDirection für den anzeigenden Expander (Down, Right).": "ValueConverter, converts the child arrangement of a node (Horizontal, Vertical) into an ExpandDirection for the displaying expander (Down, Right).",
    "Compares two Properties (Thanks to Jason Tyler).": "Compares two properties (Thanks to Jason Tyler).",
    "ValueConverter, wandelt einen nicht leeren String in Boolean True.": "ValueConverter, converts a non-empty string to Boolean True.",
    "ValueConverter, wandelt einen nullable bool in Farben: null: gelb, true: grün, false: rot.": "ValueConverter, converts a nullable bool into colors: null: yellow, true: green, false: red.",
    "ValueConverter, wandelt eine Orientation (Horizontal, Vertical) abhängig von einem zusätzlichen Schalter vom Typ OrientationSwitch um: Unchanged=unverändert, Switched=umgedreht, Horizontal=horizontal, Vertical=vertikal.": "ValueConverter, converts an orientation (Horizontal, Vertical) depending on an additional switch of type OrientationSwitch: Unchanged=unchanged, Switched=reversed, Horizontal=horizontal, Vertical=vertical.",
    "Setzt einen Enum-Typ in ein BitmapImage um.": "Converts an enum type into a bitmap image."
}